#ifdef __cplusplus
extern "C" {
#endif

//////////////////
//   C Define   //
//////////////////

#define VOID void
#define STDCALL __stdcall
#define FASTCALL __fastcall
#define CDECL __cdecl
#define THISCALL __thiscall
#define NEAR 
#define FAR 
//---------------------------------------------------------------------

//////////////////
// C Basic Type //
//////////////////

typedef signed char INT8;
typedef signed char CHAR;
typedef signed short INT16;
typedef signed int INT32;
typedef signed int BOOL;
typedef signed __int64 INT64;
typedef signed __int64 LONG64;
typedef signed long LONG32;
typedef unsigned char UINT8;
typedef unsigned char BYTE;
typedef unsigned short UINT16;
typedef unsigned short WCHAR;
typedef unsigned int UINT32;
typedef unsigned __int64 UINT64;
typedef unsigned __int64 ULONG64;
typedef unsigned long ULONG32;
typedef float FLOAT32;
typedef double FLOAT64;
typedef struct {unsigned short W[5];} FLOAT80;
typedef struct { __int64 LowPart;__int64 HighPart;} FLOAT128;
typedef double DATE;
typedef signed long HRESULT;
typedef union { struct {unsigned long Lo; long Hi;}; __int64 int64;} CURRENCY;
typedef wchar_t OLECHAR;
//---------------------------------------------------------------------

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Enum types

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE  // 3 elements, 0x4 bytes
{
    StandardDesign  = 0 /*0x0*/,
    NEC98x86        = 1 /*0x1*/,
    EndAlternatives = 2 /*0x2*/
}ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

typedef enum _ARBITER_ACTION  // 10 elements, 0x4 bytes
{
    ArbiterActionTestAllocation          = 0 /*0x0*/,
    ArbiterActionRetestAllocation        = 1 /*0x1*/,
    ArbiterActionCommitAllocation        = 2 /*0x2*/,
    ArbiterActionRollbackAllocation      = 3 /*0x3*/,
    ArbiterActionQueryAllocatedResources = 4 /*0x4*/,
    ArbiterActionWriteReservedResources  = 5 /*0x5*/,
    ArbiterActionQueryConflict           = 6 /*0x6*/,
    ArbiterActionQueryArbitrate          = 7 /*0x7*/,
    ArbiterActionAddReserved             = 8 /*0x8*/,
    ArbiterActionBootAllocation          = 9 /*0x9*/
}ARBITER_ACTION, *PARBITER_ACTION;

typedef enum _ARBITER_REQUEST_SOURCE  // 6 elements, 0x4 bytes
{
    ArbiterRequestUndefined      = -1 /*0xFF*/,
    ArbiterRequestLegacyReported = 0 /*0x0*/,
    ArbiterRequestHalReported    = 1 /*0x1*/,
    ArbiterRequestLegacyAssigned = 2 /*0x2*/,
    ArbiterRequestPnpDetected    = 3 /*0x3*/,
    ArbiterRequestPnpEnumerated  = 4 /*0x4*/
}ARBITER_REQUEST_SOURCE, *PARBITER_REQUEST_SOURCE;

typedef enum _ARBITER_RESULT  // 4 elements, 0x4 bytes
{
    ArbiterResultUndefined        = -1 /*0xFF*/,
    ArbiterResultSuccess          = 0 /*0x0*/,
    ArbiterResultExternalConflict = 1 /*0x1*/,
    ArbiterResultNullRequest      = 2 /*0x2*/
}ARBITER_RESULT, *PARBITER_RESULT;

typedef enum _BUS_DATA_TYPE  // 14 elements, 0x4 bytes
{
    ConfigurationSpaceUndefined = -1 /*0xFF*/,
    Cmos                        = 0 /*0x0*/,
    EisaConfiguration           = 1 /*0x1*/,
    Pos                         = 2 /*0x2*/,
    CbusConfiguration           = 3 /*0x3*/,
    PCIConfiguration            = 4 /*0x4*/,
    VMEConfiguration            = 5 /*0x5*/,
    NuBusConfiguration          = 6 /*0x6*/,
    PCMCIAConfiguration         = 7 /*0x7*/,
    MPIConfiguration            = 8 /*0x8*/,
    MPSAConfiguration           = 9 /*0x9*/,
    PNPISAConfiguration         = 10 /*0xA*/,
    SgiInternalConfiguration    = 11 /*0xB*/,
    MaximumBusDataType          = 12 /*0xC*/
}BUS_DATA_TYPE, *PBUS_DATA_TYPE;

typedef enum _BUS_QUERY_ID_TYPE  // 5 elements, 0x4 bytes
{
    BusQueryDeviceID           = 0 /*0x0*/,
    BusQueryHardwareIDs        = 1 /*0x1*/,
    BusQueryCompatibleIDs      = 2 /*0x2*/,
    BusQueryInstanceID         = 3 /*0x3*/,
    BusQueryDeviceSerialNumber = 4 /*0x4*/
}BUS_QUERY_ID_TYPE, *PBUS_QUERY_ID_TYPE;

typedef enum _CPU_VENDORS  // 8 elements, 0x4 bytes
{
    CPU_NONE      = 0 /*0x0*/,
    CPU_INTEL     = 1 /*0x1*/,
    CPU_AMD       = 2 /*0x2*/,
    CPU_CYRIX     = 3 /*0x3*/,
    CPU_TRANSMETA = 4 /*0x4*/,
    CPU_CENTAUR   = 5 /*0x5*/,
    CPU_RISE      = 6 /*0x6*/,
    CPU_UNKNOWN   = 7 /*0x7*/
}CPU_VENDORS, *PCPU_VENDORS;

typedef enum _DEVICE_POWER_STATE  // 6 elements, 0x4 bytes
{
    PowerDeviceUnspecified = 0 /*0x0*/,
    PowerDeviceD0          = 1 /*0x1*/,
    PowerDeviceD1          = 2 /*0x2*/,
    PowerDeviceD2          = 3 /*0x3*/,
    PowerDeviceD3          = 4 /*0x4*/,
    PowerDeviceMaximum     = 5 /*0x5*/
}DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _DEVICE_RELATION_TYPE  // 6 elements, 0x4 bytes
{
    BusRelations         = 0 /*0x0*/,
    EjectionRelations    = 1 /*0x1*/,
    PowerRelations       = 2 /*0x2*/,
    RemovalRelations     = 3 /*0x3*/,
    TargetDeviceRelation = 4 /*0x4*/,
    SingleBusRelations   = 5 /*0x5*/
}DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef enum _DEVICE_TEXT_TYPE  // 2 elements, 0x4 bytes
{
    DeviceTextDescription         = 0 /*0x0*/,
    DeviceTextLocationInformation = 1 /*0x1*/
}DEVICE_TEXT_TYPE, *PDEVICE_TEXT_TYPE;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE  // 4 elements, 0x4 bytes
{
    DeviceUsageTypeUndefined   = 0 /*0x0*/,
    DeviceUsageTypePaging      = 1 /*0x1*/,
    DeviceUsageTypeHibernation = 2 /*0x2*/,
    DeviceUsageTypeDumpFile    = 3 /*0x3*/
}DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef enum _EXCEPTION_DISPOSITION  // 4 elements, 0x4 bytes
{
    ExceptionContinueExecution = 0 /*0x0*/,
    ExceptionContinueSearch    = 1 /*0x1*/,
    ExceptionNestedException   = 2 /*0x2*/,
    ExceptionCollidedUnwind    = 3 /*0x3*/
}EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef enum _FILE_INFORMATION_CLASS  // 41 elements, 0x4 bytes
{
    FileDirectoryInformation       = 1 /*0x1*/,
    FileFullDirectoryInformation   = 2 /*0x2*/,
    FileBothDirectoryInformation   = 3 /*0x3*/,
    FileBasicInformation           = 4 /*0x4*/,
    FileStandardInformation        = 5 /*0x5*/,
    FileInternalInformation        = 6 /*0x6*/,
    FileEaInformation              = 7 /*0x7*/,
    FileAccessInformation          = 8 /*0x8*/,
    FileNameInformation            = 9 /*0x9*/,
    FileRenameInformation          = 10 /*0xA*/,
    FileLinkInformation            = 11 /*0xB*/,
    FileNamesInformation           = 12 /*0xC*/,
    FileDispositionInformation     = 13 /*0xD*/,
    FilePositionInformation        = 14 /*0xE*/,
    FileFullEaInformation          = 15 /*0xF*/,
    FileModeInformation            = 16 /*0x10*/,
    FileAlignmentInformation       = 17 /*0x11*/,
    FileAllInformation             = 18 /*0x12*/,
    FileAllocationInformation      = 19 /*0x13*/,
    FileEndOfFileInformation       = 20 /*0x14*/,
    FileAlternateNameInformation   = 21 /*0x15*/,
    FileStreamInformation          = 22 /*0x16*/,
    FilePipeInformation            = 23 /*0x17*/,
    FilePipeLocalInformation       = 24 /*0x18*/,
    FilePipeRemoteInformation      = 25 /*0x19*/,
    FileMailslotQueryInformation   = 26 /*0x1A*/,
    FileMailslotSetInformation     = 27 /*0x1B*/,
    FileCompressionInformation     = 28 /*0x1C*/,
    FileObjectIdInformation        = 29 /*0x1D*/,
    FileCompletionInformation      = 30 /*0x1E*/,
    FileMoveClusterInformation     = 31 /*0x1F*/,
    FileQuotaInformation           = 32 /*0x20*/,
    FileReparsePointInformation    = 33 /*0x21*/,
    FileNetworkOpenInformation     = 34 /*0x22*/,
    FileAttributeTagInformation    = 35 /*0x23*/,
    FileTrackingInformation        = 36 /*0x24*/,
    FileIdBothDirectoryInformation = 37 /*0x25*/,
    FileIdFullDirectoryInformation = 38 /*0x26*/,
    FileValidDataLengthInformation = 39 /*0x27*/,
    FileShortNameInformation       = 40 /*0x28*/,
    FileMaximumInformation         = 41 /*0x29*/
}FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef enum _FS_FILTER_SECTION_SYNC_TYPE  // 2 elements, 0x4 bytes
{
    SyncTypeOther         = 0 /*0x0*/,
    SyncTypeCreateSection = 1 /*0x1*/
}FS_FILTER_SECTION_SYNC_TYPE, *PFS_FILTER_SECTION_SYNC_TYPE;

typedef enum _FSINFOCLASS  // 10 elements, 0x4 bytes
{
    FileFsVolumeInformation     = 1 /*0x1*/,
    FileFsLabelInformation      = 2 /*0x2*/,
    FileFsSizeInformation       = 3 /*0x3*/,
    FileFsDeviceInformation     = 4 /*0x4*/,
    FileFsAttributeInformation  = 5 /*0x5*/,
    FileFsControlInformation    = 6 /*0x6*/,
    FileFsFullSizeInformation   = 7 /*0x7*/,
    FileFsObjectIdInformation   = 8 /*0x8*/,
    FileFsDriverPathInformation = 9 /*0x9*/,
    FileFsMaximumInformation    = 10 /*0xA*/
}FSINFOCLASS, *PFSINFOCLASS;

typedef enum _INTERFACE_TYPE  // 18 elements, 0x4 bytes
{
    InterfaceTypeUndefined = -1 /*0xFF*/,
    Internal               = 0 /*0x0*/,
    Isa                    = 1 /*0x1*/,
    Eisa                   = 2 /*0x2*/,
    MicroChannel           = 3 /*0x3*/,
    TurboChannel           = 4 /*0x4*/,
    PCIBus                 = 5 /*0x5*/,
    VMEBus                 = 6 /*0x6*/,
    NuBus                  = 7 /*0x7*/,
    PCMCIABus              = 8 /*0x8*/,
    CBus                   = 9 /*0x9*/,
    MPIBus                 = 10 /*0xA*/,
    MPSABus                = 11 /*0xB*/,
    ProcessorInternal      = 12 /*0xC*/,
    InternalPowerBus       = 13 /*0xD*/,
    PNPISABus              = 14 /*0xE*/,
    PNPBus                 = 15 /*0xF*/,
    MaximumInterfaceType   = 16 /*0x10*/
}INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef enum _IO_ALLOCATION_ACTION  // 3 elements, 0x4 bytes
{
    KeepObject                    = 1 /*0x1*/,
    DeallocateObject              = 2 /*0x2*/,
    DeallocateObjectKeepRegisters = 3 /*0x3*/
}IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef enum _KINTERRUPT_MODE  // 2 elements, 0x4 bytes
{
    LevelSensitive = 0 /*0x0*/,
    Latched        = 1 /*0x1*/
}KINTERRUPT_MODE, *PKINTERRUPT_MODE;

typedef enum _KSPIN_LOCK_QUEUE_NUMBER  // 16 elements, 0x4 bytes
{
    LockQueueDispatcherLock   = 0 /*0x0*/,
    LockQueueContextSwapLock  = 1 /*0x1*/,
    LockQueuePfnLock          = 2 /*0x2*/,
    LockQueueSystemSpaceLock  = 3 /*0x3*/,
    LockQueueVacbLock         = 4 /*0x4*/,
    LockQueueMasterLock       = 5 /*0x5*/,
    LockQueueNonPagedPoolLock = 6 /*0x6*/,
    LockQueueIoCancelLock     = 7 /*0x7*/,
    LockQueueWorkQueueLock    = 8 /*0x8*/,
    LockQueueIoVpbLock        = 9 /*0x9*/,
    LockQueueIoDatabaseLock   = 10 /*0xA*/,
    LockQueueIoCompletionLock = 11 /*0xB*/,
    LockQueueNtfsStructLock   = 12 /*0xC*/,
    LockQueueAfdWorkQueueLock = 13 /*0xD*/,
    LockQueueBcbLock          = 14 /*0xE*/,
    LockQueueMaximumLock      = 15 /*0xF*/
}KSPIN_LOCK_QUEUE_NUMBER, *PKSPIN_LOCK_QUEUE_NUMBER;

typedef enum _KWAIT_REASON  // 28 elements, 0x4 bytes
{
    Executive         = 0 /*0x0*/,
    FreePage          = 1 /*0x1*/,
    PageIn            = 2 /*0x2*/,
    PoolAllocation    = 3 /*0x3*/,
    DelayExecution    = 4 /*0x4*/,
    Suspended         = 5 /*0x5*/,
    UserRequest       = 6 /*0x6*/,
    WrExecutive       = 7 /*0x7*/,
    WrFreePage        = 8 /*0x8*/,
    WrPageIn          = 9 /*0x9*/,
    WrPoolAllocation  = 10 /*0xA*/,
    WrDelayExecution  = 11 /*0xB*/,
    WrSuspended       = 12 /*0xC*/,
    WrUserRequest     = 13 /*0xD*/,
    WrEventPair       = 14 /*0xE*/,
    WrQueue           = 15 /*0xF*/,
    WrLpcReceive      = 16 /*0x10*/,
    WrLpcReply        = 17 /*0x11*/,
    WrVirtualMemory   = 18 /*0x12*/,
    WrPageOut         = 19 /*0x13*/,
    WrRendezvous      = 20 /*0x14*/,
    Spare2            = 21 /*0x15*/,
    Spare3            = 22 /*0x16*/,
    Spare4            = 23 /*0x17*/,
    Spare5            = 24 /*0x18*/,
    Spare6            = 25 /*0x19*/,
    WrKernel          = 26 /*0x1A*/,
    MaximumWaitReason = 27 /*0x1B*/
}KWAIT_REASON, *PKWAIT_REASON;

typedef enum _LSA_FOREST_TRUST_RECORD_TYPE  // 4 elements, 0x4 bytes
{
    ForestTrustTopLevelName   = 0 /*0x0*/,
    ForestTrustTopLevelNameEx = 1 /*0x1*/,
    ForestTrustDomainInfo     = 2 /*0x2*/,
    ForestTrustRecordTypeLast = 2 /*0x2*/
}LSA_FOREST_TRUST_RECORD_TYPE, *PLSA_FOREST_TRUST_RECORD_TYPE;

typedef enum _MEMORY_CACHING_TYPE  // 7 elements, 0x4 bytes
{
    MmNonCached              = 0 /*0x0*/,
    MmCached                 = 1 /*0x1*/,
    MmWriteCombined          = 2 /*0x2*/,
    MmHardwareCoherentCached = 3 /*0x3*/,
    MmNonCachedUnordered     = 4 /*0x4*/,
    MmUSWCCached             = 5 /*0x5*/,
    MmMaximumCacheType       = 6 /*0x6*/
}MEMORY_CACHING_TYPE, *PMEMORY_CACHING_TYPE;

typedef enum _MEMORY_CACHING_TYPE_ORIG  // 1 elements, 0x4 bytes
{
    MmFrameBufferCached = 2 /*0x2*/
}MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef enum _MEMORY_TYPE  // 10 elements, 0x4 bytes
{
    MemoryExceptionBlock    = 0 /*0x0*/,
    MemorySystemBlock       = 1 /*0x1*/,
    MemoryFree              = 2 /*0x2*/,
    MemoryBad               = 3 /*0x3*/,
    MemoryLoadedProgram     = 4 /*0x4*/,
    MemoryFirmwareTemporary = 5 /*0x5*/,
    MemoryFirmwarePermanent = 6 /*0x6*/,
    MemoryFreeContiguous    = 7 /*0x7*/,
    MemorySpecialMemory     = 8 /*0x8*/,
    MemoryMaximum           = 9 /*0x9*/
}MEMORY_TYPE, *PMEMORY_TYPE;

typedef enum _MI_PFN_CACHE_ATTRIBUTE  // 4 elements, 0x4 bytes
{
    MiNonCached     = 0 /*0x0*/,
    MiCached        = 1 /*0x1*/,
    MiWriteCombined = 2 /*0x2*/,
    MiNotMapped     = 3 /*0x3*/
}MI_PFN_CACHE_ATTRIBUTE, *PMI_PFN_CACHE_ATTRIBUTE;

typedef enum _MMLISTS  // 8 elements, 0x4 bytes
{
    ZeroedPageList          = 0 /*0x0*/,
    FreePageList            = 1 /*0x1*/,
    StandbyPageList         = 2 /*0x2*/,
    ModifiedPageList        = 3 /*0x3*/,
    ModifiedNoWritePageList = 4 /*0x4*/,
    BadPageList             = 5 /*0x5*/,
    ActiveAndValid          = 6 /*0x6*/,
    TransitionPage          = 7 /*0x7*/
}MMLISTS, *PMMLISTS;

typedef enum _MMSYSTEM_PTE_POOL_TYPE  // 3 elements, 0x4 bytes
{
    SystemPteSpace        = 0 /*0x0*/,
    NonPagedPoolExpansion = 1 /*0x1*/,
    MaximumPtePoolTypes   = 2 /*0x2*/
}MMSYSTEM_PTE_POOL_TYPE, *PMMSYSTEM_PTE_POOL_TYPE;

typedef enum _MODE  // 3 elements, 0x4 bytes
{
    KernelMode  = 0 /*0x0*/,
    UserMode    = 1 /*0x1*/,
    MaximumMode = 2 /*0x2*/
}MODE, *PMODE;

typedef enum _NT_PRODUCT_TYPE  // 3 elements, 0x4 bytes
{
    NtProductWinNt    = 1 /*0x1*/,
    NtProductLanManNt = 2 /*0x2*/,
    NtProductServer   = 3 /*0x3*/
}NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef enum _OB_OPEN_REASON  // 5 elements, 0x4 bytes
{
    ObCreateHandle    = 0 /*0x0*/,
    ObOpenHandle      = 1 /*0x1*/,
    ObDuplicateHandle = 2 /*0x2*/,
    ObInheritHandle   = 3 /*0x3*/,
    ObMaxOpenReason   = 4 /*0x4*/
}OB_OPEN_REASON, *POB_OPEN_REASON;

typedef enum _PCI_DISPATCH_STYLE  // 4 elements, 0x4 bytes
{
    IRP_COMPLETE = 0 /*0x0*/,
    IRP_DOWNWARD = 1 /*0x1*/,
    IRP_UPWARD   = 2 /*0x2*/,
    IRP_DISPATCH = 3 /*0x3*/
}PCI_DISPATCH_STYLE, *PPCI_DISPATCH_STYLE;

typedef enum _PCI_SIGNATURE  // 15 elements, 0x4 bytes
{
    PciPdoExtensionType                = 1768116272 /*0x69635030*/  /*0Pci*/,
    PciFdoExtensionType                = 1768116273 /*0x69635031*/  /*1Pci*/,
    PciArb_Io                          = 1768116274 /*0x69635032*/  /*2Pci*/,
    PciArb_Memory                      = 1768116275 /*0x69635033*/  /*3Pci*/,
    PciArb_Interrupt                   = 1768116276 /*0x69635034*/  /*4Pci*/,
    PciArb_BusNumber                   = 1768116277 /*0x69635035*/  /*5Pci*/,
    PciTrans_Interrupt                 = 1768116278 /*0x69635036*/  /*6Pci*/,
    PciInterface_BusHandler            = 1768116279 /*0x69635037*/  /*7Pci*/,
    PciInterface_IntRouteHandler       = 1768116280 /*0x69635038*/  /*8Pci*/,
    PciInterface_PciCb                 = 1768116281 /*0x69635039*/  /*9Pci*/,
    PciInterface_LegacyDeviceDetection = 1768116282 /*0x6963503A*/,
    PciInterface_PmeHandler            = 1768116283 /*0x6963503B*/,
    PciInterface_DevicePresent         = 1768116284 /*0x6963503C*/,
    PciInterface_NativeIde             = 1768116285 /*0x6963503D*/,
    PciInterface_AgpTarget             = 1768116286 /*0x6963503E*/
}PCI_SIGNATURE, *PPCI_SIGNATURE;

typedef enum _PF_SCENARIO_TYPE  // 3 elements, 0x4 bytes
{
    PfApplicationLaunchScenarioType = 0 /*0x0*/,
    PfSystemBootScenarioType        = 1 /*0x1*/,
    PfMaxScenarioType               = 2 /*0x2*/
}PF_SCENARIO_TYPE, *PPF_SCENARIO_TYPE;

typedef enum _PLUGPLAY_EVENT_CATEGORY  // 10 elements, 0x4 bytes
{
    HardwareProfileChangeEvent = 0 /*0x0*/,
    TargetDeviceChangeEvent    = 1 /*0x1*/,
    DeviceClassChangeEvent     = 2 /*0x2*/,
    CustomDeviceEvent          = 3 /*0x3*/,
    DeviceInstallEvent         = 4 /*0x4*/,
    DeviceArrivalEvent         = 5 /*0x5*/,
    PowerEvent                 = 6 /*0x6*/,
    VetoEvent                  = 7 /*0x7*/,
    BlockedDriverEvent         = 8 /*0x8*/,
    MaxPlugEventCategory       = 9 /*0x9*/
}PLUGPLAY_EVENT_CATEGORY, *PPLUGPLAY_EVENT_CATEGORY;

typedef enum _PNP_DEVNODE_STATE  // 21 elements, 0x4 bytes
{
    DeviceNodeUnspecified            = 768 /*0x300*/,
    DeviceNodeUninitialized          = 769 /*0x301*/,
    DeviceNodeInitialized            = 770 /*0x302*/,
    DeviceNodeDriversAdded           = 771 /*0x303*/,
    DeviceNodeResourcesAssigned      = 772 /*0x304*/,
    DeviceNodeStartPending           = 773 /*0x305*/,
    DeviceNodeStartCompletion        = 774 /*0x306*/,
    DeviceNodeStartPostWork          = 775 /*0x307*/,
    DeviceNodeStarted                = 776 /*0x308*/,
    DeviceNodeQueryStopped           = 777 /*0x309*/,
    DeviceNodeStopped                = 778 /*0x30A*/,
    DeviceNodeRestartCompletion      = 779 /*0x30B*/,
    DeviceNodeEnumeratePending       = 780 /*0x30C*/,
    DeviceNodeEnumerateCompletion    = 781 /*0x30D*/,
    DeviceNodeAwaitingQueuedDeletion = 782 /*0x30E*/,
    DeviceNodeAwaitingQueuedRemoval  = 783 /*0x30F*/,
    DeviceNodeQueryRemoved           = 784 /*0x310*/,
    DeviceNodeRemovePendingCloses    = 785 /*0x311*/,
    DeviceNodeRemoved                = 786 /*0x312*/,
    DeviceNodeDeletePendingCloses    = 787 /*0x313*/,
    DeviceNodeDeleted                = 788 /*0x314*/
}PNP_DEVNODE_STATE, *PPNP_DEVNODE_STATE;

typedef enum _PNP_VETO_TYPE  // 13 elements, 0x4 bytes
{
    PNP_VetoTypeUnknown          = 0 /*0x0*/,
    PNP_VetoLegacyDevice         = 1 /*0x1*/,
    PNP_VetoPendingClose         = 2 /*0x2*/,
    PNP_VetoWindowsApp           = 3 /*0x3*/,
    PNP_VetoWindowsService       = 4 /*0x4*/,
    PNP_VetoOutstandingOpen      = 5 /*0x5*/,
    PNP_VetoDevice               = 6 /*0x6*/,
    PNP_VetoDriver               = 7 /*0x7*/,
    PNP_VetoIllegalDeviceRequest = 8 /*0x8*/,
    PNP_VetoInsufficientPower    = 9 /*0x9*/,
    PNP_VetoNonDisableable       = 10 /*0xA*/,
    PNP_VetoLegacyDriver         = 11 /*0xB*/,
    PNP_VetoInsufficientRights   = 12 /*0xC*/
}PNP_VETO_TYPE, *PPNP_VETO_TYPE;

typedef enum _POLICY_AUDIT_EVENT_TYPE  // 9 elements, 0x4 bytes
{
    AuditCategorySystem                 = 0 /*0x0*/,
    AuditCategoryLogon                  = 1 /*0x1*/,
    AuditCategoryObjectAccess           = 2 /*0x2*/,
    AuditCategoryPrivilegeUse           = 3 /*0x3*/,
    AuditCategoryDetailedTracking       = 4 /*0x4*/,
    AuditCategoryPolicyChange           = 5 /*0x5*/,
    AuditCategoryAccountManagement      = 6 /*0x6*/,
    AuditCategoryDirectoryServiceAccess = 7 /*0x7*/,
    AuditCategoryAccountLogon           = 8 /*0x8*/
}POLICY_AUDIT_EVENT_TYPE, *PPOLICY_AUDIT_EVENT_TYPE;

typedef enum _POOL_TYPE  // 15 elements, 0x4 bytes
{
    NonPagedPool                         = 0 /*0x0*/,
    PagedPool                            = 1 /*0x1*/,
    NonPagedPoolMustSucceed              = 2 /*0x2*/,
    DontUseThisType                      = 3 /*0x3*/,
    NonPagedPoolCacheAligned             = 4 /*0x4*/,
    PagedPoolCacheAligned                = 5 /*0x5*/,
    NonPagedPoolCacheAlignedMustS        = 6 /*0x6*/,
    MaxPoolType                          = 7 /*0x7*/,
    NonPagedPoolSession                  = 32 /*0x20*/,
    PagedPoolSession                     = 33 /*0x21*/,
    NonPagedPoolMustSucceedSession       = 34 /*0x22*/,
    DontUseThisTypeSession               = 35 /*0x23*/,
    NonPagedPoolCacheAlignedSession      = 36 /*0x24*/,
    PagedPoolCacheAlignedSession         = 37 /*0x25*/,
    NonPagedPoolCacheAlignedMustSSession = 38 /*0x26*/
}POOL_TYPE, *PPOOL_TYPE;

typedef enum _POP_POLICY_DEVICE_TYPE  // 7 elements, 0x4 bytes
{
    PolicyDeviceSystemButton     = 0 /*0x0*/,
    PolicyDeviceThermalZone      = 1 /*0x1*/,
    PolicyDeviceBattery          = 2 /*0x2*/,
    PolicyInitiatePowerActionAPI = 3 /*0x3*/,
    PolicySetPowerStateAPI       = 4 /*0x4*/,
    PolicyImmediateDozeS4        = 5 /*0x5*/,
    PolicySystemIdle             = 6 /*0x6*/
}POP_POLICY_DEVICE_TYPE, *PPOP_POLICY_DEVICE_TYPE;

typedef enum _POWER_ACTION  // 8 elements, 0x4 bytes
{
    PowerActionNone          = 0 /*0x0*/,
    PowerActionReserved      = 1 /*0x1*/,
    PowerActionSleep         = 2 /*0x2*/,
    PowerActionHibernate     = 3 /*0x3*/,
    PowerActionShutdown      = 4 /*0x4*/,
    PowerActionShutdownReset = 5 /*0x5*/,
    PowerActionShutdownOff   = 6 /*0x6*/,
    PowerActionWarmEject     = 7 /*0x7*/
}POWER_ACTION, *PPOWER_ACTION;

typedef enum _POWER_STATE_TYPE  // 2 elements, 0x4 bytes
{
    SystemPowerState = 0 /*0x0*/,
    DevicePowerState = 1 /*0x1*/
}POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

typedef enum _PP_NPAGED_LOOKASIDE_NUMBER  // 8 elements, 0x4 bytes
{
    LookasideSmallIrpList   = 0 /*0x0*/,
    LookasideLargeIrpList   = 1 /*0x1*/,
    LookasideMdlList        = 2 /*0x2*/,
    LookasideCreateInfoList = 3 /*0x3*/,
    LookasideNameBufferList = 4 /*0x4*/,
    LookasideTwilightList   = 5 /*0x5*/,
    LookasideCompletionList = 6 /*0x6*/,
    LookasideMaximumList    = 7 /*0x7*/
}PP_NPAGED_LOOKASIDE_NUMBER, *PPP_NPAGED_LOOKASIDE_NUMBER;

typedef enum _PROFILE_STATUS  // 5 elements, 0x4 bytes
{
    DOCK_NOTDOCKDEVICE      = 0 /*0x0*/,
    DOCK_QUIESCENT          = 1 /*0x1*/,
    DOCK_ARRIVING           = 2 /*0x2*/,
    DOCK_DEPARTING          = 3 /*0x3*/,
    DOCK_EJECTIRP_COMPLETED = 4 /*0x4*/
}PROFILE_STATUS, *PPROFILE_STATUS;

typedef enum _PROXY_CLASS  // 4 elements, 0x4 bytes
{
    ProxyFull      = 0 /*0x0*/,
    ProxyService   = 1 /*0x1*/,
    ProxyTree      = 2 /*0x2*/,
    ProxyDirectory = 3 /*0x3*/
}PROXY_CLASS, *PPROXY_CLASS;

typedef enum _PS_QUOTA_TYPE  // 4 elements, 0x4 bytes
{
    PsNonPagedPool = 0 /*0x0*/,
    PsPagedPool    = 1 /*0x1*/,
    PsPageFile     = 2 /*0x2*/,
    PsQuotaTypes   = 3 /*0x3*/
}PS_QUOTA_TYPE, *PPS_QUOTA_TYPE;

typedef enum _ReplacesCorHdrNumericDefines  // 22 elements, 0x4 bytes
{
    COMIMAGE_FLAGS_ILONLY                = 1 /*0x1*/,
    COMIMAGE_FLAGS_32BITREQUIRED         = 2 /*0x2*/,
    COMIMAGE_FLAGS_IL_LIBRARY            = 4 /*0x4*/,
    COMIMAGE_FLAGS_STRONGNAMESIGNED      = 8 /*0x8*/,
    COMIMAGE_FLAGS_TRACKDEBUGDATA        = 65536 /*0x10000*/,
    COR_VERSION_MAJOR_V2                 = 2 /*0x2*/,
    COR_VERSION_MAJOR                    = 2 /*0x2*/,
    COR_VERSION_MINOR                    = 0 /*0x0*/,
    COR_DELETED_NAME_LENGTH              = 8 /*0x8*/,
    COR_VTABLEGAP_NAME_LENGTH            = 8 /*0x8*/,
    NATIVE_TYPE_MAX_CB                   = 1 /*0x1*/,
    COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255 /*0xFF*/,
    IMAGE_COR_MIH_METHODRVA              = 1 /*0x1*/,
    IMAGE_COR_MIH_EHRVA                  = 2 /*0x2*/,
    IMAGE_COR_MIH_BASICBLOCK             = 8 /*0x8*/,
    COR_VTABLE_32BIT                     = 1 /*0x1*/,
    COR_VTABLE_64BIT                     = 2 /*0x2*/,
    COR_VTABLE_FROM_UNMANAGED            = 4 /*0x4*/,
    COR_VTABLE_CALL_MOST_DERIVED         = 16 /*0x10*/,
    IMAGE_COR_EATJ_THUNK_SIZE            = 32 /*0x20*/,
    MAX_CLASS_NAME                       = 1024 /*0x400*/,
    MAX_PACKAGE_NAME                     = 1024 /*0x400*/
}ReplacesCorHdrNumericDefines, *PReplacesCorHdrNumericDefines;

typedef enum _SECURITY_IMPERSONATION_LEVEL  // 4 elements, 0x4 bytes
{
    SecurityAnonymous      = 0 /*0x0*/,
    SecurityIdentification = 1 /*0x1*/,
    SecurityImpersonation  = 2 /*0x2*/,
    SecurityDelegation     = 3 /*0x3*/
}SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum _SECURITY_OPERATION_CODE  // 4 elements, 0x4 bytes
{
    SetSecurityDescriptor    = 0 /*0x0*/,
    QuerySecurityDescriptor  = 1 /*0x1*/,
    DeleteSecurityDescriptor = 2 /*0x2*/,
    AssignSecurityDescriptor = 3 /*0x3*/
}SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef enum _SYSTEM_POWER_STATE  // 8 elements, 0x4 bytes
{
    PowerSystemUnspecified = 0 /*0x0*/,
    PowerSystemWorking     = 1 /*0x1*/,
    PowerSystemSleeping1   = 2 /*0x2*/,
    PowerSystemSleeping2   = 3 /*0x3*/,
    PowerSystemSleeping3   = 4 /*0x4*/,
    PowerSystemHibernate   = 5 /*0x5*/,
    PowerSystemShutdown    = 6 /*0x6*/,
    PowerSystemMaximum     = 7 /*0x7*/
}SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef enum _TOKEN_TYPE  // 2 elements, 0x4 bytes
{
    TokenPrimary       = 1 /*0x1*/,
    TokenImpersonation = 2 /*0x2*/
}TOKEN_TYPE, *PTOKEN_TYPE;

typedef enum _VI_DEADLOCK_RESOURCE_TYPE  // 7 elements, 0x4 bytes
{
    VfDeadlockUnknown         = 0 /*0x0*/,
    VfDeadlockMutex           = 1 /*0x1*/,
    VfDeadlockFastMutex       = 2 /*0x2*/,
    VfDeadlockFastMutexUnsafe = 3 /*0x3*/,
    VfDeadlockSpinLock        = 4 /*0x4*/,
    VfDeadlockQueuedSpinLock  = 5 /*0x5*/,
    VfDeadlockTypeMaximum     = 6 /*0x6*/
}VI_DEADLOCK_RESOURCE_TYPE, *PVI_DEADLOCK_RESOURCE_TYPE;

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Information about structure types

typedef struct _ACCESS_STATE;
typedef struct _ACL;
typedef struct _ACTIVATION_CONTEXT_STACK;
typedef struct _ADAPTER_OBJECT;
typedef struct _AMD64_DBGKD_CONTROL_SET;
typedef struct _ARBITER_ALLOCATION_STATE;
typedef struct _ARBITER_ALTERNATIVE;
typedef struct _ARBITER_CONFLICT_INFO;
typedef struct _ARBITER_INSTANCE;
typedef struct _ARBITER_INTERFACE;
typedef struct _ARBITER_LIST_ENTRY;
typedef struct _ARBITER_ORDERING;
typedef struct _ARBITER_ORDERING_LIST;
typedef struct _ARBITER_PARAMETERS;
typedef struct _BATTERY_REPORTING_SCALE;
typedef struct _BITMAP_RANGE;
typedef struct _BUS_EXTENSION_LIST;
typedef struct _BUS_HANDLER;
typedef struct _CACHE_MANAGER_CALLBACKS;
typedef struct _CACHE_UNINITIALIZE_EVENT;
typedef struct _CACHED_CHILD_LIST;
typedef struct _CALL_HASH_ENTRY;
typedef struct _CALL_PERFORMANCE_DATA;
typedef struct _CELL_DATA;
typedef struct _CHILD_LIST;
typedef struct _CLIENT_ID;
typedef struct _CM_BIG_DATA;
typedef struct _CM_CACHED_VALUE_INDEX;
typedef struct _CM_CELL_REMAP_BLOCK;
typedef struct _CM_FULL_RESOURCE_DESCRIPTOR;
typedef struct _CM_INDEX_HINT_BLOCK;
typedef struct _CM_KEY_BODY;
typedef struct _CM_KEY_CONTROL_BLOCK;
typedef struct _CM_KEY_HASH;
typedef struct _CM_KEY_INDEX;
typedef struct _CM_KEY_NODE;
typedef struct _CM_KEY_REFERENCE;
typedef struct _CM_KEY_SECURITY;
typedef struct _CM_KEY_SECURITY_CACHE;
typedef struct _CM_KEY_SECURITY_CACHE_ENTRY;
typedef struct _CM_KEY_VALUE;
typedef struct _CM_NAME_CONTROL_BLOCK;
typedef struct _CM_NAME_HASH;
typedef struct _CM_NOTIFY_BLOCK;
typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR;
typedef struct _CM_PARTIAL_RESOURCE_LIST;
typedef struct _CM_RESOURCE_LIST;
typedef struct _CM_VIEW_OF_FILE;
typedef struct _CMHIVE;
typedef struct _CMP_OFFSET_ARRAY;
typedef struct _COMPRESSED_DATA_INFO;
typedef struct _CONTEXT;
typedef struct _CONTROL_AREA;
typedef struct _CURDIR;
typedef struct _DBGKD_ANY_CONTROL_SET;
typedef struct _DBGKD_BREAKPOINTEX;
typedef struct _DBGKD_CONTINUE;
typedef struct _DBGKD_CONTINUE2;
typedef struct _DBGKD_FILL_MEMORY;
typedef struct _DBGKD_GET_CONTEXT;
typedef struct _DBGKD_GET_INTERNAL_BREAKPOINT32;
typedef struct _DBGKD_GET_INTERNAL_BREAKPOINT64;
typedef struct _DBGKD_GET_SET_BUS_DATA;
typedef struct _DBGKD_GET_VERSION32;
typedef struct _DBGKD_GET_VERSION64;
typedef struct _DBGKD_LOAD_SYMBOLS32;
typedef struct _DBGKD_LOAD_SYMBOLS64;
typedef struct _DBGKD_MANIPULATE_STATE32;
typedef struct _DBGKD_MANIPULATE_STATE64;
typedef struct _DBGKD_QUERY_MEMORY;
typedef struct _DBGKD_QUERY_SPECIAL_CALLS;
typedef struct _DBGKD_READ_MEMORY32;
typedef struct _DBGKD_READ_MEMORY64;
typedef struct _DBGKD_READ_WRITE_IO_EXTENDED32;
typedef struct _DBGKD_READ_WRITE_IO_EXTENDED64;
typedef struct _DBGKD_READ_WRITE_IO32;
typedef struct _DBGKD_READ_WRITE_IO64;
typedef struct _DBGKD_READ_WRITE_MSR;
typedef struct _DBGKD_RESTORE_BREAKPOINT;
typedef struct _DBGKD_SEARCH_MEMORY;
typedef struct _DBGKD_SET_CONTEXT;
typedef struct _DBGKD_SET_INTERNAL_BREAKPOINT32;
typedef struct _DBGKD_SET_INTERNAL_BREAKPOINT64;
typedef struct _DBGKD_SET_SPECIAL_CALL32;
typedef struct _DBGKD_SET_SPECIAL_CALL64;
typedef struct _DBGKD_WRITE_BREAKPOINT32;
typedef struct _DBGKD_WRITE_BREAKPOINT64;
typedef struct _DBGKD_WRITE_MEMORY32;
typedef struct _DBGKD_WRITE_MEMORY64;
typedef struct _DBGKM_EXCEPTION32;
typedef struct _DBGKM_EXCEPTION64;
typedef struct _DEFERRED_WRITE;
typedef struct _DESCRIPTOR;
typedef struct _DEVICE_CAPABILITIES;
typedef struct _DEVICE_MAP;
typedef struct _DEVICE_NODE;
typedef struct _DEVICE_OBJECT;
typedef struct _DEVICE_OBJECT_POWER_EXTENSION;
typedef struct _DEVICE_RELATIONS;
typedef struct _DEVOBJ_EXTENSION;
typedef struct _DISPATCHER_HEADER;
typedef struct _DRIVER_EXTENSION;
typedef struct _DRIVER_OBJECT;
typedef struct _DUAL;
typedef struct _DUMP_INITIALIZATION_CONTEXT;
typedef struct _DUMP_STACK_CONTEXT;
typedef struct _EJOB;
typedef struct _EPROCESS;
typedef struct _EPROCESS_QUOTA_BLOCK;
typedef struct _EPROCESS_QUOTA_ENTRY;
typedef struct _ERESOURCE;
typedef struct _ETHREAD;
typedef struct _ETIMER;
typedef struct _EVENT_COUNTER;
typedef struct _EX_FAST_REF;
typedef struct _EX_PUSH_LOCK;
typedef struct _EX_PUSH_LOCK_CACHE_AWARE;
typedef struct _EX_PUSH_LOCK_WAIT_BLOCK;
typedef union _EX_QUEUE_WORKER_INFO;
typedef struct _EX_RUNDOWN_REF;
typedef struct _EX_WORK_QUEUE;
typedef struct _EXCEPTION_POINTERS;
typedef struct _EXCEPTION_RECORD;
typedef struct _EXCEPTION_RECORD32;
typedef struct _EXCEPTION_RECORD64;
typedef struct _EXCEPTION_REGISTRATION_RECORD;
typedef struct _FAST_IO_DISPATCH;
typedef struct _FAST_MUTEX;
typedef struct _FILE_BASIC_INFORMATION;
typedef struct _FILE_GET_QUOTA_INFORMATION;
typedef struct _FILE_NETWORK_OPEN_INFORMATION;
typedef struct _FILE_OBJECT;
typedef struct _FILE_STANDARD_INFORMATION;
typedef struct _flags;
typedef struct _FLOATING_SAVE_AREA;
typedef struct _FNSAVE_FORMAT;
typedef struct _FS_FILTER_CALLBACK_DATA;
typedef struct _FS_FILTER_CALLBACKS;
typedef union _FS_FILTER_PARAMETERS;
typedef struct _FX_SAVE_AREA;
typedef struct _FXSAVE_FORMAT;
typedef struct _GDI_TEB_BATCH;
typedef struct _GENERAL_LOOKASIDE;
typedef struct _GENERIC_MAPPING;
typedef struct _GUID;
typedef struct _HANDLE_TABLE;
typedef struct _HANDLE_TABLE_ENTRY;
typedef struct _HANDLE_TABLE_ENTRY_INFO;
typedef struct _HANDLE_TRACE_DB_ENTRY;
typedef struct _HANDLE_TRACE_DEBUG_INFO;
typedef struct _HARDWARE_PTE;
typedef struct _HBASE_BLOCK;
typedef struct _HEAP;
typedef struct _HEAP_ENTRY;
typedef struct _HEAP_ENTRY_EXTRA;
typedef struct _HEAP_FREE_ENTRY;
typedef struct _HEAP_FREE_ENTRY_EXTRA;
typedef struct _HEAP_LOCK;
typedef struct _HEAP_LOOKASIDE;
typedef struct _HEAP_PSEUDO_TAG_ENTRY;
typedef struct _HEAP_SEGMENT;
typedef struct _HEAP_STOP_ON_TAG;
typedef struct _HEAP_STOP_ON_VALUES;
typedef struct _HEAP_SUBSEGMENT;
typedef struct _HEAP_TAG_ENTRY;
typedef struct _HEAP_UCR_SEGMENT;
typedef struct _HEAP_UNCOMMMTTED_RANGE;
typedef struct _HEAP_USERDATA_HEADER;
typedef struct _HEAP_VIRTUAL_ALLOC_ENTRY;
typedef struct _HHIVE;
typedef struct _HIVE_LIST_ENTRY;
typedef struct _HMAP_DIRECTORY;
typedef struct _HMAP_ENTRY;
typedef struct _HMAP_TABLE;
typedef struct _IA64_DBGKD_CONTROL_SET;
typedef struct _IMAGE_DATA_DIRECTORY;
typedef struct _IMAGE_DEBUG_DIRECTORY;
typedef struct _IMAGE_DOS_HEADER;
typedef struct _IMAGE_FILE_HEADER;
typedef struct _IMAGE_NT_HEADERS;
typedef struct _IMAGE_OPTIONAL_HEADER;
typedef struct _IMAGE_ROM_OPTIONAL_HEADER;
typedef struct _IMAGE_SECTION_HEADER;
typedef struct _INITIAL_PRIVILEGE_SET;
typedef struct _INTERFACE;
typedef struct _INTERLOCK_SEQ;
typedef struct _IO_CLIENT_EXTENSION;
typedef struct _IO_COMPLETION_CONTEXT;
typedef struct _IO_COUNTERS;
typedef struct _IO_RESOURCE_DESCRIPTOR;
typedef struct _IO_RESOURCE_LIST;
typedef struct _IO_RESOURCE_REQUIREMENTS_LIST;
typedef struct _IO_SECURITY_CONTEXT;
typedef struct _IO_STACK_LOCATION;
typedef struct _IO_STATUS_BLOCK;
typedef struct _IO_TIMER;
typedef struct _IRP;
typedef struct _KAPC;
typedef struct _KAPC_STATE;
typedef struct _KDEVICE_QUEUE;
typedef struct _KDEVICE_QUEUE_ENTRY;
typedef struct _KDPC;
typedef struct _KEVENT;
typedef struct _KEXECUTE_OPTIONS;
typedef struct _KGDTENTRY;
typedef struct _KIDTENTRY;
typedef struct _KiIoAccessMap;
typedef struct _KINTERRUPT;
typedef struct _KLOCK_QUEUE_HANDLE;
typedef struct _KMUTANT;
typedef struct _KNODE;
typedef struct _KPCR;
typedef struct _KPRCB;
typedef struct _KPROCESS;
typedef struct _KPROCESSOR_STATE;
typedef struct _KQUEUE;
typedef struct _KSEMAPHORE;
typedef struct _KSPECIAL_REGISTERS;
typedef struct _KSPIN_LOCK_QUEUE;
typedef struct _KSYSTEM_TIME;
typedef struct _KTHREAD;
typedef struct _KTIMER;
typedef struct _KTRAP_FRAME;
typedef struct _KTSS;
typedef struct _KUSER_SHARED_DATA;
typedef struct _KWAIT_BLOCK;
typedef struct _LARGE_CONTROL_AREA;
typedef union _LARGE_INTEGER;
typedef struct _LDR_DATA_TABLE_ENTRY;
typedef struct _LIST_ENTRY;
typedef struct _LIST_ENTRY32;
typedef struct _LIST_ENTRY64;
typedef struct _LPCP_MESSAGE;
typedef struct _LPCP_NONPAGED_PORT_QUEUE;
typedef struct _LPCP_PORT_OBJECT;
typedef struct _LPCP_PORT_QUEUE;
typedef struct _LUID;
typedef struct _LUID_AND_ATTRIBUTES;
typedef struct _MAILSLOT_CREATE_PARAMETERS;
typedef struct _MBCB;
typedef struct _MDL;
typedef struct _MI_VERIFIER_DRIVER_ENTRY;
typedef struct _MI_VERIFIER_POOL_HEADER;
typedef struct _MM_DRIVER_VERIFIER_DATA;
typedef struct _MM_PAGED_POOL_INFO;
typedef struct _MM_SESSION_SPACE;
typedef struct _MM_SESSION_SPACE_FLAGS;
typedef struct _MMADDRESS_LIST;
typedef struct _MMBANKED_SECTION;
typedef struct _MMCOLOR_TABLES;
typedef struct _MMEXTEND_INFO;
typedef struct _MMFREE_POOL_ENTRY;
typedef struct _MMMOD_WRITER_LISTHEAD;
typedef struct _MMMOD_WRITER_MDL_ENTRY;
typedef struct _MMPAGING_FILE;
typedef struct _MMPFN;
typedef struct _MMPFNENTRY;
typedef struct _MMPFNLIST;
typedef struct _MMPTE;
typedef struct _MMPTE_HARDWARE;
typedef struct _MMPTE_HIGHLOW;
typedef struct _MMPTE_LIST;
typedef struct _MMPTE_PROTOTYPE;
typedef struct _MMPTE_SOFTWARE;
typedef struct _MMPTE_SUBSECTION;
typedef struct _MMPTE_TRANSITION;
typedef struct _MMSECTION_FLAGS;
typedef struct _MMSESSION;
typedef struct _MMSUBSECTION_FLAGS;
typedef struct _MMSUPPORT;
typedef struct _MMSUPPORT_FLAGS;
typedef struct _MMVAD;
typedef struct _MMVAD_FLAGS;
typedef struct _MMVAD_FLAGS2;
typedef struct _MMVAD_LONG;
typedef struct _MMVAD_SHORT;
typedef struct _MMVIEW;
typedef struct _MMWSL;
typedef struct _MMWSLE;
typedef struct _MMWSLE_HASH;
typedef struct _MMWSLENTRY;
typedef struct _NAMED_PIPE_CREATE_PARAMETERS;
typedef struct _NPAGED_LOOKASIDE_LIST;
typedef struct _NT_TIB;
typedef struct _OBJECT_ATTRIBUTES;
typedef struct _OBJECT_CREATE_INFORMATION;
typedef struct _OBJECT_DIRECTORY;
typedef struct _OBJECT_DIRECTORY_ENTRY;
typedef struct _OBJECT_DUMP_CONTROL;
typedef struct _OBJECT_HANDLE_INFORMATION;
typedef struct _OBJECT_HEADER;
typedef struct _OBJECT_HEADER_CREATOR_INFO;
typedef struct _OBJECT_HEADER_NAME_INFO;
typedef struct _OBJECT_NAME_INFORMATION;
typedef struct _OBJECT_SYMBOLIC_LINK;
typedef struct _OBJECT_TYPE;
typedef struct _OBJECT_TYPE_INITIALIZER;
typedef struct _OWNER_ENTRY;
typedef struct _PAGED_LOOKASIDE_LIST;
typedef struct _PAGEFAULT_HISTORY;
typedef struct _PCI_ARBITER_INSTANCE;
typedef struct _PCI_BUS_INTERFACE_STANDARD;
typedef struct _PCI_COMMON_CONFIG;
typedef struct _PCI_COMMON_EXTENSION;
typedef struct _PCI_FDO_EXTENSION;
typedef struct _PCI_FUNCTION_RESOURCES;
typedef struct _PCI_HEADER_TYPE_0;
typedef struct _PCI_HEADER_TYPE_1;
typedef struct _PCI_HEADER_TYPE_2;
typedef union _PCI_HEADER_TYPE_DEPENDENT;
typedef struct _PCI_INTERFACE;
typedef struct _PCI_LOCK;
typedef struct _PCI_MJ_DISPATCH_TABLE;
typedef struct _PCI_MN_DISPATCH_TABLE;
typedef struct _PCI_PDO_EXTENSION;
typedef struct _PCI_PMC;
typedef struct _PCI_POWER_STATE;
typedef struct _PCI_SECONDARY_EXTENSION;
typedef struct _PCI_SLOT_NUMBER;
typedef struct _PEB;
typedef struct _PEB_FREE_BLOCK;
typedef struct _PEB_LDR_DATA;
typedef struct _PHYSICAL_MEMORY_DESCRIPTOR;
typedef struct _PHYSICAL_MEMORY_RUN;
typedef struct _PI_BUS_EXTENSION;
typedef struct _PI_RESOURCE_ARBITER_ENTRY;
typedef struct _PLUGPLAY_EVENT_BLOCK;
typedef struct _PM_SUPPORT;
typedef struct _PNP_DEVICE_EVENT_ENTRY;
typedef struct _PNP_DEVICE_EVENT_LIST;
typedef struct _PO_DEVICE_NOTIFY;
typedef struct _PO_DEVICE_NOTIFY_ORDER;
typedef struct _PO_HIBER_PERF;
typedef struct _PO_MEMORY_IMAGE;
typedef struct _PO_MEMORY_RANGE_ARRAY;
typedef struct _PO_NOTIFY_ORDER_LEVEL;
typedef struct _POOL_BLOCK_HEAD;
typedef struct _POOL_DESCRIPTOR;
typedef struct _POOL_HACKER;
typedef struct _POOL_HEADER;
typedef struct _POOL_TRACKER_BIG_PAGES;
typedef struct _POOL_TRACKER_TABLE;
typedef struct _POP_ACTION_TRIGGER;
typedef struct _POP_DEVICE_POWER_IRP;
typedef struct _POP_DEVICE_SYS_STATE;
typedef struct _POP_HIBER_CONTEXT;
typedef struct _POP_IDLE_HANDLER;
typedef struct _POP_POWER_ACTION;
typedef struct _POP_SHUTDOWN_BUG_CHECK;
typedef struct _POP_THERMAL_ZONE;
typedef struct _POP_TRIGGER_WAIT;
typedef struct _PORT_MESSAGE;
typedef struct _POWER_ACTION_POLICY;
typedef struct _POWER_CHANNEL_SUMMARY;
typedef struct _POWER_SEQUENCE;
typedef union _POWER_STATE;
typedef struct _PP_LOOKASIDE_LIST;
typedef struct _PRIVATE_CACHE_MAP;
typedef struct _PRIVATE_CACHE_MAP_FLAGS;
typedef struct _PRIVILEGE_SET;
typedef struct _PROCESS_WS_WATCH_INFORMATION;
typedef struct _PROCESSOR_IDLE_TIMES;
typedef struct _PROCESSOR_PERF_STATE;
typedef struct _PROCESSOR_POWER_POLICY;
typedef struct _PROCESSOR_POWER_POLICY_INFO;
typedef struct _PROCESSOR_POWER_STATE;
typedef struct _PS_IMPERSONATION_INFORMATION;
typedef struct _PS_JOB_TOKEN_FILTER;
typedef struct _QUAD;
typedef struct _RTL_ATOM_TABLE;
typedef struct _RTL_ATOM_TABLE_ENTRY;
typedef struct _RTL_BITMAP;
typedef struct _RTL_CRITICAL_SECTION;
typedef struct _RTL_CRITICAL_SECTION_DEBUG;
typedef struct _RTL_DRIVE_LETTER_CURDIR;
typedef struct _RTL_HANDLE_TABLE;
typedef struct _RTL_HANDLE_TABLE_ENTRY;
typedef struct _RTL_RANGE;
typedef struct _RTL_RANGE_LIST;
typedef struct _RTL_USER_PROCESS_PARAMETERS;
typedef struct _RTLP_RANGE_LIST_ENTRY;
typedef struct _SCSI_REQUEST_BLOCK;
typedef struct _SE_AUDIT_PROCESS_CREATION_INFO;
typedef struct _SECTION_IMAGE_INFORMATION;
typedef struct _SECTION_OBJECT;
typedef struct _SECTION_OBJECT_POINTERS;
typedef struct _SECURITY_CLIENT_CONTEXT;
typedef struct _SECURITY_DESCRIPTOR;
typedef struct _SECURITY_DESCRIPTOR_RELATIVE;
typedef struct _SECURITY_QUALITY_OF_SERVICE;
typedef struct _SECURITY_SUBJECT_CONTEXT;
typedef struct _SECURITY_TOKEN_AUDIT_DATA;
typedef struct _SECURITY_TOKEN_PROXY_DATA;
typedef struct _SEGMENT;
typedef struct _SEGMENT_OBJECT;
typedef struct _SEP_AUDIT_POLICY;
typedef struct _SEP_AUDIT_POLICY_CATEGORIES;
typedef struct _SEP_AUDIT_POLICY_OVERLAY;
typedef struct _SHARED_CACHE_MAP;
typedef struct _SID;
typedef struct _SID_AND_ATTRIBUTES;
typedef struct _SID_IDENTIFIER_AUTHORITY;
typedef struct _SINGLE_LIST_ENTRY;
typedef union _SLIST_HEADER;
typedef struct _STRING;
typedef struct _SUBSECTION;
typedef struct _SUPPORTED_RANGE;
typedef struct _SUPPORTED_RANGES;
typedef struct _SYSPTES_HEADER;
typedef struct _SYSTEM_POWER_CAPABILITIES;
typedef struct _SYSTEM_POWER_LEVEL;
typedef struct _SYSTEM_POWER_POLICY;
typedef struct _TEB;
typedef struct _TEB_ACTIVE_FRAME;
typedef struct _TEB_ACTIVE_FRAME_CONTEXT;
typedef struct _TERMINATION_PORT;
typedef struct _THERMAL_INFORMATION;
typedef struct _TOKEN;
typedef struct _TOKEN_CONTROL;
typedef struct _TOKEN_SOURCE;
typedef struct _TRACE_ENABLE_FLAG_EXTENSION;
typedef union _ULARGE_INTEGER;
typedef struct _UNICODE_STRING;
typedef struct _VACB;
typedef struct _VACB_LEVEL_REFERENCE;
typedef struct _VI_DEADLOCK_GLOBALS;
typedef struct _VI_DEADLOCK_NODE;
typedef struct _VI_DEADLOCK_RESOURCE;
typedef struct _VI_DEADLOCK_THREAD;
typedef struct _VI_POOL_ENTRY;
typedef struct _VI_POOL_ENTRY_INUSE;
typedef struct _VPB;
typedef struct _WAIT_CONTEXT_BLOCK;
typedef struct _WMI_BUFFER_HEADER;
typedef struct _WMI_BUFFER_STATE;
typedef struct _WMI_CLIENT_CONTEXT;
typedef struct _WMI_LOGGER_CONTEXT;
typedef struct _WMI_LOGGER_MODE;
typedef struct _WNODE_HEADER;
typedef struct _WORK_QUEUE_ITEM;
typedef struct _Wx86ThreadState;
typedef struct _X86_DBGKD_CONTROL_SET;

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Function types

typedef VOID (NEAR STDCALL FUNCT_00BC_0130_DeferredRoutine) (struct _KDPC*, VOID*, VOID*, VOID*);
typedef enum _EXCEPTION_DISPOSITION (NEAR STDCALL FUNCT_0161_0160_Handler) (struct _EXCEPTION_RECORD*, VOID*, struct _CONTEXT*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00BC_01AA_NormalRoutine) (VOID*, VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00BC_01A1_KernelRoutine) (struct _KAPC*, FUNCT_00BC_01AA_NormalRoutine**, VOID**, VOID**, VOID**);
typedef VOID (NEAR STDCALL FUNCT_00BC_01AA_NormalRoutine) (VOID*, VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00BC_01B0_RundownRoutine) (struct _KAPC*);
typedef VOID* (NEAR STDCALL FUNCT_00BB_0280_Allocate) (enum _POOL_TYPE, ULONG32, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00BC_0285_Free_InterfaceReference_InterfaceDereference_DeleteProcedure_ReleaseFromLazyWrite_ReleaseFromReadAhead_WorkerRoutine_Destructor_Callback) (VOID*);
typedef VOID (NEAR STDCALL FUNCT_00BC_028D_WorkerRoutine) (VOID*, VOID*, VOID*, VOID*);
typedef VOID (NEAR FASTCALL FUNCT_00BC_02E9_IdleFunction) (struct _PROCESSOR_POWER_STATE*);
typedef LONG32 (NEAR FASTCALL FUNCT_0049_0301_PerfSetThrottle) (UINT8);
typedef LONG32 (NEAR STDCALL FUNCT_0049_03BB_AddDevice) (struct _DRIVER_OBJECT*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_03D8_PreAcquireForSectionSynchronization_PreReleaseForSectionSynchronization_PreAcquireForCcFlush_PreReleaseForCcFlush_PreAcquireForModifiedPageWriter_PreReleaseForModifiedPageWriter) (struct _FS_FILTER_CALLBACK_DATA*, VOID**);
typedef VOID (NEAR STDCALL FUNCT_00BC_0445_PostAcquireForSectionSynchronization_PostReleaseForSectionSynchronization_PostAcquireForCcFlush_PostReleaseForCcFlush_PostAcquireForModifiedPageWriter_PostReleaseForModifiedPageWriter) (struct _FS_FILTER_CALLBACK_DATA*, LONG32, VOID*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_0469_FastIoCheckIfPossible) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, UINT8, ULONG32, UINT8, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_0478_FastIoRead_FastIoWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, UINT8, ULONG32, VOID*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_0482_FastIoQueryBasicInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_BASIC_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_0490_FastIoQueryStandardInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_STANDARD_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_049E_FastIoLock) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, union _LARGE_INTEGER*, struct _EPROCESS*, ULONG32, UINT8, UINT8, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef VOID (NEAR STDCALL FUNCT_00BC_0631_PostProcessInitRoutine_DispatchAddress_FinishRoutine) ();
typedef UINT8 (NEAR STDCALL FUNCT_003D_067B_FastIoUnlockSingle) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, union _LARGE_INTEGER*, struct _EPROCESS*, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_0684_FastIoUnlockAll) (struct _FILE_OBJECT*, struct _EPROCESS*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_068A_FastIoUnlockAllByKey) (struct _FILE_OBJECT*, VOID*, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_0691_FastIoDeviceControl) (struct _FILE_OBJECT*, UINT8, VOID*, ULONG32, VOID*, ULONG32, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef VOID (NEAR STDCALL FUNCT_00BC_069C_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection) (struct _FILE_OBJECT*);
typedef VOID (NEAR STDCALL FUNCT_00BC_069F_FastIoDetachDevice) (struct _DEVICE_OBJECT*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_06A3_FastIoQueryNetworkOpenInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_NETWORK_OPEN_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_06B3_AcquireForModWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, struct _ERESOURCE**, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_06B9_MdlRead_PrepareMdlWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, ULONG32, struct _MDL**, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_06CD_MdlReadComplete_MdlReadCompleteCompressed) (struct _FILE_OBJECT*, struct _MDL*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_06D2_MdlWriteComplete_MdlWriteCompleteCompressed) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, struct _MDL*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_06D8_FastIoReadCompressed_FastIoWriteCompressed) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, ULONG32, VOID*, struct _MDL**, struct _IO_STATUS_BLOCK*, struct _COMPRESSED_DATA_INFO*, ULONG32, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_06ED_FastIoQueryOpen) (struct _IRP*, struct _FILE_NETWORK_OPEN_INFORMATION*, struct _DEVICE_OBJECT*);
typedef VOID (NEAR STDCALL FUNCT_00BC_0713_UserApcRoutine) (VOID*, struct _IO_STATUS_BLOCK*, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00BC_0718_DriverStartIo_CancelRoutine_SavedCancelRoutine) (struct _DEVICE_OBJECT*, struct _IRP*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_0948_CompletionRoutine) (struct _DEVICE_OBJECT*, struct _IRP*, VOID*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_094D_ReleaseForModWrite) (struct _FILE_OBJECT*, struct _ERESOURCE*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_0952_AcquireForCcFlush_ReleaseForCcFlush) (struct _FILE_OBJECT*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_0956_DriverInit) (struct _DRIVER_OBJECT*, struct _UNICODE_STRING*);
typedef VOID (NEAR STDCALL FUNCT_00BC_095A_DriverUnload) (struct _DRIVER_OBJECT*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_095E_MajorFunction) (struct _DEVICE_OBJECT*, struct _IRP*);
typedef VOID (NEAR STDCALL FUNCT_00BC_0968_TimerRoutine) (struct _DEVICE_OBJECT*, VOID*);
typedef enum _IO_ALLOCATION_ACTION (NEAR STDCALL FUNCT_0978_0977_DeviceRoutine) (struct _DEVICE_OBJECT*, struct _IRP*, VOID*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00BC_09D8_DumpProcedure) (VOID*, struct _OBJECT_DUMP_CONTROL*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_09E0_OpenProcedure) (enum _OB_OPEN_REASON, struct _EPROCESS*, VOID*, ULONG32, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00BC_09ED_CloseProcedure) (struct _EPROCESS*, VOID*, ULONG32, ULONG32, ULONG32);
typedef LONG32 (NEAR STDCALL FUNCT_0049_09F4_ParseProcedure) (VOID*, VOID*, struct _ACCESS_STATE*, CHAR, ULONG32, struct _UNICODE_STRING*, struct _UNICODE_STRING*, VOID*, struct _SECURITY_QUALITY_OF_SERVICE*, VOID**);
typedef LONG32 (NEAR STDCALL FUNCT_0049_0A00_SecurityProcedure) (VOID*, enum _SECURITY_OPERATION_CODE, ULONG32*, VOID*, ULONG32*, VOID**, enum _POOL_TYPE, struct _GENERIC_MAPPING*, CHAR);
typedef LONG32 (NEAR STDCALL FUNCT_0049_0A11_QueryNameProcedure) (VOID*, UINT8, struct _OBJECT_NAME_INFORMATION*, ULONG32, ULONG32*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_0A18_OkayToCloseProcedure) (struct _EPROCESS*, VOID*, VOID*, CHAR);
typedef UINT8 (NEAR STDCALL FUNCT_003D_0BDB_AcquireForLazyWrite_AcquireForReadAhead) (VOID*, UINT8);
typedef VOID (NEAR STDCALL FUNCT_00BC_0BDF_FlushToLsnRoutine) (VOID*, union _LARGE_INTEGER);
typedef LONG32 (NEAR STDCALL FUNCT_0049_0C6E_CommitRoutine) (VOID*, VOID**, ULONG32*);
typedef INT64 (NEAR STDCALL FUNCT_004D_0E28_GetCpuClock) ();
typedef VOID (NEAR STDCALL FUNCT_00BC_0E44_BufferCallback) (struct _WMI_BUFFER_HEADER*, VOID*);
typedef VOID (NEAR STDCALL FUNCT_00BC_0EDA_PostRoutine) (VOID*, VOID*);
typedef struct _CELL_DATA* (NEAR STDCALL FUNCT_0F22_0F21_GetCellRoutine) (struct _HHIVE*, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00BC_0F6F_ReleaseCellRoutine) (struct _HHIVE*, ULONG32);
typedef VOID* (NEAR STDCALL FUNCT_00BB_0F71_Allocate) (ULONG32, UINT8, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00BC_0F76_Free) (VOID*, ULONG32);
typedef UINT8 (NEAR STDCALL FUNCT_003D_0F7A_FileSetSize) (struct _HHIVE*, ULONG32, ULONG32, ULONG32);
typedef UINT8 (NEAR STDCALL FUNCT_003D_0F80_FileWrite) (struct _HHIVE*, ULONG32, struct _CMP_OFFSET_ARRAY*, ULONG32, ULONG32*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_0F8C_FileRead) (struct _HHIVE*, ULONG32, ULONG32*, VOID*, ULONG32);
typedef UINT8 (NEAR STDCALL FUNCT_003D_0F93_FileFlush) (struct _HHIVE*, ULONG32, union _LARGE_INTEGER*, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00BC_130F_BankedRoutine) (ULONG32, ULONG32, VOID*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_138A_SystemControlIrpDispatchFunction_OtherIrpDispatchFunction_DispatchFunction) (struct _IRP*, struct _IO_STACK_LOCATION*, struct _PCI_COMMON_EXTENSION*);
typedef ULONG32 (NEAR STDCALL FUNCT_0009_13CC_ReadConfig_WriteConfig) (VOID*, UINT8, ULONG32, VOID*, ULONG32, ULONG32);
typedef VOID (NEAR STDCALL FUNCT_00BC_13D4_PinToLine) (VOID*, struct _PCI_COMMON_CONFIG*);
typedef VOID (NEAR STDCALL FUNCT_00BC_1422_LineToPin) (VOID*, struct _PCI_COMMON_CONFIG*, struct _PCI_COMMON_CONFIG*);
typedef ULONG32 (NEAR STDCALL FUNCT_0009_1464_GetBusData_SetBusData) (struct _BUS_HANDLER*, struct _BUS_HANDLER*, ULONG32, VOID*, ULONG32, ULONG32);
typedef LONG32 (NEAR STDCALL FUNCT_0049_146C_AdjustResourceList) (struct _BUS_HANDLER*, struct _BUS_HANDLER*, struct _IO_RESOURCE_REQUIREMENTS_LIST**);
typedef LONG32 (NEAR STDCALL FUNCT_0049_1472_AssignSlotResources) (struct _BUS_HANDLER*, struct _BUS_HANDLER*, struct _UNICODE_STRING*, struct _UNICODE_STRING*, struct _DRIVER_OBJECT*, struct _DEVICE_OBJECT*, ULONG32, struct _CM_RESOURCE_LIST**);
typedef ULONG32 (NEAR STDCALL FUNCT_0009_147D_GetInterruptVector) (struct _BUS_HANDLER*, struct _BUS_HANDLER*, ULONG32, ULONG32, UINT8*, ULONG32*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_1485_TranslateBusAddress) (struct _BUS_HANDLER*, struct _BUS_HANDLER*, union _LARGE_INTEGER, ULONG32*, union _LARGE_INTEGER*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_1544_ArbiterHandler) (VOID*, enum _ARBITER_ACTION, struct _ARBITER_PARAMETERS*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_15EE_ServiceRoutine) (struct _KINTERRUPT*, VOID*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_160F_Constructor) (VOID*, VOID*, VOID*, UINT16, UINT16, struct _INTERFACE*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_1617_Initializer) (struct _PCI_ARBITER_INSTANCE*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_1682_UnpackRequirement) (struct _IO_RESOURCE_DESCRIPTOR*, UINT64*, UINT64*, ULONG32*, ULONG32*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_168A_PackResource) (struct _IO_RESOURCE_DESCRIPTOR*, UINT64, struct _CM_PARTIAL_RESOURCE_DESCRIPTOR*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_168F_UnpackResource) (struct _CM_PARTIAL_RESOURCE_DESCRIPTOR*, UINT64*, ULONG32*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_1694_ScoreRequirement) (struct _IO_RESOURCE_DESCRIPTOR*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_1697_TestAllocation_RetestAllocation_BootAllocation_QueryArbitrate) (struct _ARBITER_INSTANCE*, struct _LIST_ENTRY*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_169C_CommitAllocation_RollbackAllocation) (struct _ARBITER_INSTANCE*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_169F_QueryConflict) (struct _ARBITER_INSTANCE*, struct _DEVICE_OBJECT*, struct _IO_RESOURCE_DESCRIPTOR*, ULONG32*, struct _ARBITER_CONFLICT_INFO**);
typedef LONG32 (NEAR STDCALL FUNCT_0049_16A6_AddReserved) (struct _ARBITER_INSTANCE*, struct _IO_RESOURCE_DESCRIPTOR*, struct _CM_PARTIAL_RESOURCE_DESCRIPTOR*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_16AB_StartArbiter) (struct _ARBITER_INSTANCE*, struct _CM_RESOURCE_LIST*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_16AF_PreprocessEntry_AllocateEntry) (struct _ARBITER_INSTANCE*, struct _ARBITER_ALLOCATION_STATE*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_16B3_GetNextAllocationRange_FindSuitableRange_OverrideConflict) (struct _ARBITER_INSTANCE*, struct _ARBITER_ALLOCATION_STATE*);
typedef VOID (NEAR STDCALL FUNCT_00BC_16B5_AddAllocation_BacktrackAllocation) (struct _ARBITER_INSTANCE*, struct _ARBITER_ALLOCATION_STATE*);
typedef UINT8 (NEAR STDCALL FUNCT_003D_16B7_ConflictCallback) (VOID*, struct _RTL_RANGE*);
typedef UINT8 (NEAR FASTCALL FUNCT_003D_1759_IdleFunction) (struct _PROCESSOR_IDLE_TIMES*);
typedef VOID (NEAR STDCALL FUNCT_00BC_18EF_StallRoutine) (ULONG32);
typedef UINT8 (NEAR STDCALL FUNCT_003D_18F2_OpenRoutine) (union _LARGE_INTEGER);
typedef LONG32 (NEAR STDCALL FUNCT_0049_18F5_WriteRoutine) (union _LARGE_INTEGER*, struct _MDL*);
typedef LONG32 (NEAR STDCALL FUNCT_0049_18FB_WritePendingRoutine) (LONG32, union _LARGE_INTEGER*, struct _MDL*, VOID*);

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Structure types

          typedef struct _LUID       // 2 elements, 0x8 bytes (sizeof) 
          {                                                            
/*0x000*/     ULONG32      LowPart;                                    
/*0x004*/     LONG32       HighPart;                                   
          }LUID, *PLUID;                                               
                                                                       
          typedef struct _SECURITY_SUBJECT_CONTEXT                   // 4 elements, 0x10 bytes (sizeof) 
          {                                                                                             
/*0x000*/     VOID*        ClientToken;                                                                 
/*0x004*/     enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;                                    
/*0x008*/     VOID*        PrimaryToken;                                                                
/*0x00C*/     VOID*        ProcessAuditId;                                                              
          }SECURITY_SUBJECT_CONTEXT, *PSECURITY_SUBJECT_CONTEXT;                                        
                                                                                                        
          typedef struct _LUID_AND_ATTRIBUTES // 2 elements, 0xC bytes (sizeof) 
          {                                                                     
/*0x000*/     struct _LUID Luid;              // 2 elements, 0x8 bytes (sizeof) 
/*0x008*/     ULONG32      Attributes;                                          
          }LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES;                                  
                                                                                
          typedef struct _INITIAL_PRIVILEGE_SET         // 3 elements, 0x2C bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[3];                                    
          }INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET;                                   
                                                                                           
          typedef struct _PRIVILEGE_SET                 // 3 elements, 0x14 bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[1];                                    
          }PRIVILEGE_SET, *PPRIVILEGE_SET;                                                 
                                                                                           
          typedef struct _UNICODE_STRING  // 3 elements, 0x8 bytes (sizeof) 
          {                                                                 
/*0x000*/     UINT16       Length;                                          
/*0x002*/     UINT16       MaximumLength;                                   
/*0x004*/     UINT16*      Buffer;                                          
          }UNICODE_STRING, *PUNICODE_STRING;                                  
                                                                            
          typedef struct _ACCESS_STATE                                 // 16 elements, 0x74 bytes (sizeof) 
          {                                                                                                
/*0x000*/     struct _LUID OperationID;                                // 2 elements, 0x8 bytes (sizeof)   
/*0x008*/     UINT8        SecurityEvaluated;                                                              
/*0x009*/     UINT8        GenerateAudit;                                                                  
/*0x00A*/     UINT8        GenerateOnClose;                                                                
/*0x00B*/     UINT8        PrivilegesAllocated;                                                            
/*0x00C*/     ULONG32      Flags;                                                                          
/*0x010*/     ULONG32      RemainingDesiredAccess;                                                         
/*0x014*/     ULONG32      PreviouslyGrantedAccess;                                                        
/*0x018*/     ULONG32      OriginalDesiredAccess;                                                          
/*0x01C*/     struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext; // 4 elements, 0x10 bytes (sizeof)  
/*0x02C*/     VOID*        SecurityDescriptor;                                                             
/*0x030*/     VOID*        AuxData;                                                                        
              union                                                    // 2 elements, 0x2C bytes (sizeof)  
              {                                                                                            
/*0x034*/         struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;   // 3 elements, 0x2C bytes (sizeof)  
/*0x034*/         struct _PRIVILEGE_SET PrivilegeSet;                  // 3 elements, 0x14 bytes (sizeof)  
              }Privileges;                                                                                 
/*0x060*/     UINT8        AuditPrivileges;                                                                
/*0x061*/     UINT8        _PADDING0_[0x3];                                                                
/*0x064*/     struct _UNICODE_STRING ObjectName;                       // 3 elements, 0x8 bytes (sizeof)   
/*0x06C*/     struct _UNICODE_STRING ObjectTypeName;                   // 3 elements, 0x8 bytes (sizeof)   
          }ACCESS_STATE, *PACCESS_STATE;                                                                   
                                                                                                           
          typedef struct _ACL           // 5 elements, 0x8 bytes (sizeof) 
          {                                                               
/*0x000*/     UINT8        AclRevision;                                   
/*0x001*/     UINT8        Sbz1;                                          
/*0x002*/     UINT16       AclSize;                                       
/*0x004*/     UINT16       AceCount;                                      
/*0x006*/     UINT16       Sbz2;                                          
          }ACL, *PACL;                                                    
                                                                          
          typedef struct _LIST_ENTRY     // 2 elements, 0x8 bytes (sizeof) 
          {                                                                
/*0x000*/     struct _LIST_ENTRY* Flink;                                   
/*0x004*/     struct _LIST_ENTRY* Blink;                                   
          }LIST_ENTRY, *PLIST_ENTRY;                                       
                                                                           
          typedef struct _ACTIVATION_CONTEXT_STACK   // 4 elements, 0x14 bytes (sizeof) 
          {                                                                             
/*0x000*/     ULONG32      Flags;                                                       
/*0x004*/     ULONG32      NextCookieSequenceNumber;                                    
/*0x008*/     VOID*        ActiveFrame;                                                 
/*0x00C*/     struct _LIST_ENTRY FrameListCache;     // 2 elements, 0x8 bytes (sizeof)  
          }ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK;                                   
                                                                                        
typedef struct _ADAPTER_OBJECT // 0 elements, 0x0 bytes (sizeof) 
{                                                                
}ADAPTER_OBJECT, *PADAPTER_OBJECT;                                  
                                                                 
          typedef struct _AMD64_DBGKD_CONTROL_SET // 4 elements, 0x1C bytes (sizeof) 
          {                                                                          
/*0x000*/     ULONG32      TraceFlag;                                                
/*0x004*/     UINT64       Dr7;                                                      
/*0x00C*/     UINT64       CurrentSymbolStart;                                       
/*0x014*/     UINT64       CurrentSymbolEnd;                                         
          }AMD64_DBGKD_CONTROL_SET, *PAMD64_DBGKD_CONTROL_SET;                                   
                                                                                     
          typedef struct _ARBITER_ALLOCATION_STATE             // 12 elements, 0x38 bytes (sizeof) 
          {                                                                                        
/*0x000*/     UINT64       Start;                                                                  
/*0x008*/     UINT64       End;                                                                    
/*0x010*/     UINT64       CurrentMinimum;                                                         
/*0x018*/     UINT64       CurrentMaximum;                                                         
/*0x020*/     struct _ARBITER_LIST_ENTRY* Entry;                                                   
/*0x024*/     struct _ARBITER_ALTERNATIVE* CurrentAlternative;                                     
/*0x028*/     ULONG32      AlternativeCount;                                                       
/*0x02C*/     struct _ARBITER_ALTERNATIVE* Alternatives;                                           
/*0x030*/     UINT16       Flags;                                                                  
/*0x032*/     UINT8        RangeAttributes;                                                        
/*0x033*/     UINT8        RangeAvailableAttributes;                                               
/*0x034*/     ULONG32      WorkSpace;                                                              
          }ARBITER_ALLOCATION_STATE, *PARBITER_ALLOCATION_STATE;                                    
                                                                                                   
          typedef struct _ARBITER_ALTERNATIVE             // 8 elements, 0x30 bytes (sizeof) 
          {                                                                                  
/*0x000*/     UINT64       Minimum;                                                          
/*0x008*/     UINT64       Maximum;                                                          
/*0x010*/     ULONG32      Length;                                                           
/*0x014*/     ULONG32      Alignment;                                                        
/*0x018*/     LONG32       Priority;                                                         
/*0x01C*/     ULONG32      Flags;                                                            
/*0x020*/     struct _IO_RESOURCE_DESCRIPTOR* Descriptor;                                    
/*0x024*/     ULONG32      Reserved[3];                                                      
          }ARBITER_ALTERNATIVE, *PARBITER_ALTERNATIVE;                                       
                                                                                             
          typedef struct _ARBITER_CONFLICT_INFO    // 3 elements, 0x18 bytes (sizeof) 
          {                                                                           
/*0x000*/     struct _DEVICE_OBJECT* OwningObject;                                    
/*0x004*/     UINT8        _PADDING0_[0x4];                                           
/*0x008*/     UINT64       Start;                                                     
/*0x010*/     UINT64       End;                                                       
          }ARBITER_CONFLICT_INFO, *PARBITER_CONFLICT_INFO;                                   
                                                                                      
          typedef struct _ARBITER_ORDERING_LIST    // 3 elements, 0x8 bytes (sizeof) 
          {                                                                          
/*0x000*/     UINT16       Count;                                                    
/*0x002*/     UINT16       Maximum;                                                  
/*0x004*/     struct _ARBITER_ORDERING* Orderings;                                   
          }ARBITER_ORDERING_LIST, *PARBITER_ORDERING_LIST;                                  
                                                                                     
          typedef struct _ARBITER_INSTANCE                                                                       // 37 elements, 0x9C bytes (sizeof) 
          {                                                                                                                                          
/*0x000*/     ULONG32      Signature;                                                                                                                
/*0x004*/     struct _KEVENT* MutexEvent;                                                                                                            
/*0x008*/     UINT16*      Name;                                                                                                                     
/*0x00C*/     INT32        ResourceType;                                                                                                             
/*0x010*/     struct _RTL_RANGE_LIST* Allocation;                                                                                                    
/*0x014*/     struct _RTL_RANGE_LIST* PossibleAllocation;                                                                                            
/*0x018*/     struct _ARBITER_ORDERING_LIST OrderingList;                                                        // 3 elements, 0x8 bytes (sizeof)   
/*0x020*/     struct _ARBITER_ORDERING_LIST ReservedList;                                                        // 3 elements, 0x8 bytes (sizeof)   
/*0x028*/     LONG32       ReferenceCount;                                                                                                           
/*0x02C*/     struct _ARBITER_INTERFACE* Interface;                                                                                                  
/*0x030*/     ULONG32      AllocationStackMaxSize;                                                                                                   
/*0x034*/     struct _ARBITER_ALLOCATION_STATE* AllocationStack;                                                                                     
/*0x038*/     FUNCT_0049_1682_UnpackRequirement* UnpackRequirement;                                                                                  
/*0x03C*/     FUNCT_0049_168A_PackResource* PackResource;                                                                                            
/*0x040*/     FUNCT_0049_168F_UnpackResource* UnpackResource;                                                                                        
/*0x044*/     FUNCT_0049_1694_ScoreRequirement* ScoreRequirement;                                                                                    
/*0x048*/     FUNCT_0049_1697_TestAllocation_RetestAllocation_BootAllocation_QueryArbitrate* TestAllocation;                                         
/*0x04C*/     FUNCT_0049_1697_TestAllocation_RetestAllocation_BootAllocation_QueryArbitrate* RetestAllocation;                                       
/*0x050*/     FUNCT_0049_169C_CommitAllocation_RollbackAllocation* CommitAllocation;                                                                 
/*0x054*/     FUNCT_0049_169C_CommitAllocation_RollbackAllocation* RollbackAllocation;                                                               
/*0x058*/     FUNCT_0049_1697_TestAllocation_RetestAllocation_BootAllocation_QueryArbitrate* BootAllocation;                                         
/*0x05C*/     FUNCT_0049_1697_TestAllocation_RetestAllocation_BootAllocation_QueryArbitrate* QueryArbitrate;                                         
/*0x060*/     FUNCT_0049_169F_QueryConflict* QueryConflict;                                                                                          
/*0x064*/     FUNCT_0049_16A6_AddReserved* AddReserved;                                                                                              
/*0x068*/     FUNCT_0049_16AB_StartArbiter* StartArbiter;                                                                                            
/*0x06C*/     FUNCT_0049_16AF_PreprocessEntry_AllocateEntry* PreprocessEntry;                                                                        
/*0x070*/     FUNCT_0049_16AF_PreprocessEntry_AllocateEntry* AllocateEntry;                                                                          
/*0x074*/     FUNCT_003D_16B3_GetNextAllocationRange_FindSuitableRange_OverrideConflict* GetNextAllocationRange;                                     
/*0x078*/     FUNCT_003D_16B3_GetNextAllocationRange_FindSuitableRange_OverrideConflict* FindSuitableRange;                                          
/*0x07C*/     FUNCT_00BC_16B5_AddAllocation_BacktrackAllocation* AddAllocation;                                                                      
/*0x080*/     FUNCT_00BC_16B5_AddAllocation_BacktrackAllocation* BacktrackAllocation;                                                                
/*0x084*/     FUNCT_003D_16B3_GetNextAllocationRange_FindSuitableRange_OverrideConflict* OverrideConflict;                                           
/*0x088*/     UINT8        TransactionInProgress;                                                                                                    
/*0x089*/     UINT8        _PADDING0_[0x3];                                                                                                          
/*0x08C*/     VOID*        Extension;                                                                                                                
/*0x090*/     struct _DEVICE_OBJECT* BusDeviceObject;                                                                                                
/*0x094*/     VOID*        ConflictCallbackContext;                                                                                                  
/*0x098*/     FUNCT_003D_16B7_ConflictCallback* ConflictCallback;                                                                                    
          }ARBITER_INSTANCE, *PARBITER_INSTANCE;                                                                                                     
                                                                                                                                                     
          typedef struct _ARBITER_INTERFACE                                                                                                                                                   // 7 elements, 0x18 bytes (sizeof) 
          {                                                                                                                                                                                                                      
/*0x000*/     UINT16       Size;                                                                                                                                                                                                 
/*0x002*/     UINT16       Version;                                                                                                                                                                                              
/*0x004*/     VOID*        Context;                                                                                                                                                                                              
/*0x008*/     FUNCT_00BC_0285_Free_InterfaceReference_InterfaceDereference_DeleteProcedure_ReleaseFromLazyWrite_ReleaseFromReadAhead_WorkerRoutine_Destructor_Callback* InterfaceReference;                                      
/*0x00C*/     FUNCT_00BC_0285_Free_InterfaceReference_InterfaceDereference_DeleteProcedure_ReleaseFromLazyWrite_ReleaseFromReadAhead_WorkerRoutine_Destructor_Callback* InterfaceDereference;                                    
/*0x010*/     FUNCT_0049_1544_ArbiterHandler* ArbiterHandler;                                                                                                                                                                    
/*0x014*/     ULONG32      Flags;                                                                                                                                                                                                
          }ARBITER_INTERFACE, *PARBITER_INTERFACE;                                                                                                                                                                               
                                                                                                                                                                                                                                 
          typedef struct _ARBITER_LIST_ENTRY                       // 13 elements, 0x38 bytes (sizeof) 
          {                                                                                            
/*0x000*/     struct _LIST_ENTRY ListEntry;                        // 2 elements, 0x8 bytes (sizeof)   
/*0x008*/     ULONG32      AlternativeCount;                                                           
/*0x00C*/     struct _IO_RESOURCE_DESCRIPTOR* Alternatives;                                            
/*0x010*/     struct _DEVICE_OBJECT* PhysicalDeviceObject;                                             
/*0x014*/     enum _ARBITER_REQUEST_SOURCE RequestSource;                                              
/*0x018*/     ULONG32      Flags;                                                                      
/*0x01C*/     LONG32       WorkSpace;                                                                  
/*0x020*/     enum _INTERFACE_TYPE InterfaceType;                                                      
/*0x024*/     ULONG32      SlotNumber;                                                                 
/*0x028*/     ULONG32      BusNumber;                                                                  
/*0x02C*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* Assignment;                                      
/*0x030*/     struct _IO_RESOURCE_DESCRIPTOR* SelectedAlternative;                                     
/*0x034*/     enum _ARBITER_RESULT Result;                                                             
          }ARBITER_LIST_ENTRY, *PARBITER_LIST_ENTRY;                                                   
                                                                                                       
          typedef struct _ARBITER_ORDERING // 2 elements, 0x10 bytes (sizeof) 
          {                                                                   
/*0x000*/     UINT64       Start;                                             
/*0x008*/     UINT64       End;                                               
          }ARBITER_ORDERING, *PARBITER_ORDERING;                                   
                                                                              
          typedef struct _ARBITER_PARAMETERS                                 // 1 elements, 0x10 bytes (sizeof) 
          {                                                                                                     
              union                                                          // 7 elements, 0x10 bytes (sizeof) 
              {                                                                                                 
                  struct                                                     // 3 elements, 0xC bytes (sizeof)  
                  {                                                                                             
/*0x000*/             struct _LIST_ENTRY* ArbitrationList;                                                      
/*0x004*/             ULONG32      AllocateFromCount;                                                           
/*0x008*/             struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;                                     
                  }TestAllocation;                                                                              
                  struct                                                     // 3 elements, 0xC bytes (sizeof)  
                  {                                                                                             
/*0x000*/             struct _LIST_ENTRY* ArbitrationList;                                                      
/*0x004*/             ULONG32      AllocateFromCount;                                                           
/*0x008*/             struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;                                     
                  }RetestAllocation;                                                                            
                  struct                                                     // 1 elements, 0x4 bytes (sizeof)  
                  {                                                                                             
/*0x000*/             struct _LIST_ENTRY* ArbitrationList;                                                      
                  }BootAllocation;                                                                              
                  struct                                                     // 1 elements, 0x4 bytes (sizeof)  
                  {                                                                                             
/*0x000*/             struct _CM_PARTIAL_RESOURCE_LIST** AllocatedResources;                                    
                  }QueryAllocatedResources;                                                                     
                  struct                                                     // 4 elements, 0x10 bytes (sizeof) 
                  {                                                                                             
/*0x000*/             struct _DEVICE_OBJECT* PhysicalDeviceObject;                                              
/*0x004*/             struct _IO_RESOURCE_DESCRIPTOR* ConflictingResource;                                      
/*0x008*/             ULONG32*     ConflictCount;                                                               
/*0x00C*/             struct _ARBITER_CONFLICT_INFO** Conflicts;                                                
                  }QueryConflict;                                                                               
                  struct                                                     // 1 elements, 0x4 bytes (sizeof)  
                  {                                                                                             
/*0x000*/             struct _LIST_ENTRY* ArbitrationList;                                                      
                  }QueryArbitrate;                                                                              
                  struct                                                     // 1 elements, 0x4 bytes (sizeof)  
                  {                                                                                             
/*0x000*/             struct _DEVICE_OBJECT* ReserveDevice;                                                     
                  }AddReserved;                                                                                 
              }Parameters;                                                                                      
          }ARBITER_PARAMETERS, *PARBITER_PARAMETERS;                                                            
                                                                                                                
          typedef struct _BATTERY_REPORTING_SCALE // 2 elements, 0x8 bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      Granularity;                                             
/*0x004*/     ULONG32      Capacity;                                                
          }BATTERY_REPORTING_SCALE, *PBATTERY_REPORTING_SCALE;                                  
                                                                                    
          typedef struct _BITMAP_RANGE     // 6 elements, 0x20 bytes (sizeof) 
          {                                                                   
/*0x000*/     struct _LIST_ENTRY Links;    // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     INT64        BasePage;                                          
/*0x010*/     ULONG32      FirstDirtyPage;                                    
/*0x014*/     ULONG32      LastDirtyPage;                                     
/*0x018*/     ULONG32      DirtyPages;                                        
/*0x01C*/     ULONG32*     Bitmap;                                            
          }BITMAP_RANGE, *PBITMAP_RANGE;                                      
                                                                              
          typedef struct _BUS_EXTENSION_LIST          // 2 elements, 0x8 bytes (sizeof) 
          {                                                                             
/*0x000*/     VOID*        Next;                                                        
/*0x004*/     struct _PI_BUS_EXTENSION* BusExtension;                                   
          }BUS_EXTENSION_LIST, *PBUS_EXTENSION_LIST;                                    
                                                                                        
          typedef struct _BUS_HANDLER                                   // 24 elements, 0x6C bytes (sizeof) 
          {                                                                                                 
/*0x000*/     ULONG32      Version;                                                                         
/*0x004*/     enum _INTERFACE_TYPE InterfaceType;                                                           
/*0x008*/     enum _BUS_DATA_TYPE ConfigurationType;                                                        
/*0x00C*/     ULONG32      BusNumber;                                                                       
/*0x010*/     struct _DEVICE_OBJECT* DeviceObject;                                                          
/*0x014*/     struct _BUS_HANDLER* ParentHandler;                                                           
/*0x018*/     VOID*        BusData;                                                                         
/*0x01C*/     ULONG32      DeviceControlExtensionSize;                                                      
/*0x020*/     struct _SUPPORTED_RANGES* BusAddresses;                                                       
/*0x024*/     ULONG32      Reserved[4];                                                                     
/*0x034*/     FUNCT_0009_1464_GetBusData_SetBusData* GetBusData;                                            
/*0x038*/     FUNCT_0009_1464_GetBusData_SetBusData* SetBusData;                                            
/*0x03C*/     FUNCT_0049_146C_AdjustResourceList* AdjustResourceList;                                       
/*0x040*/     FUNCT_0049_1472_AssignSlotResources* AssignSlotResources;                                     
/*0x044*/     FUNCT_0009_147D_GetInterruptVector* GetInterruptVector;                                       
/*0x048*/     FUNCT_003D_1485_TranslateBusAddress* TranslateBusAddress;                                     
/*0x04C*/     VOID*        Spare1;                                                                          
/*0x050*/     VOID*        Spare2;                                                                          
/*0x054*/     VOID*        Spare3;                                                                          
/*0x058*/     VOID*        Spare4;                                                                          
/*0x05C*/     VOID*        Spare5;                                                                          
/*0x060*/     VOID*        Spare6;                                                                          
/*0x064*/     VOID*        Spare7;                                                                          
/*0x068*/     VOID*        Spare8;                                                                          
          }BUS_HANDLER, *PBUS_HANDLER;                                                                      
                                                                                                            
          typedef struct _CACHE_MANAGER_CALLBACKS                                                                                                                                             // 4 elements, 0x10 bytes (sizeof) 
          {                                                                                                                                                                                                                      
/*0x000*/     FUNCT_003D_0BDB_AcquireForLazyWrite_AcquireForReadAhead* AcquireForLazyWrite;                                                                                                                                      
/*0x004*/     FUNCT_00BC_0285_Free_InterfaceReference_InterfaceDereference_DeleteProcedure_ReleaseFromLazyWrite_ReleaseFromReadAhead_WorkerRoutine_Destructor_Callback* ReleaseFromLazyWrite;                                    
/*0x008*/     FUNCT_003D_0BDB_AcquireForLazyWrite_AcquireForReadAhead* AcquireForReadAhead;                                                                                                                                      
/*0x00C*/     FUNCT_00BC_0285_Free_InterfaceReference_InterfaceDereference_DeleteProcedure_ReleaseFromLazyWrite_ReleaseFromReadAhead_WorkerRoutine_Destructor_Callback* ReleaseFromReadAhead;                                    
          }CACHE_MANAGER_CALLBACKS, *PCACHE_MANAGER_CALLBACKS;                                                                                                                                                                   
                                                                                                                                                                                                                                 
          typedef struct _DISPATCHER_HEADER    // 6 elements, 0x10 bytes (sizeof) 
          {                                                                       
/*0x000*/     UINT8        Type;                                                  
/*0x001*/     UINT8        Absolute;                                              
/*0x002*/     UINT8        Size;                                                  
/*0x003*/     UINT8        Inserted;                                              
/*0x004*/     LONG32       SignalState;                                           
/*0x008*/     struct _LIST_ENTRY WaitListHead; // 2 elements, 0x8 bytes (sizeof)  
          }DISPATCHER_HEADER, *PDISPATCHER_HEADER;                                   
                                                                                  
          typedef struct _KEVENT                // 1 elements, 0x10 bytes (sizeof) 
          {                                                                        
/*0x000*/     struct _DISPATCHER_HEADER Header; // 6 elements, 0x10 bytes (sizeof) 
          }KEVENT, *PKEVENT;                                                       
                                                                                   
          typedef struct _CACHE_UNINITIALIZE_EVENT    // 2 elements, 0x14 bytes (sizeof) 
          {                                                                              
/*0x000*/     struct _CACHE_UNINITIALIZE_EVENT* Next;                                    
/*0x004*/     struct _KEVENT Event;                   // 1 elements, 0x10 bytes (sizeof) 
          }CACHE_UNINITIALIZE_EVENT, *PCACHE_UNINITIALIZE_EVENT;                                   
                                                                                         
          typedef struct _CACHED_CHILD_LIST              // 3 elements, 0x8 bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      Count;                                                          
              union                                      // 2 elements, 0x4 bytes (sizeof) 
              {                                                                            
/*0x004*/         ULONG32      ValueList;                                                  
/*0x004*/         struct _CM_KEY_CONTROL_BLOCK* RealKcb;                                   
              };                                                                           
          }CACHED_CHILD_LIST, *PCACHED_CHILD_LIST;                                         
                                                                                           
          typedef struct _CALL_HASH_ENTRY   // 4 elements, 0x14 bytes (sizeof) 
          {                                                                    
/*0x000*/     struct _LIST_ENTRY ListEntry; // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     VOID*        CallersAddress;                                     
/*0x00C*/     VOID*        CallersCaller;                                      
/*0x010*/     ULONG32      CallCount;                                          
          }CALL_HASH_ENTRY, *PCALL_HASH_ENTRY;                                   
                                                                               
          typedef struct _CALL_PERFORMANCE_DATA // 2 elements, 0x204 bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      SpinLock;                                                
/*0x004*/     struct _LIST_ENTRY HashTable[64];                                     
          }CALL_PERFORMANCE_DATA, *PCALL_PERFORMANCE_DATA;                                    
                                                                                    
          typedef union _LARGE_INTEGER   // 4 elements, 0x8 bytes (sizeof) 
          {                                                                
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         LONG32       HighPart;                                   
              };                                                           
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         LONG32       HighPart;                                   
              }u;                                                          
/*0x000*/     INT64        QuadPart;                                       
          }LARGE_INTEGER, *PLARGE_INTEGER;                                  
                                                                           
          typedef struct _CHILD_LIST // 2 elements, 0x8 bytes (sizeof) 
          {                                                            
/*0x000*/     ULONG32      Count;                                      
/*0x004*/     ULONG32      List;                                       
          }CHILD_LIST, *PCHILD_LIST;                                   
                                                                       
          typedef struct _CM_KEY_REFERENCE // 2 elements, 0x8 bytes (sizeof) 
          {                                                                  
/*0x000*/     ULONG32      KeyCell;                                          
/*0x004*/     struct _HHIVE* KeyHive;                                        
          }CM_KEY_REFERENCE, *PCM_KEY_REFERENCE;                                  
                                                                             
          typedef struct _CM_KEY_NODE                          // 22 elements, 0x50 bytes (sizeof) 
          {                                                                                        
/*0x000*/     UINT16       Signature;                                                              
/*0x002*/     UINT16       Flags;                                                                  
/*0x004*/     union _LARGE_INTEGER LastWriteTime;              // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/     ULONG32      Spare;                                                                  
/*0x010*/     ULONG32      Parent;                                                                 
/*0x014*/     ULONG32      SubKeyCounts[2];                                                        
              union                                            // 2 elements, 0x10 bytes (sizeof)  
              {                                                                                    
                  struct                                       // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                
/*0x01C*/             ULONG32      SubKeyLists[2];                                                 
/*0x024*/             struct _CHILD_LIST ValueList;            // 2 elements, 0x8 bytes (sizeof)   
                  };                                                                               
/*0x01C*/         struct _CM_KEY_REFERENCE ChildHiveReference; // 2 elements, 0x8 bytes (sizeof)   
              };                                                                                   
/*0x02C*/     ULONG32      Security;                                                               
/*0x030*/     ULONG32      Class;                                                                  
              struct                                           // 4 elements, 0x4 bytes (sizeof)   
              {                                                                                    
/*0x034*/         ULONG32      MaxNameLen : 16;                // 0 BitPosition                    
/*0x034*/         ULONG32      UserFlags : 4;                  // 16 BitPosition                   
/*0x034*/         ULONG32      VirtControlFlags : 4;           // 20 BitPosition                   
/*0x034*/         ULONG32      Debug : 8;                      // 24 BitPosition                   
              };                                                                                   
/*0x038*/     ULONG32      MaxClassLen;                                                            
/*0x03C*/     ULONG32      MaxValueNameLen;                                                        
/*0x040*/     ULONG32      MaxValueDataLen;                                                        
/*0x044*/     ULONG32      WorkVar;                                                                
/*0x048*/     UINT16       NameLength;                                                             
/*0x04A*/     UINT16       ClassLength;                                                            
/*0x04C*/     UINT16       Name[1];                                                                
/*0x04E*/     UINT8        _PADDING0_[0x2];                                                        
          }CM_KEY_NODE, *PCM_KEY_NODE;                                                             
                                                                                                   
          typedef struct _CM_KEY_VALUE      // 8 elements, 0x18 bytes (sizeof) 
          {                                                                    
/*0x000*/     UINT16       Signature;                                          
/*0x002*/     UINT16       NameLength;                                         
/*0x004*/     ULONG32      DataLength;                                         
/*0x008*/     ULONG32      Data;                                               
/*0x00C*/     ULONG32      Type;                                               
/*0x010*/     UINT16       Flags;                                              
/*0x012*/     UINT16       Spare;                                              
/*0x014*/     UINT16       Name[1];                                            
/*0x016*/     UINT8        _PADDING0_[0x2];                                    
          }CM_KEY_VALUE, *PCM_KEY_VALUE;                                       
                                                                               
          typedef struct _SECURITY_DESCRIPTOR_RELATIVE // 7 elements, 0x14 bytes (sizeof) 
          {                                                                               
/*0x000*/     UINT8        Revision;                                                      
/*0x001*/     UINT8        Sbz1;                                                          
/*0x002*/     UINT16       Control;                                                       
/*0x004*/     ULONG32      Owner;                                                         
/*0x008*/     ULONG32      Group;                                                         
/*0x00C*/     ULONG32      Sacl;                                                          
/*0x010*/     ULONG32      Dacl;                                                          
          }SECURITY_DESCRIPTOR_RELATIVE, *PSECURITY_DESCRIPTOR_RELATIVE;                                   
                                                                                          
          typedef struct _CM_KEY_SECURITY                      // 7 elements, 0x28 bytes (sizeof) 
          {                                                                                       
/*0x000*/     UINT16       Signature;                                                             
/*0x002*/     UINT16       Reserved;                                                              
/*0x004*/     ULONG32      Flink;                                                                 
/*0x008*/     ULONG32      Blink;                                                                 
/*0x00C*/     ULONG32      ReferenceCount;                                                        
/*0x010*/     ULONG32      DescriptorLength;                                                      
/*0x014*/     struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor; // 7 elements, 0x14 bytes (sizeof) 
          }CM_KEY_SECURITY, *PCM_KEY_SECURITY;                                                    
                                                                                                  
          typedef struct _CM_KEY_INDEX // 3 elements, 0x8 bytes (sizeof) 
          {                                                              
/*0x000*/     UINT16       Signature;                                    
/*0x002*/     UINT16       Count;                                        
/*0x004*/     ULONG32      List[1];                                      
          }CM_KEY_INDEX, *PCM_KEY_INDEX;                                  
                                                                         
          typedef struct _CM_BIG_DATA // 3 elements, 0x8 bytes (sizeof) 
          {                                                             
/*0x000*/     UINT16       Signature;                                   
/*0x002*/     UINT16       Count;                                       
/*0x004*/     ULONG32      List;                                        
          }CM_BIG_DATA, *PCM_BIG_DATA;                                  
                                                                        
          typedef struct _CELL_DATA                    // 1 elements, 0x50 bytes (sizeof)  
          {                                                                                
              union                                    // 7 elements, 0x50 bytes (sizeof)  
              {                                                                            
/*0x000*/         struct _CM_KEY_NODE KeyNode;         // 22 elements, 0x50 bytes (sizeof) 
/*0x000*/         struct _CM_KEY_VALUE KeyValue;       // 8 elements, 0x18 bytes (sizeof)  
/*0x000*/         struct _CM_KEY_SECURITY KeySecurity; // 7 elements, 0x28 bytes (sizeof)  
/*0x000*/         struct _CM_KEY_INDEX KeyIndex;       // 3 elements, 0x8 bytes (sizeof)   
/*0x000*/         struct _CM_BIG_DATA ValueData;       // 3 elements, 0x8 bytes (sizeof)   
/*0x000*/         ULONG32      KeyList[1];                                                 
/*0x000*/         UINT16       KeyString[1];                                               
              }u;                                                                          
          }CELL_DATA, *PCELL_DATA;                                                         
                                                                                           
          typedef struct _CLIENT_ID       // 2 elements, 0x8 bytes (sizeof) 
          {                                                                 
/*0x000*/     VOID*        UniqueProcess;                                   
/*0x004*/     VOID*        UniqueThread;                                    
          }CLIENT_ID, *PCLIENT_ID;                                          
                                                                            
          typedef struct _CM_CACHED_VALUE_INDEX // 2 elements, 0x54 bytes (sizeof) 
          {                                                                        
/*0x000*/     ULONG32      CellIndex;                                              
              union                             // 2 elements, 0x50 bytes (sizeof) 
              {                                                                    
/*0x004*/         struct _CELL_DATA CellData;   // 1 elements, 0x50 bytes (sizeof) 
/*0x004*/         ULONG32      List[1];                                            
              }Data;                                                               
          }CM_CACHED_VALUE_INDEX, *PCM_CACHED_VALUE_INDEX;                                   
                                                                                   
          typedef struct _CM_CELL_REMAP_BLOCK // 2 elements, 0x8 bytes (sizeof) 
          {                                                                     
/*0x000*/     ULONG32      OldCell;                                             
/*0x004*/     ULONG32      NewCell;                                             
          }CM_CELL_REMAP_BLOCK, *PCM_CELL_REMAP_BLOCK;                                  
                                                                                
          typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR // 4 elements, 0x10 bytes (sizeof) 
          {                                                                                 
/*0x000*/     UINT8        Type;                                                            
/*0x001*/     UINT8        ShareDisposition;                                                
/*0x002*/     UINT16       Flags;                                                           
              union                                      // 8 elements, 0xC bytes (sizeof)  
              {                                                                             
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length;                                                  
                  }Generic;                                                                 
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length;                                                  
                  }Port;                                                                    
                  struct                                 // 3 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      Level;                                                   
/*0x008*/             ULONG32      Vector;                                                  
/*0x00C*/             ULONG32      Affinity;                                                
                  }Interrupt;                                                               
                  struct                                 // 2 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)  
/*0x00C*/             ULONG32      Length;                                                  
                  }Memory;                                                                  
                  struct                                 // 3 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      Channel;                                                 
/*0x008*/             ULONG32      Port;                                                    
/*0x00C*/             ULONG32      Reserved1;                                               
                  }Dma;                                                                     
                  struct                                 // 1 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      Data[3];                                                 
                  }DevicePrivate;                                                           
                  struct                                 // 3 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      Start;                                                   
/*0x008*/             ULONG32      Length;                                                  
/*0x00C*/             ULONG32      Reserved;                                                
                  }BusNumber;                                                               
                  struct                                 // 3 elements, 0xC bytes (sizeof)  
                  {                                                                         
/*0x004*/             ULONG32      DataSize;                                                
/*0x008*/             ULONG32      Reserved1;                                               
/*0x00C*/             ULONG32      Reserved2;                                               
                  }DeviceSpecificData;                                                      
              }u;                                                                           
          }CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR;                                   
                                                                                            
          typedef struct _CM_PARTIAL_RESOURCE_LIST                          // 4 elements, 0x18 bytes (sizeof) 
          {                                                                                                    
/*0x000*/     UINT16       Version;                                                                            
/*0x002*/     UINT16       Revision;                                                                           
/*0x004*/     ULONG32      Count;                                                                              
/*0x008*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];                                    
          }CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST;                                               
                                                                                                               
          typedef struct _CM_FULL_RESOURCE_DESCRIPTOR               // 3 elements, 0x20 bytes (sizeof) 
          {                                                                                            
/*0x000*/     enum _INTERFACE_TYPE InterfaceType;                                                      
/*0x004*/     ULONG32      BusNumber;                                                                  
/*0x008*/     struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList; // 4 elements, 0x18 bytes (sizeof) 
          }CM_FULL_RESOURCE_DESCRIPTOR, *PCM_FULL_RESOURCE_DESCRIPTOR;                                   
                                                                                                       
          typedef struct _CM_INDEX_HINT_BLOCK // 2 elements, 0x8 bytes (sizeof) 
          {                                                                     
/*0x000*/     ULONG32      Count;                                               
/*0x004*/     ULONG32      HashKey[1];                                          
          }CM_INDEX_HINT_BLOCK, *PCM_INDEX_HINT_BLOCK;                                  
                                                                                
          typedef struct _CM_KEY_BODY                        // 7 elements, 0x44 bytes (sizeof) 
          {                                                                                     
/*0x000*/     ULONG32      Type;                                                                
/*0x004*/     struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;                                    
/*0x008*/     struct _CM_NOTIFY_BLOCK* NotifyBlock;                                             
/*0x00C*/     VOID*        ProcessID;                                                           
/*0x010*/     ULONG32      Callers;                                                             
/*0x014*/     VOID*        CallerAddress[10];                                                   
/*0x03C*/     struct _LIST_ENTRY KeyBodyList;                // 2 elements, 0x8 bytes (sizeof)  
          }CM_KEY_BODY, *PCM_KEY_BODY;                                                          
                                                                                                
          typedef struct _CM_KEY_HASH        // 4 elements, 0x10 bytes (sizeof) 
          {                                                                     
/*0x000*/     ULONG32      ConvKey;                                             
/*0x004*/     struct _CM_KEY_HASH* NextHash;                                    
/*0x008*/     struct _HHIVE* KeyHive;                                           
/*0x00C*/     ULONG32      KeyCell;                                             
          }CM_KEY_HASH, *PCM_KEY_HASH;                                          
                                                                                
          typedef struct _CM_KEY_CONTROL_BLOCK               // 28 elements, 0x50 bytes (sizeof) 
          {                                                                                      
/*0x000*/     ULONG32      RefCount;                                                             
              struct                                         // 5 elements, 0x4 bytes (sizeof)   
              {                                                                                  
/*0x004*/         ULONG32      ExtFlags : 8;                 // 0 BitPosition                    
/*0x004*/         ULONG32      PrivateAlloc : 1;             // 8 BitPosition                    
/*0x004*/         ULONG32      Delete : 1;                   // 9 BitPosition                    
/*0x004*/         ULONG32      DelayedCloseIndex : 12;       // 10 BitPosition                   
/*0x004*/         ULONG32      TotalLevels : 10;             // 22 BitPosition                   
              };                                                                                 
              union                                          // 2 elements, 0x10 bytes (sizeof)  
              {                                                                                  
/*0x008*/         struct _CM_KEY_HASH KeyHash;               // 4 elements, 0x10 bytes (sizeof)  
                  struct                                     // 4 elements, 0x10 bytes (sizeof)  
                  {                                                                              
/*0x008*/             ULONG32      ConvKey;                                                      
/*0x00C*/             struct _CM_KEY_HASH* NextHash;                                             
/*0x010*/             struct _HHIVE* KeyHive;                                                    
/*0x014*/             ULONG32      KeyCell;                                                      
                  };                                                                             
              };                                                                                 
/*0x018*/     struct _CM_KEY_CONTROL_BLOCK* ParentKcb;                                           
/*0x01C*/     struct _CM_NAME_CONTROL_BLOCK* NameBlock;                                          
/*0x020*/     struct _CM_KEY_SECURITY_CACHE* CachedSecurity;                                     
/*0x024*/     struct _CACHED_CHILD_LIST ValueCache;          // 3 elements, 0x8 bytes (sizeof)   
              union                                          // 3 elements, 0x4 bytes (sizeof)   
              {                                                                                  
/*0x02C*/         struct _CM_INDEX_HINT_BLOCK* IndexHint;                                        
/*0x02C*/         ULONG32      HashKey;                                                          
/*0x02C*/         ULONG32      SubKeyCount;                                                      
              };                                                                                 
              union                                          // 2 elements, 0x8 bytes (sizeof)   
              {                                                                                  
/*0x030*/         struct _LIST_ENTRY KeyBodyListHead;        // 2 elements, 0x8 bytes (sizeof)   
/*0x030*/         struct _LIST_ENTRY FreeListEntry;          // 2 elements, 0x8 bytes (sizeof)   
              };                                                                                 
/*0x038*/     union _LARGE_INTEGER KcbLastWriteTime;         // 4 elements, 0x8 bytes (sizeof)   
/*0x040*/     UINT16       KcbMaxNameLen;                                                        
/*0x042*/     UINT16       KcbMaxValueNameLen;                                                   
/*0x044*/     ULONG32      KcbMaxValueDataLen;                                                   
              struct                                         // 4 elements, 0x4 bytes (sizeof)   
              {                                                                                  
/*0x048*/         ULONG32      KcbUserFlags : 4;             // 0 BitPosition                    
/*0x048*/         ULONG32      KcbVirtControlFlags : 4;      // 4 BitPosition                    
/*0x048*/         ULONG32      KcbDebug : 8;                 // 8 BitPosition                    
/*0x048*/         ULONG32      Flags : 16;                   // 16 BitPosition                   
              };                                                                                 
          }CM_KEY_CONTROL_BLOCK, *PCM_KEY_CONTROL_BLOCK;                                         
                                                                                                 
          typedef struct _CM_KEY_SECURITY_CACHE                // 5 elements, 0x28 bytes (sizeof) 
          {                                                                                       
/*0x000*/     ULONG32      Cell;                                                                  
/*0x004*/     ULONG32      ConvKey;                                                               
/*0x008*/     struct _LIST_ENTRY List;                         // 2 elements, 0x8 bytes (sizeof)  
/*0x010*/     ULONG32      DescriptorLength;                                                      
/*0x014*/     struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor; // 7 elements, 0x14 bytes (sizeof) 
          }CM_KEY_SECURITY_CACHE, *PCM_KEY_SECURITY_CACHE;                                        
                                                                                                  
          typedef struct _CM_KEY_SECURITY_CACHE_ENTRY        // 2 elements, 0x8 bytes (sizeof) 
          {                                                                                    
/*0x000*/     ULONG32      Cell;                                                               
/*0x004*/     struct _CM_KEY_SECURITY_CACHE* CachedSecurity;                                   
          }CM_KEY_SECURITY_CACHE_ENTRY, *PCM_KEY_SECURITY_CACHE_ENTRY;                                  
                                                                                               
          typedef struct _CM_NAME_HASH        // 4 elements, 0xC bytes (sizeof) 
          {                                                                     
/*0x000*/     ULONG32      ConvKey;                                             
/*0x004*/     struct _CM_NAME_HASH* NextHash;                                   
/*0x008*/     UINT16       NameLength;                                          
/*0x00A*/     UINT16       Name[1];                                             
          }CM_NAME_HASH, *PCM_NAME_HASH;                                        
                                                                                
          typedef struct _CM_NAME_CONTROL_BLOCK      // 7 elements, 0x10 bytes (sizeof) 
          {                                                                             
/*0x000*/     UINT8        Compressed;                                                  
/*0x001*/     UINT8        _PADDING0_[0x1];                                             
/*0x002*/     UINT16       RefCount;                                                    
              union                                  // 2 elements, 0xC bytes (sizeof)  
              {                                                                         
/*0x004*/         struct _CM_NAME_HASH NameHash;     // 4 elements, 0xC bytes (sizeof)  
                  struct                             // 4 elements, 0xC bytes (sizeof)  
                  {                                                                     
/*0x004*/             ULONG32      ConvKey;                                             
/*0x008*/             struct _CM_KEY_HASH* NextHash;                                    
/*0x00C*/             UINT16       NameLength;                                          
/*0x00E*/             UINT16       Name[1];                                             
                  };                                                                    
              };                                                                        
          }CM_NAME_CONTROL_BLOCK, *PCM_NAME_CONTROL_BLOCK;                                   
                                                                                        
          typedef struct _CM_NOTIFY_BLOCK                      // 8 elements, 0x2C bytes (sizeof) 
          {                                                                                       
/*0x000*/     struct _LIST_ENTRY HiveList;                     // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _LIST_ENTRY PostList;                     // 2 elements, 0x8 bytes (sizeof)  
/*0x010*/     struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;                                      
/*0x014*/     struct _CM_KEY_BODY* KeyBody;                                                       
              struct                                           // 3 elements, 0x4 bytes (sizeof)  
              {                                                                                   
/*0x018*/         ULONG32      Filter : 30;                    // 0 BitPosition                   
/*0x018*/         ULONG32      WatchTree : 1;                  // 30 BitPosition                  
/*0x018*/         ULONG32      NotifyPending : 1;              // 31 BitPosition                  
              };                                                                                  
/*0x01C*/     struct _SECURITY_SUBJECT_CONTEXT SubjectContext; // 4 elements, 0x10 bytes (sizeof) 
          }CM_NOTIFY_BLOCK, *PCM_NOTIFY_BLOCK;                                                    
                                                                                                  
          typedef struct _CM_RESOURCE_LIST                 // 2 elements, 0x24 bytes (sizeof) 
          {                                                                                   
/*0x000*/     ULONG32      Count;                                                             
/*0x004*/     struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];                                    
          }CM_RESOURCE_LIST, *PCM_RESOURCE_LIST;                                              
                                                                                              
          typedef struct _CM_VIEW_OF_FILE     // 7 elements, 0x24 bytes (sizeof) 
          {                                                                      
/*0x000*/     struct _LIST_ENTRY LRUViewList; // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _LIST_ENTRY PinViewList; // 2 elements, 0x8 bytes (sizeof)  
/*0x010*/     ULONG32      FileOffset;                                           
/*0x014*/     ULONG32      Size;                                                 
/*0x018*/     ULONG32*     ViewAddress;                                          
/*0x01C*/     VOID*        Bcb;                                                  
/*0x020*/     ULONG32      UseCount;                                             
          }CM_VIEW_OF_FILE, *PCM_VIEW_OF_FILE;                                   
                                                                                 
          typedef struct _RTL_BITMAP     // 2 elements, 0x8 bytes (sizeof) 
          {                                                                
/*0x000*/     ULONG32      SizeOfBitMap;                                   
/*0x004*/     ULONG32*     Buffer;                                         
          }RTL_BITMAP, *PRTL_BITMAP;                                       
                                                                           
          typedef struct _DUAL                    // 7 elements, 0xDC bytes (sizeof) 
          {                                                                          
/*0x000*/     ULONG32      Length;                                                   
/*0x004*/     struct _HMAP_DIRECTORY* Map;                                           
/*0x008*/     struct _HMAP_TABLE* SmallDir;                                          
/*0x00C*/     ULONG32      Guard;                                                    
/*0x010*/     struct _RTL_BITMAP FreeDisplay[24];                                    
/*0x0D0*/     ULONG32      FreeSummary;                                              
/*0x0D4*/     struct _LIST_ENTRY FreeBins;        // 2 elements, 0x8 bytes (sizeof)  
          }DUAL, *PDUAL;                                                             
                                                                                     
          typedef struct _HHIVE                                       // 24 elements, 0x210 bytes (sizeof) 
          {                                                                                                
/*0x000*/     ULONG32      Signature;                                                                      
/*0x004*/     FUNCT_0F22_0F21_GetCellRoutine* GetCellRoutine;                                              
/*0x008*/     FUNCT_00BC_0F6F_ReleaseCellRoutine* ReleaseCellRoutine;                                      
/*0x00C*/     FUNCT_00BB_0F71_Allocate* Allocate;                                                          
/*0x010*/     FUNCT_00BC_0F76_Free* Free;                                                                  
/*0x014*/     FUNCT_003D_0F7A_FileSetSize* FileSetSize;                                                    
/*0x018*/     FUNCT_003D_0F80_FileWrite* FileWrite;                                                        
/*0x01C*/     FUNCT_003D_0F8C_FileRead* FileRead;                                                          
/*0x020*/     FUNCT_003D_0F93_FileFlush* FileFlush;                                                        
/*0x024*/     struct _HBASE_BLOCK* BaseBlock;                                                              
/*0x028*/     struct _RTL_BITMAP DirtyVector;                         // 2 elements, 0x8 bytes (sizeof)    
/*0x030*/     ULONG32      DirtyCount;                                                                     
/*0x034*/     ULONG32      DirtyAlloc;                                                                     
/*0x038*/     UINT8        RealWrites;                                                                     
/*0x039*/     UINT8        _PADDING0_[0x3];                                                                
/*0x03C*/     ULONG32      Cluster;                                                                        
/*0x040*/     UINT8        Flat;                                                                           
/*0x041*/     UINT8        ReadOnly;                                                                       
/*0x042*/     UINT8        Log;                                                                            
/*0x043*/     UINT8        _PADDING1_[0x1];                                                                
/*0x044*/     ULONG32      HiveFlags;                                                                      
/*0x048*/     ULONG32      LogSize;                                                                        
/*0x04C*/     ULONG32      RefreshCount;                                                                   
/*0x050*/     ULONG32      StorageTypeCount;                                                               
/*0x054*/     ULONG32      Version;                                                                        
/*0x058*/     struct _DUAL Storage[2];                                                                     
          }HHIVE, *PHHIVE;                                                                                 
                                                                                                           
          typedef struct _CMHIVE                                  // 28 elements, 0x49C bytes (sizeof) 
          {                                                                                            
/*0x000*/     struct _HHIVE Hive;                                 // 24 elements, 0x210 bytes (sizeof) 
/*0x210*/     VOID*        FileHandles[3];                                                             
/*0x21C*/     struct _LIST_ENTRY NotifyList;                      // 2 elements, 0x8 bytes (sizeof)    
/*0x224*/     struct _LIST_ENTRY HiveList;                        // 2 elements, 0x8 bytes (sizeof)    
/*0x22C*/     struct _FAST_MUTEX* HiveLock;                                                            
/*0x230*/     struct _FAST_MUTEX* ViewLock;                                                            
/*0x234*/     struct _LIST_ENTRY LRUViewListHead;                 // 2 elements, 0x8 bytes (sizeof)    
/*0x23C*/     struct _LIST_ENTRY PinViewListHead;                 // 2 elements, 0x8 bytes (sizeof)    
/*0x244*/     struct _FILE_OBJECT* FileObject;                                                         
/*0x248*/     struct _UNICODE_STRING FileFullPath;                // 3 elements, 0x8 bytes (sizeof)    
/*0x250*/     struct _UNICODE_STRING FileUserName;                // 3 elements, 0x8 bytes (sizeof)    
/*0x258*/     UINT16       MappedViews;                                                                
/*0x25A*/     UINT16       PinnedViews;                                                                
/*0x25C*/     ULONG32      UseCount;                                                                   
/*0x260*/     ULONG32      SecurityCount;                                                              
/*0x264*/     ULONG32      SecurityCacheSize;                                                          
/*0x268*/     LONG32       SecurityHitHint;                                                            
/*0x26C*/     struct _CM_KEY_SECURITY_CACHE_ENTRY* SecurityCache;                                      
/*0x270*/     struct _LIST_ENTRY SecurityHash[64];                                                     
/*0x470*/     struct _KEVENT* UnloadEvent;                                                             
/*0x474*/     struct _CM_KEY_CONTROL_BLOCK* RootKcb;                                                   
/*0x478*/     UINT8        Frozen;                                                                     
/*0x479*/     UINT8        _PADDING0_[0x3];                                                            
/*0x47C*/     struct _WORK_QUEUE_ITEM* UnloadWorkItem;                                                 
/*0x480*/     UINT8        GrowOnlyMode;                                                               
/*0x481*/     UINT8        _PADDING1_[0x3];                                                            
/*0x484*/     ULONG32      GrowOffset;                                                                 
/*0x488*/     struct _LIST_ENTRY KcbConvertListHead;              // 2 elements, 0x8 bytes (sizeof)    
/*0x490*/     struct _LIST_ENTRY KnodeConvertListHead;            // 2 elements, 0x8 bytes (sizeof)    
/*0x498*/     struct _CM_CELL_REMAP_BLOCK* CellRemapArray;                                             
          }CMHIVE, *PCMHIVE;                                                                           
                                                                                                       
          typedef struct _CMP_OFFSET_ARRAY // 3 elements, 0xC bytes (sizeof) 
          {                                                                  
/*0x000*/     ULONG32      FileOffset;                                       
/*0x004*/     VOID*        DataBuffer;                                       
/*0x008*/     ULONG32      DataLength;                                       
          }CMP_OFFSET_ARRAY, *PCMP_OFFSET_ARRAY;                                  
                                                                             
          typedef struct _COMPRESSED_DATA_INFO         // 7 elements, 0xC bytes (sizeof) 
          {                                                                              
/*0x000*/     UINT16       CompressionFormatAndEngine;                                   
/*0x002*/     UINT8        CompressionUnitShift;                                         
/*0x003*/     UINT8        ChunkShift;                                                   
/*0x004*/     UINT8        ClusterShift;                                                 
/*0x005*/     UINT8        Reserved;                                                     
/*0x006*/     UINT16       NumberOfChunks;                                               
/*0x008*/     ULONG32      CompressedChunkSizes[1];                                      
          }COMPRESSED_DATA_INFO, *PCOMPRESSED_DATA_INFO;                                  
                                                                                         
          typedef struct _FLOATING_SAVE_AREA // 9 elements, 0x70 bytes (sizeof) 
          {                                                                     
/*0x000*/     ULONG32      ControlWord;                                         
/*0x004*/     ULONG32      StatusWord;                                          
/*0x008*/     ULONG32      TagWord;                                             
/*0x00C*/     ULONG32      ErrorOffset;                                         
/*0x010*/     ULONG32      ErrorSelector;                                       
/*0x014*/     ULONG32      DataOffset;                                          
/*0x018*/     ULONG32      DataSelector;                                        
/*0x01C*/     UINT8        RegisterArea[80];                                    
/*0x06C*/     ULONG32      Cr0NpxState;                                         
          }FLOATING_SAVE_AREA, *PFLOATING_SAVE_AREA;                                   
                                                                                
          typedef struct _CONTEXT                   // 25 elements, 0x2CC bytes (sizeof) 
          {                                                                              
/*0x000*/     ULONG32      ContextFlags;                                                 
/*0x004*/     ULONG32      Dr0;                                                          
/*0x008*/     ULONG32      Dr1;                                                          
/*0x00C*/     ULONG32      Dr2;                                                          
/*0x010*/     ULONG32      Dr3;                                                          
/*0x014*/     ULONG32      Dr6;                                                          
/*0x018*/     ULONG32      Dr7;                                                          
/*0x01C*/     struct _FLOATING_SAVE_AREA FloatSave; // 9 elements, 0x70 bytes (sizeof)   
/*0x08C*/     ULONG32      SegGs;                                                        
/*0x090*/     ULONG32      SegFs;                                                        
/*0x094*/     ULONG32      SegEs;                                                        
/*0x098*/     ULONG32      SegDs;                                                        
/*0x09C*/     ULONG32      Edi;                                                          
/*0x0A0*/     ULONG32      Esi;                                                          
/*0x0A4*/     ULONG32      Ebx;                                                          
/*0x0A8*/     ULONG32      Edx;                                                          
/*0x0AC*/     ULONG32      Ecx;                                                          
/*0x0B0*/     ULONG32      Eax;                                                          
/*0x0B4*/     ULONG32      Ebp;                                                          
/*0x0B8*/     ULONG32      Eip;                                                          
/*0x0BC*/     ULONG32      SegCs;                                                        
/*0x0C0*/     ULONG32      EFlags;                                                       
/*0x0C4*/     ULONG32      Esp;                                                          
/*0x0C8*/     ULONG32      SegSs;                                                        
/*0x0CC*/     UINT8        ExtendedRegisters[512];                                       
          }CONTEXT, *PCONTEXT;                                                           
                                                                                         
          typedef struct _MMSECTION_FLAGS                // 31 elements, 0x4 bytes (sizeof) 
          {                                                                                 
/*0x000*/     UINT32       BeingDeleted : 1;             // 0 BitPosition                   
/*0x000*/     UINT32       BeingCreated : 1;             // 1 BitPosition                   
/*0x000*/     UINT32       BeingPurged : 1;              // 2 BitPosition                   
/*0x000*/     UINT32       NoModifiedWriting : 1;        // 3 BitPosition                   
/*0x000*/     UINT32       FailAllIo : 1;                // 4 BitPosition                   
/*0x000*/     UINT32       Image : 1;                    // 5 BitPosition                   
/*0x000*/     UINT32       Based : 1;                    // 6 BitPosition                   
/*0x000*/     UINT32       File : 1;                     // 7 BitPosition                   
/*0x000*/     UINT32       Networked : 1;                // 8 BitPosition                   
/*0x000*/     UINT32       NoCache : 1;                  // 9 BitPosition                   
/*0x000*/     UINT32       PhysicalMemory : 1;           // 10 BitPosition                  
/*0x000*/     UINT32       CopyOnWrite : 1;              // 11 BitPosition                  
/*0x000*/     UINT32       Reserve : 1;                  // 12 BitPosition                  
/*0x000*/     UINT32       Commit : 1;                   // 13 BitPosition                  
/*0x000*/     UINT32       FloppyMedia : 1;              // 14 BitPosition                  
/*0x000*/     UINT32       WasPurged : 1;                // 15 BitPosition                  
/*0x000*/     UINT32       UserReference : 1;            // 16 BitPosition                  
/*0x000*/     UINT32       GlobalMemory : 1;             // 17 BitPosition                  
/*0x000*/     UINT32       DeleteOnClose : 1;            // 18 BitPosition                  
/*0x000*/     UINT32       FilePointerNull : 1;          // 19 BitPosition                  
/*0x000*/     UINT32       DebugSymbolsLoaded : 1;       // 20 BitPosition                  
/*0x000*/     UINT32       SetMappedFileIoComplete : 1;  // 21 BitPosition                  
/*0x000*/     UINT32       CollidedFlush : 1;            // 22 BitPosition                  
/*0x000*/     UINT32       NoChange : 1;                 // 23 BitPosition                  
/*0x000*/     UINT32       HadUserReference : 1;         // 24 BitPosition                  
/*0x000*/     UINT32       ImageMappedInSystemSpace : 1; // 25 BitPosition                  
/*0x000*/     UINT32       UserWritable : 1;             // 26 BitPosition                  
/*0x000*/     UINT32       Accessed : 1;                 // 27 BitPosition                  
/*0x000*/     UINT32       GlobalOnlyPerSession : 1;     // 28 BitPosition                  
/*0x000*/     UINT32       Rom : 1;                      // 29 BitPosition                  
/*0x000*/     UINT32       filler : 2;                   // 30 BitPosition                  
          }MMSECTION_FLAGS, *PMMSECTION_FLAGS;                                              
                                                                                            
          typedef struct _CONTROL_AREA                   // 13 elements, 0x30 bytes (sizeof) 
          {                                                                                  
/*0x000*/     struct _SEGMENT* Segment;                                                      
/*0x004*/     struct _LIST_ENTRY DereferenceList;        // 2 elements, 0x8 bytes (sizeof)   
/*0x00C*/     ULONG32      NumberOfSectionReferences;                                        
/*0x010*/     ULONG32      NumberOfPfnReferences;                                            
/*0x014*/     ULONG32      NumberOfMappedViews;                                              
/*0x018*/     UINT16       NumberOfSubsections;                                              
/*0x01A*/     UINT16       FlushInProgressCount;                                             
/*0x01C*/     ULONG32      NumberOfUserReferences;                                           
              union                                      // 2 elements, 0x4 bytes (sizeof)   
              {                                                                              
/*0x020*/         ULONG32      LongFlags;                                                    
/*0x020*/         struct _MMSECTION_FLAGS Flags;         // 31 elements, 0x4 bytes (sizeof)  
              }u;                                                                            
/*0x024*/     struct _FILE_OBJECT* FilePointer;                                              
/*0x028*/     struct _EVENT_COUNTER* WaitingForDeletion;                                     
/*0x02C*/     UINT16       ModifiedWriteCount;                                               
/*0x02E*/     UINT16       NumberOfSystemCacheViews;                                         
          }CONTROL_AREA, *PCONTROL_AREA;                                                     
                                                                                             
          typedef struct _CURDIR              // 2 elements, 0xC bytes (sizeof) 
          {                                                                     
/*0x000*/     struct _UNICODE_STRING DosPath; // 3 elements, 0x8 bytes (sizeof) 
/*0x008*/     VOID*        Handle;                                              
          }CURDIR, *PCURDIR;                                                    
                                                                                
          typedef struct _X86_DBGKD_CONTROL_SET // 4 elements, 0x10 bytes (sizeof) 
          {                                                                        
/*0x000*/     ULONG32      TraceFlag;                                              
/*0x004*/     ULONG32      Dr7;                                                    
/*0x008*/     ULONG32      CurrentSymbolStart;                                     
/*0x00C*/     ULONG32      CurrentSymbolEnd;                                       
          }X86_DBGKD_CONTROL_SET, *PX86_DBGKD_CONTROL_SET;                                   
                                                                                   
          typedef struct _IA64_DBGKD_CONTROL_SET // 3 elements, 0x14 bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      Continue;                                                
/*0x004*/     UINT64       CurrentSymbolStart;                                      
/*0x00C*/     UINT64       CurrentSymbolEnd;                                        
          }IA64_DBGKD_CONTROL_SET, *PIA64_DBGKD_CONTROL_SET;                                   
                                                                                    
          typedef struct _DBGKD_ANY_CONTROL_SET                    // 4 elements, 0x1C bytes (sizeof) 
          {                                                                                           
              union                                                // 4 elements, 0x1C bytes (sizeof) 
              {                                                                                       
/*0x000*/         struct _X86_DBGKD_CONTROL_SET X86ControlSet;     // 4 elements, 0x10 bytes (sizeof) 
/*0x000*/         ULONG32      AlphaControlSet;                                                       
/*0x000*/         struct _IA64_DBGKD_CONTROL_SET IA64ControlSet;   // 3 elements, 0x14 bytes (sizeof) 
/*0x000*/         struct _AMD64_DBGKD_CONTROL_SET Amd64ControlSet; // 4 elements, 0x1C bytes (sizeof) 
              };                                                                                      
          }DBGKD_ANY_CONTROL_SET, *PDBGKD_ANY_CONTROL_SET;                                            
                                                                                                      
          typedef struct _DBGKD_BREAKPOINTEX // 2 elements, 0x8 bytes (sizeof) 
          {                                                                    
/*0x000*/     ULONG32      BreakPointCount;                                    
/*0x004*/     LONG32       ContinueStatus;                                     
          }DBGKD_BREAKPOINTEX, *PDBGKD_BREAKPOINTEX;                                  
                                                                               
          typedef struct _DBGKD_CONTINUE   // 1 elements, 0x4 bytes (sizeof) 
          {                                                                  
/*0x000*/     LONG32       ContinueStatus;                                   
          }DBGKD_CONTINUE, *PDBGKD_CONTINUE;                                  
                                                                             
          typedef struct _DBGKD_CONTINUE2                      // 3 elements, 0x20 bytes (sizeof) 
          {                                                                                       
/*0x000*/     LONG32       ContinueStatus;                                                        
              union                                            // 2 elements, 0x1C bytes (sizeof) 
              {                                                                                   
/*0x004*/         struct _X86_DBGKD_CONTROL_SET ControlSet;    // 4 elements, 0x10 bytes (sizeof) 
/*0x004*/         struct _DBGKD_ANY_CONTROL_SET AnyControlSet; // 4 elements, 0x1C bytes (sizeof) 
              };                                                                                  
          }DBGKD_CONTINUE2, *PDBGKD_CONTINUE2;                                                    
                                                                                                  
          typedef struct _DBGKD_FILL_MEMORY // 4 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     UINT64       Address;                                            
/*0x008*/     ULONG32      Length;                                             
/*0x00C*/     UINT16       Flags;                                              
/*0x00E*/     UINT16       PatternLength;                                      
          }DBGKD_FILL_MEMORY, *PDBGKD_FILL_MEMORY;                                   
                                                                               
          typedef struct _DBGKD_GET_CONTEXT // 1 elements, 0x4 bytes (sizeof) 
          {                                                                   
/*0x000*/     ULONG32      Unused;                                            
          }DBGKD_GET_CONTEXT, *PDBGKD_GET_CONTEXT;                                  
                                                                              
          typedef struct _DBGKD_GET_INTERNAL_BREAKPOINT32 // 7 elements, 0x1C bytes (sizeof) 
          {                                                                                  
/*0x000*/     ULONG32      BreakpointAddress;                                                
/*0x004*/     ULONG32      Flags;                                                            
/*0x008*/     ULONG32      Calls;                                                            
/*0x00C*/     ULONG32      MaxCallsPerPeriod;                                                
/*0x010*/     ULONG32      MinInstructions;                                                  
/*0x014*/     ULONG32      MaxInstructions;                                                  
/*0x018*/     ULONG32      TotalInstructions;                                                
          }DBGKD_GET_INTERNAL_BREAKPOINT32, *PDBGKD_GET_INTERNAL_BREAKPOINT32;                                   
                                                                                             
          typedef struct _DBGKD_GET_INTERNAL_BREAKPOINT64 // 7 elements, 0x20 bytes (sizeof) 
          {                                                                                  
/*0x000*/     UINT64       BreakpointAddress;                                                
/*0x008*/     ULONG32      Flags;                                                            
/*0x00C*/     ULONG32      Calls;                                                            
/*0x010*/     ULONG32      MaxCallsPerPeriod;                                                
/*0x014*/     ULONG32      MinInstructions;                                                  
/*0x018*/     ULONG32      MaxInstructions;                                                  
/*0x01C*/     ULONG32      TotalInstructions;                                                
          }DBGKD_GET_INTERNAL_BREAKPOINT64, *PDBGKD_GET_INTERNAL_BREAKPOINT64;                                   
                                                                                             
          typedef struct _DBGKD_GET_SET_BUS_DATA // 5 elements, 0x14 bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      BusDataType;                                             
/*0x004*/     ULONG32      BusNumber;                                               
/*0x008*/     ULONG32      SlotNumber;                                              
/*0x00C*/     ULONG32      Offset;                                                  
/*0x010*/     ULONG32      Length;                                                  
          }DBGKD_GET_SET_BUS_DATA, *PDBGKD_GET_SET_BUS_DATA;                                   
                                                                                    
          typedef struct _DBGKD_GET_VERSION32        // 14 elements, 0x28 bytes (sizeof) 
          {                                                                              
/*0x000*/     UINT16       MajorVersion;                                                 
/*0x002*/     UINT16       MinorVersion;                                                 
/*0x004*/     UINT16       ProtocolVersion;                                              
/*0x006*/     UINT16       Flags;                                                        
/*0x008*/     ULONG32      KernBase;                                                     
/*0x00C*/     ULONG32      PsLoadedModuleList;                                           
/*0x010*/     UINT16       MachineType;                                                  
/*0x012*/     UINT16       ThCallbackStack;                                              
/*0x014*/     UINT16       NextCallback;                                                 
/*0x016*/     UINT16       FramePointer;                                                 
/*0x018*/     ULONG32      KiCallUserMode;                                               
/*0x01C*/     ULONG32      KeUserCallbackDispatcher;                                     
/*0x020*/     ULONG32      BreakpointWithStatus;                                         
/*0x024*/     ULONG32      DebuggerDataList;                                             
          }DBGKD_GET_VERSION32, *PDBGKD_GET_VERSION32;                                    
                                                                                         
          typedef struct _DBGKD_GET_VERSION64  // 13 elements, 0x28 bytes (sizeof) 
          {                                                                        
/*0x000*/     UINT16       MajorVersion;                                           
/*0x002*/     UINT16       MinorVersion;                                           
/*0x004*/     UINT16       ProtocolVersion;                                        
/*0x006*/     UINT16       Flags;                                                  
/*0x008*/     UINT16       MachineType;                                            
/*0x00A*/     UINT8        MaxPacketType;                                          
/*0x00B*/     UINT8        MaxStateChange;                                         
/*0x00C*/     UINT8        MaxManipulate;                                          
/*0x00D*/     UINT8        Simulation;                                             
/*0x00E*/     UINT16       Unused[1];                                              
/*0x010*/     UINT64       KernBase;                                               
/*0x018*/     UINT64       PsLoadedModuleList;                                     
/*0x020*/     UINT64       DebuggerDataList;                                       
          }DBGKD_GET_VERSION64, *PDBGKD_GET_VERSION64;                                    
                                                                                   
          typedef struct _DBGKD_LOAD_SYMBOLS32 // 6 elements, 0x18 bytes (sizeof) 
          {                                                                       
/*0x000*/     ULONG32      PathNameLength;                                        
/*0x004*/     ULONG32      BaseOfDll;                                             
/*0x008*/     ULONG32      ProcessId;                                             
/*0x00C*/     ULONG32      CheckSum;                                              
/*0x010*/     ULONG32      SizeOfImage;                                           
/*0x014*/     UINT8        UnloadSymbols;                                         
/*0x015*/     UINT8        _PADDING0_[0x3];                                       
          }DBGKD_LOAD_SYMBOLS32, *PDBGKD_LOAD_SYMBOLS32;                                   
                                                                                  
          typedef struct _DBGKD_LOAD_SYMBOLS64 // 6 elements, 0x28 bytes (sizeof) 
          {                                                                       
/*0x000*/     ULONG32      PathNameLength;                                        
/*0x004*/     UINT8        _PADDING0_[0x4];                                       
/*0x008*/     UINT64       BaseOfDll;                                             
/*0x010*/     UINT64       ProcessId;                                             
/*0x018*/     ULONG32      CheckSum;                                              
/*0x01C*/     ULONG32      SizeOfImage;                                           
/*0x020*/     UINT8        UnloadSymbols;                                         
/*0x021*/     UINT8        _PADDING1_[0x7];                                       
          }DBGKD_LOAD_SYMBOLS64, *PDBGKD_LOAD_SYMBOLS64;                                   
                                                                                  
          typedef struct _DBGKD_READ_MEMORY32 // 3 elements, 0xC bytes (sizeof) 
          {                                                                     
/*0x000*/     ULONG32      TargetBaseAddress;                                   
/*0x004*/     ULONG32      TransferCount;                                       
/*0x008*/     ULONG32      ActualBytesRead;                                     
          }DBGKD_READ_MEMORY32, *PDBGKD_READ_MEMORY32;                                  
                                                                                
          typedef struct _DBGKD_WRITE_MEMORY32 // 3 elements, 0xC bytes (sizeof) 
          {                                                                      
/*0x000*/     ULONG32      TargetBaseAddress;                                    
/*0x004*/     ULONG32      TransferCount;                                        
/*0x008*/     ULONG32      ActualBytesWritten;                                   
          }DBGKD_WRITE_MEMORY32, *PDBGKD_WRITE_MEMORY32;                                  
                                                                                 
          typedef struct _DBGKD_READ_MEMORY64 // 3 elements, 0x10 bytes (sizeof) 
          {                                                                      
/*0x000*/     UINT64       TargetBaseAddress;                                    
/*0x008*/     ULONG32      TransferCount;                                        
/*0x00C*/     ULONG32      ActualBytesRead;                                      
          }DBGKD_READ_MEMORY64, *PDBGKD_READ_MEMORY64;                                   
                                                                                 
          typedef struct _DBGKD_WRITE_MEMORY64 // 3 elements, 0x10 bytes (sizeof) 
          {                                                                       
/*0x000*/     UINT64       TargetBaseAddress;                                     
/*0x008*/     ULONG32      TransferCount;                                         
/*0x00C*/     ULONG32      ActualBytesWritten;                                    
          }DBGKD_WRITE_MEMORY64, *PDBGKD_WRITE_MEMORY64;                                   
                                                                                  
          typedef struct _DBGKD_SET_CONTEXT // 1 elements, 0x4 bytes (sizeof) 
          {                                                                   
/*0x000*/     ULONG32      ContextFlags;                                      
          }DBGKD_SET_CONTEXT, *PDBGKD_SET_CONTEXT;                                  
                                                                              
          typedef struct _DBGKD_WRITE_BREAKPOINT32 // 2 elements, 0x8 bytes (sizeof) 
          {                                                                          
/*0x000*/     ULONG32      BreakPointAddress;                                        
/*0x004*/     ULONG32      BreakPointHandle;                                         
          }DBGKD_WRITE_BREAKPOINT32, *PDBGKD_WRITE_BREAKPOINT32;                                  
                                                                                     
          typedef struct _DBGKD_RESTORE_BREAKPOINT // 1 elements, 0x4 bytes (sizeof) 
          {                                                                          
/*0x000*/     ULONG32      BreakPointHandle;                                         
          }DBGKD_RESTORE_BREAKPOINT, *PDBGKD_RESTORE_BREAKPOINT;                                  
                                                                                     
          typedef struct _DBGKD_READ_WRITE_IO32 // 3 elements, 0xC bytes (sizeof) 
          {                                                                       
/*0x000*/     ULONG32      DataSize;                                              
/*0x004*/     ULONG32      IoAddress;                                             
/*0x008*/     ULONG32      DataValue;                                             
          }DBGKD_READ_WRITE_IO32, *PDBGKD_READ_WRITE_IO32;                                  
                                                                                  
          typedef struct _DBGKD_READ_WRITE_IO_EXTENDED32 // 6 elements, 0x18 bytes (sizeof) 
          {                                                                                 
/*0x000*/     ULONG32      DataSize;                                                        
/*0x004*/     ULONG32      InterfaceType;                                                   
/*0x008*/     ULONG32      BusNumber;                                                       
/*0x00C*/     ULONG32      AddressSpace;                                                    
/*0x010*/     ULONG32      IoAddress;                                                       
/*0x014*/     ULONG32      DataValue;                                                       
          }DBGKD_READ_WRITE_IO_EXTENDED32, *PDBGKD_READ_WRITE_IO_EXTENDED32;                                   
                                                                                            
          typedef struct _DBGKD_QUERY_SPECIAL_CALLS // 1 elements, 0x4 bytes (sizeof) 
          {                                                                           
/*0x000*/     ULONG32      NumberOfSpecialCalls;                                      
          }DBGKD_QUERY_SPECIAL_CALLS, *PDBGKD_QUERY_SPECIAL_CALLS;                                  
                                                                                      
          typedef struct _DBGKD_SET_SPECIAL_CALL32 // 1 elements, 0x4 bytes (sizeof) 
          {                                                                          
/*0x000*/     ULONG32      SpecialCall;                                              
          }DBGKD_SET_SPECIAL_CALL32, *PDBGKD_SET_SPECIAL_CALL32;                                  
                                                                                     
          typedef struct _DBGKD_SET_INTERNAL_BREAKPOINT32 // 2 elements, 0x8 bytes (sizeof) 
          {                                                                                 
/*0x000*/     ULONG32      BreakpointAddress;                                               
/*0x004*/     ULONG32      Flags;                                                           
          }DBGKD_SET_INTERNAL_BREAKPOINT32, *PDBGKD_SET_INTERNAL_BREAKPOINT32;                                  
                                                                                            
          typedef struct _DBGKD_READ_WRITE_MSR // 3 elements, 0xC bytes (sizeof) 
          {                                                                      
/*0x000*/     ULONG32      Msr;                                                  
/*0x004*/     ULONG32      DataValueLow;                                         
/*0x008*/     ULONG32      DataValueHigh;                                        
          }DBGKD_READ_WRITE_MSR, *PDBGKD_READ_WRITE_MSR;                                  
                                                                                 
          typedef struct _DBGKD_SEARCH_MEMORY // 4 elements, 0x18 bytes (sizeof) 
          {                                                                      
              union                           // 2 elements, 0x8 bytes (sizeof)  
              {                                                                  
/*0x000*/         UINT64       SearchAddress;                                    
/*0x000*/         UINT64       FoundAddress;                                     
              };                                                                 
/*0x008*/     UINT64       SearchLength;                                         
/*0x010*/     ULONG32      PatternLength;                                        
/*0x014*/     UINT8        _PADDING0_[0x4];                                      
          }DBGKD_SEARCH_MEMORY, *PDBGKD_SEARCH_MEMORY;                                   
                                                                                 
          typedef struct _DBGKD_MANIPULATE_STATE32                               // 5 elements, 0x34 bytes (sizeof)  
          {                                                                                                          
/*0x000*/     ULONG32      ApiNumber;                                                                                
/*0x004*/     UINT16       ProcessorLevel;                                                                           
/*0x006*/     UINT16       Processor;                                                                                
/*0x008*/     LONG32       ReturnStatus;                                                                             
              union                                                              // 20 elements, 0x28 bytes (sizeof) 
              {                                                                                                      
/*0x00C*/         struct _DBGKD_READ_MEMORY32 ReadMemory;                        // 3 elements, 0xC bytes (sizeof)   
/*0x00C*/         struct _DBGKD_WRITE_MEMORY32 WriteMemory;                      // 3 elements, 0xC bytes (sizeof)   
/*0x00C*/         struct _DBGKD_READ_MEMORY64 ReadMemory64;                      // 3 elements, 0x10 bytes (sizeof)  
/*0x00C*/         struct _DBGKD_WRITE_MEMORY64 WriteMemory64;                    // 3 elements, 0x10 bytes (sizeof)  
/*0x00C*/         struct _DBGKD_GET_CONTEXT GetContext;                          // 1 elements, 0x4 bytes (sizeof)   
/*0x00C*/         struct _DBGKD_SET_CONTEXT SetContext;                          // 1 elements, 0x4 bytes (sizeof)   
/*0x00C*/         struct _DBGKD_WRITE_BREAKPOINT32 WriteBreakPoint;              // 2 elements, 0x8 bytes (sizeof)   
/*0x00C*/         struct _DBGKD_RESTORE_BREAKPOINT RestoreBreakPoint;            // 1 elements, 0x4 bytes (sizeof)   
/*0x00C*/         struct _DBGKD_CONTINUE Continue;                               // 1 elements, 0x4 bytes (sizeof)   
/*0x00C*/         struct _DBGKD_CONTINUE2 Continue2;                             // 3 elements, 0x20 bytes (sizeof)  
/*0x00C*/         struct _DBGKD_READ_WRITE_IO32 ReadWriteIo;                     // 3 elements, 0xC bytes (sizeof)   
/*0x00C*/         struct _DBGKD_READ_WRITE_IO_EXTENDED32 ReadWriteIoExtended;    // 6 elements, 0x18 bytes (sizeof)  
/*0x00C*/         struct _DBGKD_QUERY_SPECIAL_CALLS QuerySpecialCalls;           // 1 elements, 0x4 bytes (sizeof)   
/*0x00C*/         struct _DBGKD_SET_SPECIAL_CALL32 SetSpecialCall;               // 1 elements, 0x4 bytes (sizeof)   
/*0x00C*/         struct _DBGKD_SET_INTERNAL_BREAKPOINT32 SetInternalBreakpoint; // 2 elements, 0x8 bytes (sizeof)   
/*0x00C*/         struct _DBGKD_GET_INTERNAL_BREAKPOINT32 GetInternalBreakpoint; // 7 elements, 0x1C bytes (sizeof)  
/*0x00C*/         struct _DBGKD_GET_VERSION32 GetVersion32;                      // 14 elements, 0x28 bytes (sizeof) 
/*0x00C*/         struct _DBGKD_BREAKPOINTEX BreakPointEx;                       // 2 elements, 0x8 bytes (sizeof)   
/*0x00C*/         struct _DBGKD_READ_WRITE_MSR ReadWriteMsr;                     // 3 elements, 0xC bytes (sizeof)   
/*0x00C*/         struct _DBGKD_SEARCH_MEMORY SearchMemory;                      // 4 elements, 0x18 bytes (sizeof)  
              }u;                                                                                                    
          }DBGKD_MANIPULATE_STATE32, *PDBGKD_MANIPULATE_STATE32;                                                     
                                                                                                                     
          typedef struct _DBGKD_WRITE_BREAKPOINT64 // 2 elements, 0x10 bytes (sizeof) 
          {                                                                           
/*0x000*/     UINT64       BreakPointAddress;                                         
/*0x008*/     ULONG32      BreakPointHandle;                                          
/*0x00C*/     UINT8        _PADDING0_[0x4];                                           
          }DBGKD_WRITE_BREAKPOINT64, *PDBGKD_WRITE_BREAKPOINT64;                                   
                                                                                      
          typedef struct _DBGKD_READ_WRITE_IO64 // 3 elements, 0x10 bytes (sizeof) 
          {                                                                        
/*0x000*/     UINT64       IoAddress;                                              
/*0x008*/     ULONG32      DataSize;                                               
/*0x00C*/     ULONG32      DataValue;                                              
          }DBGKD_READ_WRITE_IO64, *PDBGKD_READ_WRITE_IO64;                                   
                                                                                   
          typedef struct _DBGKD_READ_WRITE_IO_EXTENDED64 // 6 elements, 0x20 bytes (sizeof) 
          {                                                                                 
/*0x000*/     ULONG32      DataSize;                                                        
/*0x004*/     ULONG32      InterfaceType;                                                   
/*0x008*/     ULONG32      BusNumber;                                                       
/*0x00C*/     ULONG32      AddressSpace;                                                    
/*0x010*/     UINT64       IoAddress;                                                       
/*0x018*/     ULONG32      DataValue;                                                       
/*0x01C*/     UINT8        _PADDING0_[0x4];                                                 
          }DBGKD_READ_WRITE_IO_EXTENDED64, *PDBGKD_READ_WRITE_IO_EXTENDED64;                                   
                                                                                            
          typedef struct _DBGKD_SET_SPECIAL_CALL64 // 1 elements, 0x8 bytes (sizeof) 
          {                                                                          
/*0x000*/     UINT64       SpecialCall;                                              
          }DBGKD_SET_SPECIAL_CALL64, *PDBGKD_SET_SPECIAL_CALL64;                                  
                                                                                     
          typedef struct _DBGKD_SET_INTERNAL_BREAKPOINT64 // 2 elements, 0x10 bytes (sizeof) 
          {                                                                                  
/*0x000*/     UINT64       BreakpointAddress;                                                
/*0x008*/     ULONG32      Flags;                                                            
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                  
          }DBGKD_SET_INTERNAL_BREAKPOINT64, *PDBGKD_SET_INTERNAL_BREAKPOINT64;                                   
                                                                                             
          typedef struct _DBGKD_QUERY_MEMORY // 4 elements, 0x18 bytes (sizeof) 
          {                                                                     
/*0x000*/     UINT64       Address;                                             
/*0x008*/     UINT64       Reserved;                                            
/*0x010*/     ULONG32      AddressSpace;                                        
/*0x014*/     ULONG32      Flags;                                               
          }DBGKD_QUERY_MEMORY, *PDBGKD_QUERY_MEMORY;                                   
                                                                                
          typedef struct _DBGKD_MANIPULATE_STATE64                               // 5 elements, 0x38 bytes (sizeof)  
          {                                                                                                          
/*0x000*/     ULONG32      ApiNumber;                                                                                
/*0x004*/     UINT16       ProcessorLevel;                                                                           
/*0x006*/     UINT16       Processor;                                                                                
/*0x008*/     LONG32       ReturnStatus;                                                                             
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                                          
              union                                                              // 21 elements, 0x28 bytes (sizeof) 
              {                                                                                                      
/*0x010*/         struct _DBGKD_READ_MEMORY64 ReadMemory;                        // 3 elements, 0x10 bytes (sizeof)  
/*0x010*/         struct _DBGKD_WRITE_MEMORY64 WriteMemory;                      // 3 elements, 0x10 bytes (sizeof)  
/*0x010*/         struct _DBGKD_GET_CONTEXT GetContext;                          // 1 elements, 0x4 bytes (sizeof)   
/*0x010*/         struct _DBGKD_SET_CONTEXT SetContext;                          // 1 elements, 0x4 bytes (sizeof)   
/*0x010*/         struct _DBGKD_WRITE_BREAKPOINT64 WriteBreakPoint;              // 2 elements, 0x10 bytes (sizeof)  
/*0x010*/         struct _DBGKD_RESTORE_BREAKPOINT RestoreBreakPoint;            // 1 elements, 0x4 bytes (sizeof)   
/*0x010*/         struct _DBGKD_CONTINUE Continue;                               // 1 elements, 0x4 bytes (sizeof)   
/*0x010*/         struct _DBGKD_CONTINUE2 Continue2;                             // 3 elements, 0x20 bytes (sizeof)  
/*0x010*/         struct _DBGKD_READ_WRITE_IO64 ReadWriteIo;                     // 3 elements, 0x10 bytes (sizeof)  
/*0x010*/         struct _DBGKD_READ_WRITE_IO_EXTENDED64 ReadWriteIoExtended;    // 6 elements, 0x20 bytes (sizeof)  
/*0x010*/         struct _DBGKD_QUERY_SPECIAL_CALLS QuerySpecialCalls;           // 1 elements, 0x4 bytes (sizeof)   
/*0x010*/         struct _DBGKD_SET_SPECIAL_CALL64 SetSpecialCall;               // 1 elements, 0x8 bytes (sizeof)   
/*0x010*/         struct _DBGKD_SET_INTERNAL_BREAKPOINT64 SetInternalBreakpoint; // 2 elements, 0x10 bytes (sizeof)  
/*0x010*/         struct _DBGKD_GET_INTERNAL_BREAKPOINT64 GetInternalBreakpoint; // 7 elements, 0x20 bytes (sizeof)  
/*0x010*/         struct _DBGKD_GET_VERSION64 GetVersion64;                      // 13 elements, 0x28 bytes (sizeof) 
/*0x010*/         struct _DBGKD_BREAKPOINTEX BreakPointEx;                       // 2 elements, 0x8 bytes (sizeof)   
/*0x010*/         struct _DBGKD_READ_WRITE_MSR ReadWriteMsr;                     // 3 elements, 0xC bytes (sizeof)   
/*0x010*/         struct _DBGKD_SEARCH_MEMORY SearchMemory;                      // 4 elements, 0x18 bytes (sizeof)  
/*0x010*/         struct _DBGKD_GET_SET_BUS_DATA GetSetBusData;                  // 5 elements, 0x14 bytes (sizeof)  
/*0x010*/         struct _DBGKD_FILL_MEMORY FillMemory;                          // 4 elements, 0x10 bytes (sizeof)  
/*0x010*/         struct _DBGKD_QUERY_MEMORY QueryMemory;                        // 4 elements, 0x18 bytes (sizeof)  
              }u;                                                                                                    
          }DBGKD_MANIPULATE_STATE64, *PDBGKD_MANIPULATE_STATE64;                                                     
                                                                                                                     
          typedef struct _EXCEPTION_RECORD32         // 6 elements, 0x50 bytes (sizeof) 
          {                                                                             
/*0x000*/     LONG32       ExceptionCode;                                               
/*0x004*/     ULONG32      ExceptionFlags;                                              
/*0x008*/     ULONG32      ExceptionRecord;                                             
/*0x00C*/     ULONG32      ExceptionAddress;                                            
/*0x010*/     ULONG32      NumberParameters;                                            
/*0x014*/     ULONG32      ExceptionInformation[15];                                    
          }EXCEPTION_RECORD32, *PEXCEPTION_RECORD32;                                    
                                                                                        
          typedef struct _DBGKM_EXCEPTION32               // 2 elements, 0x54 bytes (sizeof) 
          {                                                                                  
/*0x000*/     struct _EXCEPTION_RECORD32 ExceptionRecord; // 6 elements, 0x50 bytes (sizeof) 
/*0x050*/     ULONG32      FirstChance;                                                      
          }DBGKM_EXCEPTION32, *PDBGKM_EXCEPTION32;                                           
                                                                                             
          typedef struct _EXCEPTION_RECORD64         // 7 elements, 0x98 bytes (sizeof) 
          {                                                                             
/*0x000*/     LONG32       ExceptionCode;                                               
/*0x004*/     ULONG32      ExceptionFlags;                                              
/*0x008*/     UINT64       ExceptionRecord;                                             
/*0x010*/     UINT64       ExceptionAddress;                                            
/*0x018*/     ULONG32      NumberParameters;                                            
/*0x01C*/     ULONG32      __unusedAlignment;                                           
/*0x020*/     UINT64       ExceptionInformation[15];                                    
          }EXCEPTION_RECORD64, *PEXCEPTION_RECORD64;                                    
                                                                                        
          typedef struct _DBGKM_EXCEPTION64               // 2 elements, 0xA0 bytes (sizeof) 
          {                                                                                  
/*0x000*/     struct _EXCEPTION_RECORD64 ExceptionRecord; // 7 elements, 0x98 bytes (sizeof) 
/*0x098*/     ULONG32      FirstChance;                                                      
/*0x09C*/     UINT8        _PADDING0_[0x4];                                                  
          }DBGKM_EXCEPTION64, *PDBGKM_EXCEPTION64;                                           
                                                                                             
          typedef struct _DEFERRED_WRITE                // 10 elements, 0x28 bytes (sizeof) 
          {                                                                                 
/*0x000*/     INT16        NodeTypeCode;                                                    
/*0x002*/     INT16        NodeByteSize;                                                    
/*0x004*/     struct _FILE_OBJECT* FileObject;                                              
/*0x008*/     ULONG32      BytesToWrite;                                                    
/*0x00C*/     struct _LIST_ENTRY DeferredWriteLinks;    // 2 elements, 0x8 bytes (sizeof)   
/*0x014*/     struct _KEVENT* Event;                                                        
/*0x018*/     FUNCT_00BC_0EDA_PostRoutine* PostRoutine;                                     
/*0x01C*/     VOID*        Context1;                                                        
/*0x020*/     VOID*        Context2;                                                        
/*0x024*/     UINT8        LimitModifiedPages;                                              
/*0x025*/     UINT8        _PADDING0_[0x3];                                                 
          }DEFERRED_WRITE, *PDEFERRED_WRITE;                                                
                                                                                            
          typedef struct _DESCRIPTOR // 3 elements, 0x8 bytes (sizeof) 
          {                                                            
/*0x000*/     UINT16       Pad;                                        
/*0x002*/     UINT16       Limit;                                      
/*0x004*/     ULONG32      Base;                                       
          }DESCRIPTOR, *PDESCRIPTOR;                                   
                                                                       
          typedef struct _DEVICE_CAPABILITIES          // 29 elements, 0x40 bytes (sizeof) 
          {                                                                                
/*0x000*/     UINT16       Size;                                                           
/*0x002*/     UINT16       Version;                                                        
              struct                                   // 19 elements, 0x4 bytes (sizeof)  
              {                                                                            
/*0x004*/         ULONG32      DeviceD1 : 1;           // 0 BitPosition                    
/*0x004*/         ULONG32      DeviceD2 : 1;           // 1 BitPosition                    
/*0x004*/         ULONG32      LockSupported : 1;      // 2 BitPosition                    
/*0x004*/         ULONG32      EjectSupported : 1;     // 3 BitPosition                    
/*0x004*/         ULONG32      Removable : 1;          // 4 BitPosition                    
/*0x004*/         ULONG32      DockDevice : 1;         // 5 BitPosition                    
/*0x004*/         ULONG32      UniqueID : 1;           // 6 BitPosition                    
/*0x004*/         ULONG32      SilentInstall : 1;      // 7 BitPosition                    
/*0x004*/         ULONG32      RawDeviceOK : 1;        // 8 BitPosition                    
/*0x004*/         ULONG32      SurpriseRemovalOK : 1;  // 9 BitPosition                    
/*0x004*/         ULONG32      WakeFromD0 : 1;         // 10 BitPosition                   
/*0x004*/         ULONG32      WakeFromD1 : 1;         // 11 BitPosition                   
/*0x004*/         ULONG32      WakeFromD2 : 1;         // 12 BitPosition                   
/*0x004*/         ULONG32      WakeFromD3 : 1;         // 13 BitPosition                   
/*0x004*/         ULONG32      HardwareDisabled : 1;   // 14 BitPosition                   
/*0x004*/         ULONG32      NonDynamic : 1;         // 15 BitPosition                   
/*0x004*/         ULONG32      WarmEjectSupported : 1; // 16 BitPosition                   
/*0x004*/         ULONG32      NoDisplayInUI : 1;      // 17 BitPosition                   
/*0x004*/         ULONG32      Reserved : 14;          // 18 BitPosition                   
              };                                                                           
/*0x008*/     ULONG32      Address;                                                        
/*0x00C*/     ULONG32      UINumber;                                                       
/*0x010*/     enum _DEVICE_POWER_STATE DeviceState[7];                                     
/*0x02C*/     enum _SYSTEM_POWER_STATE SystemWake;                                         
/*0x030*/     enum _DEVICE_POWER_STATE DeviceWake;                                         
/*0x034*/     ULONG32      D1Latency;                                                      
/*0x038*/     ULONG32      D2Latency;                                                      
/*0x03C*/     ULONG32      D3Latency;                                                      
          }DEVICE_CAPABILITIES, *PDEVICE_CAPABILITIES;                                     
                                                                                           
          typedef struct _DEVICE_MAP                               // 5 elements, 0x30 bytes (sizeof) 
          {                                                                                           
/*0x000*/     struct _OBJECT_DIRECTORY* DosDevicesDirectory;                                          
/*0x004*/     struct _OBJECT_DIRECTORY* GlobalDosDevicesDirectory;                                    
/*0x008*/     ULONG32      ReferenceCount;                                                            
/*0x00C*/     ULONG32      DriveMap;                                                                  
/*0x010*/     UINT8        DriveType[32];                                                             
          }DEVICE_MAP, *PDEVICE_MAP;                                                                  
                                                                                                      
          typedef struct _DEVICE_NODE                                      // 45 elements, 0x118 bytes (sizeof) 
          {                                                                                                     
/*0x000*/     struct _DEVICE_NODE* Sibling;                                                                     
/*0x004*/     struct _DEVICE_NODE* Child;                                                                       
/*0x008*/     struct _DEVICE_NODE* Parent;                                                                      
/*0x00C*/     struct _DEVICE_NODE* LastChild;                                                                   
/*0x010*/     ULONG32      Level;                                                                               
/*0x014*/     struct _PO_DEVICE_NOTIFY* Notify;                                                                 
/*0x018*/     enum _PNP_DEVNODE_STATE State;                                                                    
/*0x01C*/     enum _PNP_DEVNODE_STATE PreviousState;                                                            
/*0x020*/     enum _PNP_DEVNODE_STATE StateHistory[20];                                                         
/*0x070*/     ULONG32      StateHistoryEntry;                                                                   
/*0x074*/     LONG32       CompletionStatus;                                                                    
/*0x078*/     struct _IRP* PendingIrp;                                                                          
/*0x07C*/     ULONG32      Flags;                                                                               
/*0x080*/     ULONG32      UserFlags;                                                                           
/*0x084*/     ULONG32      Problem;                                                                             
/*0x088*/     struct _DEVICE_OBJECT* PhysicalDeviceObject;                                                      
/*0x08C*/     struct _CM_RESOURCE_LIST* ResourceList;                                                           
/*0x090*/     struct _CM_RESOURCE_LIST* ResourceListTranslated;                                                 
/*0x094*/     struct _UNICODE_STRING InstancePath;                         // 3 elements, 0x8 bytes (sizeof)    
/*0x09C*/     struct _UNICODE_STRING ServiceName;                          // 3 elements, 0x8 bytes (sizeof)    
/*0x0A4*/     struct _DEVICE_OBJECT* DuplicatePDO;                                                              
/*0x0A8*/     struct _IO_RESOURCE_REQUIREMENTS_LIST* ResourceRequirements;                                      
/*0x0AC*/     enum _INTERFACE_TYPE InterfaceType;                                                               
/*0x0B0*/     ULONG32      BusNumber;                                                                           
/*0x0B4*/     enum _INTERFACE_TYPE ChildInterfaceType;                                                          
/*0x0B8*/     ULONG32      ChildBusNumber;                                                                      
/*0x0BC*/     UINT16       ChildBusTypeIndex;                                                                   
/*0x0BE*/     UINT8        RemovalPolicy;                                                                       
/*0x0BF*/     UINT8        HardwareRemovalPolicy;                                                               
/*0x0C0*/     struct _LIST_ENTRY TargetDeviceNotify;                       // 2 elements, 0x8 bytes (sizeof)    
/*0x0C8*/     struct _LIST_ENTRY DeviceArbiterList;                        // 2 elements, 0x8 bytes (sizeof)    
/*0x0D0*/     struct _LIST_ENTRY DeviceTranslatorList;                     // 2 elements, 0x8 bytes (sizeof)    
/*0x0D8*/     UINT16       NoTranslatorMask;                                                                    
/*0x0DA*/     UINT16       QueryTranslatorMask;                                                                 
/*0x0DC*/     UINT16       NoArbiterMask;                                                                       
/*0x0DE*/     UINT16       QueryArbiterMask;                                                                    
              union                                                        // 2 elements, 0x4 bytes (sizeof)    
              {                                                                                                 
/*0x0E0*/         struct _DEVICE_NODE* LegacyDeviceNode;                                                        
/*0x0E0*/         struct _DEVICE_RELATIONS* PendingDeviceRelations;                                             
              }OverUsed1;                                                                                       
              union                                                        // 1 elements, 0x4 bytes (sizeof)    
              {                                                                                                 
/*0x0E4*/         struct _DEVICE_NODE* NextResourceDeviceNode;                                                  
              }OverUsed2;                                                                                       
/*0x0E8*/     struct _CM_RESOURCE_LIST* BootResources;                                                          
/*0x0EC*/     ULONG32      CapabilityFlags;                                                                     
              struct                                                       // 3 elements, 0x10 bytes (sizeof)   
              {                                                                                                 
/*0x0F0*/         enum _PROFILE_STATUS DockStatus;                                                              
/*0x0F4*/         struct _LIST_ENTRY ListEntry;                            // 2 elements, 0x8 bytes (sizeof)    
/*0x0FC*/         UINT16*      SerialNumber;                                                                    
              }DockInfo;                                                                                        
/*0x100*/     ULONG32      DisableableDepends;                                                                  
/*0x104*/     struct _LIST_ENTRY PendedSetInterfaceState;                  // 2 elements, 0x8 bytes (sizeof)    
/*0x10C*/     struct _LIST_ENTRY LegacyBusListEntry;                       // 2 elements, 0x8 bytes (sizeof)    
/*0x114*/     ULONG32      DriverUnloadRetryCount;                                                              
          }DEVICE_NODE, *PDEVICE_NODE;                                                                          
                                                                                                                
          typedef struct _KDEVICE_QUEUE_ENTRY     // 3 elements, 0x10 bytes (sizeof) 
          {                                                                          
/*0x000*/     struct _LIST_ENTRY DeviceListEntry; // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     ULONG32      SortKey;                                                  
/*0x00C*/     UINT8        Inserted;                                                 
/*0x00D*/     UINT8        _PADDING0_[0x3];                                          
          }KDEVICE_QUEUE_ENTRY, *PKDEVICE_QUEUE_ENTRY;                                   
                                                                                     
          typedef struct _WAIT_CONTEXT_BLOCK                // 7 elements, 0x28 bytes (sizeof) 
          {                                                                                    
/*0x000*/     struct _KDEVICE_QUEUE_ENTRY WaitQueueEntry;   // 3 elements, 0x10 bytes (sizeof) 
/*0x010*/     FUNCT_0978_0977_DeviceRoutine* DeviceRoutine;                                    
/*0x014*/     VOID*        DeviceContext;                                                      
/*0x018*/     ULONG32      NumberOfMapRegisters;                                               
/*0x01C*/     VOID*        DeviceObject;                                                       
/*0x020*/     VOID*        CurrentIrp;                                                         
/*0x024*/     struct _KDPC* BufferChainingDpc;                                                 
          }WAIT_CONTEXT_BLOCK, *PWAIT_CONTEXT_BLOCK;                                           
                                                                                               
          typedef struct _KDEVICE_QUEUE          // 5 elements, 0x14 bytes (sizeof) 
          {                                                                         
/*0x000*/     INT16        Type;                                                    
/*0x002*/     INT16        Size;                                                    
/*0x004*/     struct _LIST_ENTRY DeviceListHead; // 2 elements, 0x8 bytes (sizeof)  
/*0x00C*/     ULONG32      Lock;                                                    
/*0x010*/     UINT8        Busy;                                                    
/*0x011*/     UINT8        _PADDING0_[0x3];                                         
          }KDEVICE_QUEUE, *PKDEVICE_QUEUE;                                          
                                                                                    
          typedef struct _KDPC                                  // 9 elements, 0x20 bytes (sizeof) 
          {                                                                                        
/*0x000*/     INT16        Type;                                                                   
/*0x002*/     UINT8        Number;                                                                 
/*0x003*/     UINT8        Importance;                                                             
/*0x004*/     struct _LIST_ENTRY DpcListEntry;                  // 2 elements, 0x8 bytes (sizeof)  
/*0x00C*/     FUNCT_00BC_0130_DeferredRoutine* DeferredRoutine;                                    
/*0x010*/     VOID*        DeferredContext;                                                        
/*0x014*/     VOID*        SystemArgument1;                                                        
/*0x018*/     VOID*        SystemArgument2;                                                        
/*0x01C*/     ULONG32*     Lock;                                                                   
          }KDPC, *PKDPC;                                                                           
                                                                                                   
          typedef struct _DEVICE_OBJECT                        // 25 elements, 0xB8 bytes (sizeof) 
          {                                                                                        
/*0x000*/     INT16        Type;                                                                   
/*0x002*/     UINT16       Size;                                                                   
/*0x004*/     LONG32       ReferenceCount;                                                         
/*0x008*/     struct _DRIVER_OBJECT* DriverObject;                                                 
/*0x00C*/     struct _DEVICE_OBJECT* NextDevice;                                                   
/*0x010*/     struct _DEVICE_OBJECT* AttachedDevice;                                               
/*0x014*/     struct _IRP* CurrentIrp;                                                             
/*0x018*/     struct _IO_TIMER* Timer;                                                             
/*0x01C*/     ULONG32      Flags;                                                                  
/*0x020*/     ULONG32      Characteristics;                                                        
/*0x024*/     struct _VPB* Vpb;                                                                    
/*0x028*/     VOID*        DeviceExtension;                                                        
/*0x02C*/     ULONG32      DeviceType;                                                             
/*0x030*/     CHAR         StackSize;                                                              
/*0x031*/     UINT8        _PADDING0_[0x3];                                                        
              union                                            // 2 elements, 0x28 bytes (sizeof)  
              {                                                                                    
/*0x034*/         struct _LIST_ENTRY ListEntry;                // 2 elements, 0x8 bytes (sizeof)   
/*0x034*/         struct _WAIT_CONTEXT_BLOCK Wcb;              // 7 elements, 0x28 bytes (sizeof)  
              }Queue;                                                                              
/*0x05C*/     ULONG32      AlignmentRequirement;                                                   
/*0x060*/     struct _KDEVICE_QUEUE DeviceQueue;               // 5 elements, 0x14 bytes (sizeof)  
/*0x074*/     struct _KDPC Dpc;                                // 9 elements, 0x20 bytes (sizeof)  
/*0x094*/     ULONG32      ActiveThreadCount;                                                      
/*0x098*/     VOID*        SecurityDescriptor;                                                     
/*0x09C*/     struct _KEVENT DeviceLock;                       // 1 elements, 0x10 bytes (sizeof)  
/*0x0AC*/     UINT16       SectorSize;                                                             
/*0x0AE*/     UINT16       Spare1;                                                                 
/*0x0B0*/     struct _DEVOBJ_EXTENSION* DeviceObjectExtension;                                     
/*0x0B4*/     VOID*        Reserved;                                                               
          }DEVICE_OBJECT, *PDEVICE_OBJECT;                                                         
                                                                                                   
          typedef struct _POWER_CHANNEL_SUMMARY // 4 elements, 0x14 bytes (sizeof) 
          {                                                                        
/*0x000*/     ULONG32      Signature;                                              
/*0x004*/     ULONG32      TotalCount;                                             
/*0x008*/     ULONG32      D0Count;                                                
/*0x00C*/     struct _LIST_ENTRY NotifyList;    // 2 elements, 0x8 bytes (sizeof)  
          }POWER_CHANNEL_SUMMARY, *PPOWER_CHANNEL_SUMMARY;                                   
                                                                                   
          typedef struct _DEVICE_OBJECT_POWER_EXTENSION          // 11 elements, 0x4C bytes (sizeof) 
          {                                                                                          
/*0x000*/     ULONG32      IdleCount;                                                                
/*0x004*/     ULONG32      ConservationIdleTime;                                                     
/*0x008*/     ULONG32      PerformanceIdleTime;                                                      
/*0x00C*/     struct _DEVICE_OBJECT* DeviceObject;                                                   
/*0x010*/     struct _LIST_ENTRY IdleList;                       // 2 elements, 0x8 bytes (sizeof)   
/*0x018*/     UINT8        DeviceType;                                                               
/*0x019*/     UINT8        _PADDING0_[0x3];                                                          
/*0x01C*/     enum _DEVICE_POWER_STATE State;                                                        
/*0x020*/     struct _LIST_ENTRY NotifySourceList;               // 2 elements, 0x8 bytes (sizeof)   
/*0x028*/     struct _LIST_ENTRY NotifyTargetList;               // 2 elements, 0x8 bytes (sizeof)   
/*0x030*/     struct _POWER_CHANNEL_SUMMARY PowerChannelSummary; // 4 elements, 0x14 bytes (sizeof)  
/*0x044*/     struct _LIST_ENTRY Volume;                         // 2 elements, 0x8 bytes (sizeof)   
          }DEVICE_OBJECT_POWER_EXTENSION, *PDEVICE_OBJECT_POWER_EXTENSION;                                    
                                                                                                     
          typedef struct _DEVICE_RELATIONS       // 2 elements, 0x8 bytes (sizeof) 
          {                                                                        
/*0x000*/     ULONG32      Count;                                                  
/*0x004*/     struct _DEVICE_OBJECT* Objects[1];                                   
          }DEVICE_RELATIONS, *PDEVICE_RELATIONS;                                   
                                                                                   
          typedef struct _DEVOBJ_EXTENSION                 // 12 elements, 0x2C bytes (sizeof) 
          {                                                                                    
/*0x000*/     INT16        Type;                                                               
/*0x002*/     UINT16       Size;                                                               
/*0x004*/     struct _DEVICE_OBJECT* DeviceObject;                                             
/*0x008*/     ULONG32      PowerFlags;                                                         
/*0x00C*/     struct _DEVICE_OBJECT_POWER_EXTENSION* Dope;                                     
/*0x010*/     ULONG32      ExtensionFlags;                                                     
/*0x014*/     VOID*        DeviceNode;                                                         
/*0x018*/     struct _DEVICE_OBJECT* AttachedTo;                                               
/*0x01C*/     LONG32       StartIoCount;                                                       
/*0x020*/     LONG32       StartIoKey;                                                         
/*0x024*/     ULONG32      StartIoFlags;                                                       
/*0x028*/     struct _VPB* Vpb;                                                                
          }DEVOBJ_EXTENSION, *PDEVOBJ_EXTENSION;                                               
                                                                                               
          typedef struct _DRIVER_EXTENSION                        // 6 elements, 0x1C bytes (sizeof) 
          {                                                                                          
/*0x000*/     struct _DRIVER_OBJECT* DriverObject;                                                   
/*0x004*/     FUNCT_0049_03BB_AddDevice* AddDevice;                                                  
/*0x008*/     ULONG32      Count;                                                                    
/*0x00C*/     struct _UNICODE_STRING ServiceKeyName;              // 3 elements, 0x8 bytes (sizeof)  
/*0x014*/     struct _IO_CLIENT_EXTENSION* ClientDriverExtension;                                    
/*0x018*/     struct _FS_FILTER_CALLBACKS* FsFilterCallbacks;                                        
          }DRIVER_EXTENSION, *PDRIVER_EXTENSION;                                                     
                                                                                                     
          typedef struct _DRIVER_OBJECT                                                      // 15 elements, 0xA8 bytes (sizeof) 
          {                                                                                                                      
/*0x000*/     INT16        Type;                                                                                                 
/*0x002*/     INT16        Size;                                                                                                 
/*0x004*/     struct _DEVICE_OBJECT* DeviceObject;                                                                               
/*0x008*/     ULONG32      Flags;                                                                                                
/*0x00C*/     VOID*        DriverStart;                                                                                          
/*0x010*/     ULONG32      DriverSize;                                                                                           
/*0x014*/     VOID*        DriverSection;                                                                                        
/*0x018*/     struct _DRIVER_EXTENSION* DriverExtension;                                                                         
/*0x01C*/     struct _UNICODE_STRING DriverName;                                             // 3 elements, 0x8 bytes (sizeof)   
/*0x024*/     struct _UNICODE_STRING* HardwareDatabase;                                                                          
/*0x028*/     struct _FAST_IO_DISPATCH* FastIoDispatch;                                                                          
/*0x02C*/     FUNCT_0049_0956_DriverInit* DriverInit;                                                                            
/*0x030*/     FUNCT_00BC_0718_DriverStartIo_CancelRoutine_SavedCancelRoutine* DriverStartIo;                                     
/*0x034*/     FUNCT_00BC_095A_DriverUnload* DriverUnload;                                                                        
/*0x038*/     FUNCT_0049_095E_MajorFunction* MajorFunction[28];                                                                  
          }DRIVER_OBJECT, *PDRIVER_OBJECT;                                                                                       
                                                                                                                                 
          typedef struct _GUID       // 4 elements, 0x10 bytes (sizeof) 
          {                                                             
/*0x000*/     ULONG32      Data1;                                       
/*0x004*/     UINT16       Data2;                                       
/*0x006*/     UINT16       Data3;                                       
/*0x008*/     UINT8        Data4[8];                                    
          }GUID, *PGUID;                                                
                                                                        
          typedef struct _DUMP_INITIALIZATION_CONTEXT                                              // 19 elements, 0x70 bytes (sizeof) 
          {                                                                                                                            
/*0x000*/     ULONG32      Length;                                                                                                     
/*0x004*/     ULONG32      Reserved;                                                                                                   
/*0x008*/     VOID*        MemoryBlock;                                                                                                
/*0x00C*/     VOID*        CommonBuffer[2];                                                                                            
/*0x014*/     UINT8        _PADDING0_[0x4];                                                                                            
/*0x018*/     union _LARGE_INTEGER PhysicalAddress[2];                                                                                 
/*0x028*/     FUNCT_00BC_18EF_StallRoutine* StallRoutine;                                                                              
/*0x02C*/     FUNCT_003D_18F2_OpenRoutine* OpenRoutine;                                                                                
/*0x030*/     FUNCT_0049_18F5_WriteRoutine* WriteRoutine;                                                                              
/*0x034*/     FUNCT_00BC_0631_PostProcessInitRoutine_DispatchAddress_FinishRoutine* FinishRoutine;                                     
/*0x038*/     struct _ADAPTER_OBJECT* AdapterObject;                                                                                   
/*0x03C*/     VOID*        MappedRegisterBase;                                                                                         
/*0x040*/     VOID*        PortConfiguration;                                                                                          
/*0x044*/     UINT8        CrashDump;                                                                                                  
/*0x045*/     UINT8        _PADDING1_[0x3];                                                                                            
/*0x048*/     ULONG32      MaximumTransferSize;                                                                                        
/*0x04C*/     ULONG32      CommonBufferSize;                                                                                           
/*0x050*/     VOID*        TargetAddress;                                                                                              
/*0x054*/     FUNCT_0049_18FB_WritePendingRoutine* WritePendingRoutine;                                                                
/*0x058*/     ULONG32      PartitionStyle;                                                                                             
              union                                                                                // 2 elements, 0x10 bytes (sizeof)  
              {                                                                                                                        
                  struct                                                                           // 2 elements, 0x8 bytes (sizeof)   
                  {                                                                                                                    
/*0x05C*/             ULONG32      Signature;                                                                                          
/*0x060*/             ULONG32      CheckSum;                                                                                           
                  }Mbr;                                                                                                                
                  struct                                                                           // 1 elements, 0x10 bytes (sizeof)  
                  {                                                                                                                    
/*0x05C*/             struct _GUID DiskId;                                                         // 4 elements, 0x10 bytes (sizeof)  
                  }Gpt;                                                                                                                
              }DiskInfo;                                                                                                               
          }DUMP_INITIALIZATION_CONTEXT, *PDUMP_INITIALIZATION_CONTEXT;                                                                 
                                                                                                                                       
          typedef struct _STRING          // 3 elements, 0x8 bytes (sizeof) 
          {                                                                 
/*0x000*/     UINT16       Length;                                          
/*0x002*/     UINT16       MaximumLength;                                   
/*0x004*/     CHAR*        Buffer;                                          
          }STRING, *PSTRING;                                                
                                                                            
          typedef struct _DUMP_STACK_CONTEXT                  // 11 elements, 0xB0 bytes (sizeof) 
          {                                                                                       
/*0x000*/     struct _DUMP_INITIALIZATION_CONTEXT Init;       // 19 elements, 0x70 bytes (sizeof) 
/*0x070*/     union _LARGE_INTEGER PartitionOffset;           // 4 elements, 0x8 bytes (sizeof)   
/*0x078*/     VOID*        DumpPointers;                                                          
/*0x07C*/     ULONG32      PointersLength;                                                        
/*0x080*/     UINT16*      ModulePrefix;                                                          
/*0x084*/     struct _LIST_ENTRY DriverList;                  // 2 elements, 0x8 bytes (sizeof)   
/*0x08C*/     struct _STRING InitMsg;                         // 3 elements, 0x8 bytes (sizeof)   
/*0x094*/     struct _STRING ProgMsg;                         // 3 elements, 0x8 bytes (sizeof)   
/*0x09C*/     struct _STRING DoneMsg;                         // 3 elements, 0x8 bytes (sizeof)   
/*0x0A4*/     VOID*        FileObject;                                                            
/*0x0A8*/     enum _DEVICE_USAGE_NOTIFICATION_TYPE UsageType;                                     
/*0x0AC*/     UINT8        _PADDING0_[0x4];                                                       
          }DUMP_STACK_CONTEXT, *PDUMP_STACK_CONTEXT;                                              
                                                                                                  
          typedef struct _OWNER_ENTRY      // 3 elements, 0x8 bytes (sizeof) 
          {                                                                  
/*0x000*/     ULONG32      OwnerThread;                                      
              union                        // 2 elements, 0x4 bytes (sizeof) 
              {                                                              
/*0x004*/         LONG32       OwnerCount;                                   
/*0x004*/         ULONG32      TableSize;                                    
              };                                                             
          }OWNER_ENTRY, *POWNER_ENTRY;                                       
                                                                             
          typedef struct _ERESOURCE                   // 13 elements, 0x38 bytes (sizeof) 
          {                                                                               
/*0x000*/     struct _LIST_ENTRY SystemResourcesList; // 2 elements, 0x8 bytes (sizeof)   
/*0x008*/     struct _OWNER_ENTRY* OwnerTable;                                            
/*0x00C*/     INT16        ActiveCount;                                                   
/*0x00E*/     UINT16       Flag;                                                          
/*0x010*/     struct _KSEMAPHORE* SharedWaiters;                                          
/*0x014*/     struct _KEVENT* ExclusiveWaiters;                                           
/*0x018*/     struct _OWNER_ENTRY OwnerThreads[2];                                        
/*0x028*/     ULONG32      ContentionCount;                                               
/*0x02C*/     UINT16       NumberOfSharedWaiters;                                         
/*0x02E*/     UINT16       NumberOfExclusiveWaiters;                                      
              union                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                           
/*0x030*/         VOID*        Address;                                                   
/*0x030*/         ULONG32      CreatorBackTraceIndex;                                     
              };                                                                          
/*0x034*/     ULONG32      SpinLock;                                                      
          }ERESOURCE, *PERESOURCE;                                                        
                                                                                          
          typedef struct _IO_COUNTERS           // 6 elements, 0x30 bytes (sizeof) 
          {                                                                        
/*0x000*/     UINT64       ReadOperationCount;                                     
/*0x008*/     UINT64       WriteOperationCount;                                    
/*0x010*/     UINT64       OtherOperationCount;                                    
/*0x018*/     UINT64       ReadTransferCount;                                      
/*0x020*/     UINT64       WriteTransferCount;                                     
/*0x028*/     UINT64       OtherTransferCount;                                     
          }IO_COUNTERS, *PIO_COUNTERS;                                             
                                                                                   
          typedef struct _FAST_MUTEX   // 5 elements, 0x20 bytes (sizeof) 
          {                                                               
/*0x000*/     LONG32       Count;                                         
/*0x004*/     struct _KTHREAD* Owner;                                     
/*0x008*/     ULONG32      Contention;                                    
/*0x00C*/     struct _KEVENT Event;    // 1 elements, 0x10 bytes (sizeof) 
/*0x01C*/     ULONG32      OldIrql;                                       
          }FAST_MUTEX, *PFAST_MUTEX;                                      
                                                                          
          typedef struct _EJOB                                // 45 elements, 0x180 bytes (sizeof) 
          {                                                                                        
/*0x000*/     struct _KEVENT Event;                           // 1 elements, 0x10 bytes (sizeof)   
/*0x010*/     struct _LIST_ENTRY JobLinks;                    // 2 elements, 0x8 bytes (sizeof)    
/*0x018*/     struct _LIST_ENTRY ProcessListHead;             // 2 elements, 0x8 bytes (sizeof)    
/*0x020*/     struct _ERESOURCE JobLock;                      // 13 elements, 0x38 bytes (sizeof)  
/*0x058*/     union _LARGE_INTEGER TotalUserTime;             // 4 elements, 0x8 bytes (sizeof)    
/*0x060*/     union _LARGE_INTEGER TotalKernelTime;           // 4 elements, 0x8 bytes (sizeof)    
/*0x068*/     union _LARGE_INTEGER ThisPeriodTotalUserTime;   // 4 elements, 0x8 bytes (sizeof)    
/*0x070*/     union _LARGE_INTEGER ThisPeriodTotalKernelTime; // 4 elements, 0x8 bytes (sizeof)    
/*0x078*/     ULONG32      TotalPageFaultCount;                                                    
/*0x07C*/     ULONG32      TotalProcesses;                                                         
/*0x080*/     ULONG32      ActiveProcesses;                                                        
/*0x084*/     ULONG32      TotalTerminatedProcesses;                                               
/*0x088*/     union _LARGE_INTEGER PerProcessUserTimeLimit;   // 4 elements, 0x8 bytes (sizeof)    
/*0x090*/     union _LARGE_INTEGER PerJobUserTimeLimit;       // 4 elements, 0x8 bytes (sizeof)    
/*0x098*/     ULONG32      LimitFlags;                                                             
/*0x09C*/     ULONG32      MinimumWorkingSetSize;                                                  
/*0x0A0*/     ULONG32      MaximumWorkingSetSize;                                                  
/*0x0A4*/     ULONG32      ActiveProcessLimit;                                                     
/*0x0A8*/     ULONG32      Affinity;                                                               
/*0x0AC*/     UINT8        PriorityClass;                                                          
/*0x0AD*/     UINT8        _PADDING0_[0x3];                                                        
/*0x0B0*/     ULONG32      UIRestrictionsClass;                                                    
/*0x0B4*/     ULONG32      SecurityLimitFlags;                                                     
/*0x0B8*/     VOID*        Token;                                                                  
/*0x0BC*/     struct _PS_JOB_TOKEN_FILTER* Filter;                                                 
/*0x0C0*/     ULONG32      EndOfJobTimeAction;                                                     
/*0x0C4*/     VOID*        CompletionPort;                                                         
/*0x0C8*/     VOID*        CompletionKey;                                                          
/*0x0CC*/     ULONG32      SessionId;                                                              
/*0x0D0*/     ULONG32      SchedulingClass;                                                        
/*0x0D4*/     UINT8        _PADDING1_[0x4];                                                        
/*0x0D8*/     UINT64       ReadOperationCount;                                                     
/*0x0E0*/     UINT64       WriteOperationCount;                                                    
/*0x0E8*/     UINT64       OtherOperationCount;                                                    
/*0x0F0*/     UINT64       ReadTransferCount;                                                      
/*0x0F8*/     UINT64       WriteTransferCount;                                                     
/*0x100*/     UINT64       OtherTransferCount;                                                     
/*0x108*/     struct _IO_COUNTERS IoInfo;                     // 6 elements, 0x30 bytes (sizeof)   
/*0x138*/     ULONG32      ProcessMemoryLimit;                                                     
/*0x13C*/     ULONG32      JobMemoryLimit;                                                         
/*0x140*/     ULONG32      PeakProcessMemoryUsed;                                                  
/*0x144*/     ULONG32      PeakJobMemoryUsed;                                                      
/*0x148*/     ULONG32      CurrentJobMemoryUsed;                                                   
/*0x14C*/     struct _FAST_MUTEX MemoryLimitsLock;            // 5 elements, 0x20 bytes (sizeof)   
/*0x16C*/     struct _LIST_ENTRY JobSetLinks;                 // 2 elements, 0x8 bytes (sizeof)    
/*0x174*/     ULONG32      MemberLevel;                                                            
/*0x178*/     ULONG32      JobFlags;                                                               
/*0x17C*/     UINT8        _PADDING2_[0x4];                                                        
          }EJOB, *PEJOB;                                                                           
                                                                                                   
          typedef struct _KGDTENTRY                 // 3 elements, 0x8 bytes (sizeof)  
          {                                                                            
/*0x000*/     UINT16       LimitLow;                                                   
/*0x002*/     UINT16       BaseLow;                                                    
              union                                 // 2 elements, 0x4 bytes (sizeof)  
              {                                                                        
                  struct                            // 4 elements, 0x4 bytes (sizeof)  
                  {                                                                    
/*0x004*/             UINT8        BaseMid;                                            
/*0x005*/             UINT8        Flags1;                                             
/*0x006*/             UINT8        Flags2;                                             
/*0x007*/             UINT8        BaseHi;                                             
                  }Bytes;                                                              
                  struct                            // 10 elements, 0x4 bytes (sizeof) 
                  {                                                                    
/*0x004*/             ULONG32      BaseMid : 8;     // 0 BitPosition                   
/*0x004*/             ULONG32      Type : 5;        // 8 BitPosition                   
/*0x004*/             ULONG32      Dpl : 2;         // 13 BitPosition                  
/*0x004*/             ULONG32      Pres : 1;        // 15 BitPosition                  
/*0x004*/             ULONG32      LimitHi : 4;     // 16 BitPosition                  
/*0x004*/             ULONG32      Sys : 1;         // 20 BitPosition                  
/*0x004*/             ULONG32      Reserved_0 : 1;  // 21 BitPosition                  
/*0x004*/             ULONG32      Default_Big : 1; // 22 BitPosition                  
/*0x004*/             ULONG32      Granularity : 1; // 23 BitPosition                  
/*0x004*/             ULONG32      BaseHi : 8;      // 24 BitPosition                  
                  }Bits;                                                               
              }HighWord;                                                               
          }KGDTENTRY, *PKGDTENTRY;                                                     
                                                                                       
          typedef struct _KIDTENTRY        // 4 elements, 0x8 bytes (sizeof) 
          {                                                                  
/*0x000*/     UINT16       Offset;                                           
/*0x002*/     UINT16       Selector;                                         
/*0x004*/     UINT16       Access;                                           
/*0x006*/     UINT16       ExtendedOffset;                                   
          }KIDTENTRY, *PKIDTENTRY;                                           
                                                                             
          typedef struct _SINGLE_LIST_ENTRY    // 1 elements, 0x4 bytes (sizeof) 
          {                                                                      
/*0x000*/     struct _SINGLE_LIST_ENTRY* Next;                                   
          }SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY;                                  
                                                                                 
          typedef struct _KEXECUTE_OPTIONS            // 7 elements, 0x1 bytes (sizeof) 
          {                                                                             
/*0x000*/     UINT8        ExecuteDisable : 1;        // 0 BitPosition                  
/*0x000*/     UINT8        ExecuteEnable : 1;         // 1 BitPosition                  
/*0x000*/     UINT8        DisableThunkEmulation : 1; // 2 BitPosition                  
/*0x000*/     UINT8        Permanent : 1;             // 3 BitPosition                  
/*0x000*/     UINT8        ExecuteDispatchEnable : 1; // 4 BitPosition                  
/*0x000*/     UINT8        ImageDispatchEnable : 1;   // 5 BitPosition                  
/*0x000*/     UINT8        Spare : 2;                 // 6 BitPosition                  
          }KEXECUTE_OPTIONS, *PKEXECUTE_OPTIONS;                                        
                                                                                        
          typedef struct _KPROCESS                     // 29 elements, 0x6C bytes (sizeof) 
          {                                                                                
/*0x000*/     struct _DISPATCHER_HEADER Header;        // 6 elements, 0x10 bytes (sizeof)  
/*0x010*/     struct _LIST_ENTRY ProfileListHead;      // 2 elements, 0x8 bytes (sizeof)   
/*0x018*/     ULONG32      DirectoryTableBase[2];                                          
/*0x020*/     struct _KGDTENTRY LdtDescriptor;         // 3 elements, 0x8 bytes (sizeof)   
/*0x028*/     struct _KIDTENTRY Int21Descriptor;       // 4 elements, 0x8 bytes (sizeof)   
/*0x030*/     UINT16       IopmOffset;                                                     
/*0x032*/     UINT8        Iopl;                                                           
/*0x033*/     UINT8        Unused;                                                         
/*0x034*/     ULONG32      ActiveProcessors;                                               
/*0x038*/     ULONG32      KernelTime;                                                     
/*0x03C*/     ULONG32      UserTime;                                                       
/*0x040*/     struct _LIST_ENTRY ReadyListHead;        // 2 elements, 0x8 bytes (sizeof)   
/*0x048*/     struct _SINGLE_LIST_ENTRY SwapListEntry; // 1 elements, 0x4 bytes (sizeof)   
/*0x04C*/     VOID*        VdmTrapcHandler;                                                
/*0x050*/     struct _LIST_ENTRY ThreadListHead;       // 2 elements, 0x8 bytes (sizeof)   
/*0x058*/     ULONG32      ProcessLock;                                                    
/*0x05C*/     ULONG32      Affinity;                                                       
/*0x060*/     UINT16       StackCount;                                                     
/*0x062*/     CHAR         BasePriority;                                                   
/*0x063*/     CHAR         ThreadQuantum;                                                  
/*0x064*/     UINT8        AutoAlignment;                                                  
/*0x065*/     UINT8        State;                                                          
/*0x066*/     UINT8        ThreadSeed;                                                     
/*0x067*/     UINT8        DisableBoost;                                                   
/*0x068*/     UINT8        PowerState;                                                     
/*0x069*/     UINT8        DisableQuantum;                                                 
/*0x06A*/     UINT8        IdealNode;                                                      
              union                                    // 2 elements, 0x1 bytes (sizeof)   
              {                                                                            
/*0x06B*/         struct _KEXECUTE_OPTIONS Flags;      // 7 elements, 0x1 bytes (sizeof)   
/*0x06B*/         UINT8        ExecuteOptions;                                             
              };                                                                           
          }KPROCESS, *PKPROCESS;                                                           
                                                                                           
          typedef struct _EX_PUSH_LOCK            // 5 elements, 0x4 bytes (sizeof) 
          {                                                                         
              union                               // 3 elements, 0x4 bytes (sizeof) 
              {                                                                     
                  struct                          // 3 elements, 0x4 bytes (sizeof) 
                  {                                                                 
/*0x000*/             ULONG32      Waiting : 1;   // 0 BitPosition                  
/*0x000*/             ULONG32      Exclusive : 1; // 1 BitPosition                  
/*0x000*/             ULONG32      Shared : 30;   // 2 BitPosition                  
                  };                                                                
/*0x000*/         ULONG32      Value;                                               
/*0x000*/         VOID*        Ptr;                                                 
              };                                                                    
          }EX_PUSH_LOCK, *PEX_PUSH_LOCK;                                            
                                                                                    
          typedef struct _EX_RUNDOWN_REF // 2 elements, 0x4 bytes (sizeof) 
          {                                                                
              union                      // 2 elements, 0x4 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      Count;                                      
/*0x000*/         VOID*        Ptr;                                        
              };                                                           
          }EX_RUNDOWN_REF, *PEX_RUNDOWN_REF;                                  
                                                                           
          typedef struct _EX_FAST_REF      // 3 elements, 0x4 bytes (sizeof) 
          {                                                                  
              union                        // 3 elements, 0x4 bytes (sizeof) 
              {                                                              
/*0x000*/         VOID*        Object;                                       
/*0x000*/         ULONG32      RefCnt : 3; // 0 BitPosition                  
/*0x000*/         ULONG32      Value;                                        
              };                                                             
          }EX_FAST_REF, *PEX_FAST_REF;                                       
                                                                             
          typedef struct _HARDWARE_PTE                   // 16 elements, 0x8 bytes (sizeof) 
          {                                                                                 
              union                                      // 2 elements, 0x8 bytes (sizeof)  
              {                                                                             
                  struct                                 // 14 elements, 0x8 bytes (sizeof) 
                  {                                                                         
/*0x000*/             UINT64       Valid : 1;            // 0 BitPosition                   
/*0x000*/             UINT64       Write : 1;            // 1 BitPosition                   
/*0x000*/             UINT64       Owner : 1;            // 2 BitPosition                   
/*0x000*/             UINT64       WriteThrough : 1;     // 3 BitPosition                   
/*0x000*/             UINT64       CacheDisable : 1;     // 4 BitPosition                   
/*0x000*/             UINT64       Accessed : 1;         // 5 BitPosition                   
/*0x000*/             UINT64       Dirty : 1;            // 6 BitPosition                   
/*0x000*/             UINT64       LargePage : 1;        // 7 BitPosition                   
/*0x000*/             UINT64       Global : 1;           // 8 BitPosition                   
/*0x000*/             UINT64       CopyOnWrite : 1;      // 9 BitPosition                   
/*0x000*/             UINT64       Prototype : 1;        // 10 BitPosition                  
/*0x000*/             UINT64       reserved0 : 1;        // 11 BitPosition                  
/*0x000*/             UINT64       PageFrameNumber : 26; // 12 BitPosition                  
/*0x000*/             UINT64       reserved1 : 26;       // 38 BitPosition                  
                  };                                                                        
                  struct                                 // 2 elements, 0x8 bytes (sizeof)  
                  {                                                                         
/*0x000*/             ULONG32      LowPart;                                                 
/*0x004*/             ULONG32      HighPart;                                                
                  };                                                                        
              };                                                                            
          }HARDWARE_PTE, *PHARDWARE_PTE;                                                    
                                                                                            
          typedef struct _SE_AUDIT_PROCESS_CREATION_INFO      // 1 elements, 0x4 bytes (sizeof) 
          {                                                                                     
/*0x000*/     struct _OBJECT_NAME_INFORMATION* ImageFileName;                                   
          }SE_AUDIT_PROCESS_CREATION_INFO, *PSE_AUDIT_PROCESS_CREATION_INFO;                                  
                                                                                                
          typedef struct _MMSUPPORT_FLAGS                 // 9 elements, 0x4 bytes (sizeof) 
          {                                                                                 
/*0x000*/     UINT32       SessionSpace : 1;              // 0 BitPosition                  
/*0x000*/     UINT32       BeingTrimmed : 1;              // 1 BitPosition                  
/*0x000*/     UINT32       SessionLeader : 1;             // 2 BitPosition                  
/*0x000*/     UINT32       TrimHard : 1;                  // 3 BitPosition                  
/*0x000*/     UINT32       WorkingSetHard : 1;            // 4 BitPosition                  
/*0x000*/     UINT32       AddressSpaceBeingDeleted : 1;  // 5 BitPosition                  
/*0x000*/     UINT32       Available : 10;                // 6 BitPosition                  
/*0x000*/     UINT32       AllowWorkingSetAdjustment : 8; // 16 BitPosition                 
/*0x000*/     UINT32       MemoryPriority : 8;            // 24 BitPosition                 
          }MMSUPPORT_FLAGS, *PMMSUPPORT_FLAGS;                                              
                                                                                            
          typedef struct _MMSUPPORT                        // 14 elements, 0x40 bytes (sizeof) 
          {                                                                                    
/*0x000*/     union _LARGE_INTEGER LastTrimTime;           // 4 elements, 0x8 bytes (sizeof)   
/*0x008*/     struct _MMSUPPORT_FLAGS Flags;               // 9 elements, 0x4 bytes (sizeof)   
/*0x00C*/     ULONG32      PageFaultCount;                                                     
/*0x010*/     ULONG32      PeakWorkingSetSize;                                                 
/*0x014*/     ULONG32      WorkingSetSize;                                                     
/*0x018*/     ULONG32      MinimumWorkingSetSize;                                              
/*0x01C*/     ULONG32      MaximumWorkingSetSize;                                              
/*0x020*/     struct _MMWSL* VmWorkingSetList;                                                 
/*0x024*/     struct _LIST_ENTRY WorkingSetExpansionLinks; // 2 elements, 0x8 bytes (sizeof)   
/*0x02C*/     ULONG32      Claim;                                                              
/*0x030*/     ULONG32      NextEstimationSlot;                                                 
/*0x034*/     ULONG32      NextAgingSlot;                                                      
/*0x038*/     ULONG32      EstimatedAvailable;                                                 
/*0x03C*/     ULONG32      GrowthSinceLastEstimate;                                            
          }MMSUPPORT, *PMMSUPPORT;                                                             
                                                                                               
          typedef struct _EPROCESS                                               // 107 elements, 0x260 bytes (sizeof) 
          {                                                                                                            
/*0x000*/     struct _KPROCESS Pcb;                                              // 29 elements, 0x6C bytes (sizeof)   
/*0x06C*/     struct _EX_PUSH_LOCK ProcessLock;                                  // 5 elements, 0x4 bytes (sizeof)     
/*0x070*/     union _LARGE_INTEGER CreateTime;                                   // 4 elements, 0x8 bytes (sizeof)     
/*0x078*/     union _LARGE_INTEGER ExitTime;                                     // 4 elements, 0x8 bytes (sizeof)     
/*0x080*/     struct _EX_RUNDOWN_REF RundownProtect;                             // 2 elements, 0x4 bytes (sizeof)     
/*0x084*/     VOID*        UniqueProcessId;                                                                            
/*0x088*/     struct _LIST_ENTRY ActiveProcessLinks;                             // 2 elements, 0x8 bytes (sizeof)     
/*0x090*/     ULONG32      QuotaUsage[3];                                                                              
/*0x09C*/     ULONG32      QuotaPeak[3];                                                                               
/*0x0A8*/     ULONG32      CommitCharge;                                                                               
/*0x0AC*/     ULONG32      PeakVirtualSize;                                                                            
/*0x0B0*/     ULONG32      VirtualSize;                                                                                
/*0x0B4*/     struct _LIST_ENTRY SessionProcessLinks;                            // 2 elements, 0x8 bytes (sizeof)     
/*0x0BC*/     VOID*        DebugPort;                                                                                  
/*0x0C0*/     VOID*        ExceptionPort;                                                                              
/*0x0C4*/     struct _HANDLE_TABLE* ObjectTable;                                                                       
/*0x0C8*/     struct _EX_FAST_REF Token;                                         // 3 elements, 0x4 bytes (sizeof)     
/*0x0CC*/     struct _FAST_MUTEX WorkingSetLock;                                 // 5 elements, 0x20 bytes (sizeof)    
/*0x0EC*/     ULONG32      WorkingSetPage;                                                                             
/*0x0F0*/     struct _FAST_MUTEX AddressCreationLock;                            // 5 elements, 0x20 bytes (sizeof)    
/*0x110*/     ULONG32      HyperSpaceLock;                                                                             
/*0x114*/     struct _ETHREAD* ForkInProgress;                                                                         
/*0x118*/     ULONG32      HardwareTrigger;                                                                            
/*0x11C*/     VOID*        VadRoot;                                                                                    
/*0x120*/     VOID*        VadHint;                                                                                    
/*0x124*/     VOID*        CloneRoot;                                                                                  
/*0x128*/     ULONG32      NumberOfPrivatePages;                                                                       
/*0x12C*/     ULONG32      NumberOfLockedPages;                                                                        
/*0x130*/     VOID*        Win32Process;                                                                               
/*0x134*/     struct _EJOB* Job;                                                                                       
/*0x138*/     VOID*        SectionObject;                                                                              
/*0x13C*/     VOID*        SectionBaseAddress;                                                                         
/*0x140*/     struct _EPROCESS_QUOTA_BLOCK* QuotaBlock;                                                                
/*0x144*/     struct _PAGEFAULT_HISTORY* WorkingSetWatch;                                                              
/*0x148*/     VOID*        Win32WindowStation;                                                                         
/*0x14C*/     VOID*        InheritedFromUniqueProcessId;                                                               
/*0x150*/     VOID*        LdtInformation;                                                                             
/*0x154*/     VOID*        VadFreeHint;                                                                                
/*0x158*/     VOID*        VdmObjects;                                                                                 
/*0x15C*/     VOID*        DeviceMap;                                                                                  
/*0x160*/     struct _LIST_ENTRY PhysicalVadList;                                // 2 elements, 0x8 bytes (sizeof)     
              union                                                              // 2 elements, 0x8 bytes (sizeof)     
              {                                                                                                        
/*0x168*/         struct _HARDWARE_PTE PageDirectoryPte;                         // 16 elements, 0x8 bytes (sizeof)    
/*0x168*/         UINT64       Filler;                                                                                 
              };                                                                                                       
/*0x170*/     VOID*        Session;                                                                                    
/*0x174*/     UINT8        ImageFileName[16];                                                                          
/*0x184*/     struct _LIST_ENTRY JobLinks;                                       // 2 elements, 0x8 bytes (sizeof)     
/*0x18C*/     VOID*        LockedPagesList;                                                                            
/*0x190*/     struct _LIST_ENTRY ThreadListHead;                                 // 2 elements, 0x8 bytes (sizeof)     
/*0x198*/     VOID*        SecurityPort;                                                                               
/*0x19C*/     VOID*        PaeTop;                                                                                     
/*0x1A0*/     ULONG32      ActiveThreads;                                                                              
/*0x1A4*/     ULONG32      GrantedAccess;                                                                              
/*0x1A8*/     ULONG32      DefaultHardErrorProcessing;                                                                 
/*0x1AC*/     LONG32       LastThreadExitStatus;                                                                       
/*0x1B0*/     struct _PEB* Peb;                                                                                        
/*0x1B4*/     struct _EX_FAST_REF PrefetchTrace;                                 // 3 elements, 0x4 bytes (sizeof)     
/*0x1B8*/     union _LARGE_INTEGER ReadOperationCount;                           // 4 elements, 0x8 bytes (sizeof)     
/*0x1C0*/     union _LARGE_INTEGER WriteOperationCount;                          // 4 elements, 0x8 bytes (sizeof)     
/*0x1C8*/     union _LARGE_INTEGER OtherOperationCount;                          // 4 elements, 0x8 bytes (sizeof)     
/*0x1D0*/     union _LARGE_INTEGER ReadTransferCount;                            // 4 elements, 0x8 bytes (sizeof)     
/*0x1D8*/     union _LARGE_INTEGER WriteTransferCount;                           // 4 elements, 0x8 bytes (sizeof)     
/*0x1E0*/     union _LARGE_INTEGER OtherTransferCount;                           // 4 elements, 0x8 bytes (sizeof)     
/*0x1E8*/     ULONG32      CommitChargeLimit;                                                                          
/*0x1EC*/     ULONG32      CommitChargePeak;                                                                           
/*0x1F0*/     VOID*        AweInfo;                                                                                    
/*0x1F4*/     struct _SE_AUDIT_PROCESS_CREATION_INFO SeAuditProcessCreationInfo; // 1 elements, 0x4 bytes (sizeof)     
/*0x1F8*/     struct _MMSUPPORT Vm;                                              // 14 elements, 0x40 bytes (sizeof)   
/*0x238*/     ULONG32      LastFaultCount;                                                                             
/*0x23C*/     ULONG32      ModifiedPageCount;                                                                          
/*0x240*/     ULONG32      NumberOfVads;                                                                               
/*0x244*/     ULONG32      JobStatus;                                                                                  
              union                                                              // 2 elements, 0x4 bytes (sizeof)     
              {                                                                                                        
/*0x248*/         ULONG32      Flags;                                                                                  
                  struct                                                         // 27 elements, 0x4 bytes (sizeof)    
                  {                                                                                                    
/*0x248*/             ULONG32      CreateReported : 1;                           // 0 BitPosition                      
/*0x248*/             ULONG32      NoDebugInherit : 1;                           // 1 BitPosition                      
/*0x248*/             ULONG32      ProcessExiting : 1;                           // 2 BitPosition                      
/*0x248*/             ULONG32      ProcessDelete : 1;                            // 3 BitPosition                      
/*0x248*/             ULONG32      Wow64SplitPages : 1;                          // 4 BitPosition                      
/*0x248*/             ULONG32      VmDeleted : 1;                                // 5 BitPosition                      
/*0x248*/             ULONG32      OutswapEnabled : 1;                           // 6 BitPosition                      
/*0x248*/             ULONG32      Outswapped : 1;                               // 7 BitPosition                      
/*0x248*/             ULONG32      ForkFailed : 1;                               // 8 BitPosition                      
/*0x248*/             ULONG32      HasPhysicalVad : 1;                           // 9 BitPosition                      
/*0x248*/             ULONG32      AddressSpaceInitialized : 2;                  // 10 BitPosition                     
/*0x248*/             ULONG32      SetTimerResolution : 1;                       // 12 BitPosition                     
/*0x248*/             ULONG32      BreakOnTermination : 1;                       // 13 BitPosition                     
/*0x248*/             ULONG32      SessionCreationUnderway : 1;                  // 14 BitPosition                     
/*0x248*/             ULONG32      WriteWatch : 1;                               // 15 BitPosition                     
/*0x248*/             ULONG32      ProcessInSession : 1;                         // 16 BitPosition                     
/*0x248*/             ULONG32      OverrideAddressSpace : 1;                     // 17 BitPosition                     
/*0x248*/             ULONG32      HasAddressSpace : 1;                          // 18 BitPosition                     
/*0x248*/             ULONG32      LaunchPrefetched : 1;                         // 19 BitPosition                     
/*0x248*/             ULONG32      InjectInpageErrors : 1;                       // 20 BitPosition                     
/*0x248*/             ULONG32      VmTopDown : 1;                                // 21 BitPosition                     
/*0x248*/             ULONG32      Unused3 : 1;                                  // 22 BitPosition                     
/*0x248*/             ULONG32      Unused4 : 1;                                  // 23 BitPosition                     
/*0x248*/             ULONG32      VdmAllowed : 1;                               // 24 BitPosition                     
/*0x248*/             ULONG32      Unused : 5;                                   // 25 BitPosition                     
/*0x248*/             ULONG32      Unused1 : 1;                                  // 30 BitPosition                     
/*0x248*/             ULONG32      Unused2 : 1;                                  // 31 BitPosition                     
                  };                                                                                                   
              };                                                                                                       
/*0x24C*/     LONG32       ExitStatus;                                                                                 
/*0x250*/     UINT16       NextPageColor;                                                                              
              union                                                              // 2 elements, 0x2 bytes (sizeof)     
              {                                                                                                        
                  struct                                                         // 2 elements, 0x2 bytes (sizeof)     
                  {                                                                                                    
/*0x252*/             UINT8        SubSystemMinorVersion;                                                              
/*0x253*/             UINT8        SubSystemMajorVersion;                                                              
                  };                                                                                                   
/*0x252*/         UINT16       SubSystemVersion;                                                                       
              };                                                                                                       
/*0x254*/     UINT8        PriorityClass;                                                                              
/*0x255*/     UINT8        WorkingSetAcquiredUnsafe;                                                                   
/*0x256*/     UINT8        _PADDING0_[0x2];                                                                            
/*0x258*/     ULONG32      Cookie;                                                                                     
/*0x25C*/     UINT8        _PADDING1_[0x4];                                                                            
          }EPROCESS, *PEPROCESS;                                                                                       
                                                                                                                       
          typedef struct _EPROCESS_QUOTA_ENTRY // 4 elements, 0x10 bytes (sizeof) 
          {                                                                       
/*0x000*/     ULONG32      Usage;                                                 
/*0x004*/     ULONG32      Limit;                                                 
/*0x008*/     ULONG32      Peak;                                                  
/*0x00C*/     ULONG32      Return;                                                
          }EPROCESS_QUOTA_ENTRY, *PEPROCESS_QUOTA_ENTRY;                                   
                                                                                  
          typedef struct _EPROCESS_QUOTA_BLOCK            // 4 elements, 0x40 bytes (sizeof) 
          {                                                                                  
/*0x000*/     struct _EPROCESS_QUOTA_ENTRY QuotaEntry[3];                                    
/*0x030*/     struct _LIST_ENTRY QuotaList;               // 2 elements, 0x8 bytes (sizeof)  
/*0x038*/     ULONG32      ReferenceCount;                                                   
/*0x03C*/     ULONG32      ProcessCount;                                                     
          }EPROCESS_QUOTA_BLOCK, *PEPROCESS_QUOTA_BLOCK;                                     
                                                                                             
          typedef struct _KAPC_STATE             // 5 elements, 0x18 bytes (sizeof) 
          {                                                                         
/*0x000*/     struct _LIST_ENTRY ApcListHead[2];                                    
/*0x010*/     struct _KPROCESS* Process;                                            
/*0x014*/     UINT8        KernelApcInProgress;                                     
/*0x015*/     UINT8        KernelApcPending;                                        
/*0x016*/     UINT8        UserApcPending;                                          
/*0x017*/     UINT8        _PADDING0_[0x1];                                         
          }KAPC_STATE, *PKAPC_STATE;                                                
                                                                                    
          typedef struct _KWAIT_BLOCK             // 6 elements, 0x18 bytes (sizeof) 
          {                                                                          
/*0x000*/     struct _LIST_ENTRY WaitListEntry;   // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _KTHREAD* Thread;                                               
/*0x00C*/     VOID*        Object;                                                   
/*0x010*/     struct _KWAIT_BLOCK* NextWaitBlock;                                    
/*0x014*/     UINT16       WaitKey;                                                  
/*0x016*/     UINT16       WaitType;                                                 
          }KWAIT_BLOCK, *PKWAIT_BLOCK;                                               
                                                                                     
          typedef union _ULARGE_INTEGER  // 4 elements, 0x8 bytes (sizeof) 
          {                                                                
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         ULONG32      HighPart;                                   
              };                                                           
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         ULONG32      HighPart;                                   
              }u;                                                          
/*0x000*/     UINT64       QuadPart;                                       
          }ULARGE_INTEGER, *PULARGE_INTEGER;                                  
                                                                           
          typedef struct _KTIMER                 // 5 elements, 0x28 bytes (sizeof) 
          {                                                                         
/*0x000*/     struct _DISPATCHER_HEADER Header;  // 6 elements, 0x10 bytes (sizeof) 
/*0x010*/     union _ULARGE_INTEGER DueTime;     // 4 elements, 0x8 bytes (sizeof)  
/*0x018*/     struct _LIST_ENTRY TimerListEntry; // 2 elements, 0x8 bytes (sizeof)  
/*0x020*/     struct _KDPC* Dpc;                                                    
/*0x024*/     LONG32       Period;                                                  
          }KTIMER, *PKTIMER;                                                        
                                                                                    
          typedef struct _KAPC                                // 14 elements, 0x30 bytes (sizeof) 
          {                                                                                       
/*0x000*/     INT16        Type;                                                                  
/*0x002*/     INT16        Size;                                                                  
/*0x004*/     ULONG32      Spare0;                                                                
/*0x008*/     struct _KTHREAD* Thread;                                                            
/*0x00C*/     struct _LIST_ENTRY ApcListEntry;                // 2 elements, 0x8 bytes (sizeof)   
/*0x014*/     FUNCT_00BC_01A1_KernelRoutine* KernelRoutine;                                       
/*0x018*/     FUNCT_00BC_01B0_RundownRoutine* RundownRoutine;                                     
/*0x01C*/     FUNCT_00BC_01AA_NormalRoutine* NormalRoutine;                                       
/*0x020*/     VOID*        NormalContext;                                                         
/*0x024*/     VOID*        SystemArgument1;                                                       
/*0x028*/     VOID*        SystemArgument2;                                                       
/*0x02C*/     CHAR         ApcStateIndex;                                                         
/*0x02D*/     CHAR         ApcMode;                                                               
/*0x02E*/     UINT8        Inserted;                                                              
/*0x02F*/     UINT8        _PADDING0_[0x1];                                                       
          }KAPC, *PKAPC;                                                                          
                                                                                                  
          typedef struct _KSEMAPHORE            // 2 elements, 0x14 bytes (sizeof) 
          {                                                                        
/*0x000*/     struct _DISPATCHER_HEADER Header; // 6 elements, 0x10 bytes (sizeof) 
/*0x010*/     LONG32       Limit;                                                  
          }KSEMAPHORE, *PKSEMAPHORE;                                               
                                                                                   
          typedef struct _KTHREAD                          // 73 elements, 0x1C0 bytes (sizeof) 
          {                                                                                     
/*0x000*/     struct _DISPATCHER_HEADER Header;            // 6 elements, 0x10 bytes (sizeof)   
/*0x010*/     struct _LIST_ENTRY MutantListHead;           // 2 elements, 0x8 bytes (sizeof)    
/*0x018*/     VOID*        InitialStack;                                                        
/*0x01C*/     VOID*        StackLimit;                                                          
/*0x020*/     VOID*        Teb;                                                                 
/*0x024*/     VOID*        TlsArray;                                                            
/*0x028*/     VOID*        KernelStack;                                                         
/*0x02C*/     UINT8        DebugActive;                                                         
/*0x02D*/     UINT8        State;                                                               
/*0x02E*/     UINT8        Alerted[2];                                                          
/*0x030*/     UINT8        Iopl;                                                                
/*0x031*/     UINT8        NpxState;                                                            
/*0x032*/     CHAR         Saturation;                                                          
/*0x033*/     CHAR         Priority;                                                            
/*0x034*/     struct _KAPC_STATE ApcState;                 // 5 elements, 0x18 bytes (sizeof)   
/*0x04C*/     ULONG32      ContextSwitches;                                                     
/*0x050*/     UINT8        IdleSwapBlock;                                                       
/*0x051*/     UINT8        Spare0[3];                                                           
/*0x054*/     LONG32       WaitStatus;                                                          
/*0x058*/     UINT8        WaitIrql;                                                            
/*0x059*/     CHAR         WaitMode;                                                            
/*0x05A*/     UINT8        WaitNext;                                                            
/*0x05B*/     UINT8        WaitReason;                                                          
/*0x05C*/     struct _KWAIT_BLOCK* WaitBlockList;                                               
              union                                        // 2 elements, 0x8 bytes (sizeof)    
              {                                                                                 
/*0x060*/         struct _LIST_ENTRY WaitListEntry;        // 2 elements, 0x8 bytes (sizeof)    
/*0x060*/         struct _SINGLE_LIST_ENTRY SwapListEntry; // 1 elements, 0x4 bytes (sizeof)    
              };                                                                                
/*0x068*/     ULONG32      WaitTime;                                                            
/*0x06C*/     CHAR         BasePriority;                                                        
/*0x06D*/     UINT8        DecrementCount;                                                      
/*0x06E*/     CHAR         PriorityDecrement;                                                   
/*0x06F*/     CHAR         Quantum;                                                             
/*0x070*/     struct _KWAIT_BLOCK WaitBlock[4];                                                 
/*0x0D0*/     VOID*        LegoData;                                                            
/*0x0D4*/     ULONG32      KernelApcDisable;                                                    
/*0x0D8*/     ULONG32      UserAffinity;                                                        
/*0x0DC*/     UINT8        SystemAffinityActive;                                                
/*0x0DD*/     UINT8        PowerState;                                                          
/*0x0DE*/     UINT8        NpxIrql;                                                             
/*0x0DF*/     UINT8        InitialNode;                                                         
/*0x0E0*/     VOID*        ServiceTable;                                                        
/*0x0E4*/     struct _KQUEUE* Queue;                                                            
/*0x0E8*/     ULONG32      ApcQueueLock;                                                        
/*0x0EC*/     UINT8        _PADDING0_[0x4];                                                     
/*0x0F0*/     struct _KTIMER Timer;                        // 5 elements, 0x28 bytes (sizeof)   
/*0x118*/     struct _LIST_ENTRY QueueListEntry;           // 2 elements, 0x8 bytes (sizeof)    
/*0x120*/     ULONG32      SoftAffinity;                                                        
/*0x124*/     ULONG32      Affinity;                                                            
/*0x128*/     UINT8        Preempted;                                                           
/*0x129*/     UINT8        ProcessReadyQueue;                                                   
/*0x12A*/     UINT8        KernelStackResident;                                                 
/*0x12B*/     UINT8        NextProcessor;                                                       
/*0x12C*/     VOID*        CallbackStack;                                                       
/*0x130*/     VOID*        Win32Thread;                                                         
/*0x134*/     struct _KTRAP_FRAME* TrapFrame;                                                   
/*0x138*/     struct _KAPC_STATE* ApcStatePointer[2];                                           
/*0x140*/     CHAR         PreviousMode;                                                        
/*0x141*/     UINT8        EnableStackSwap;                                                     
/*0x142*/     UINT8        LargeStack;                                                          
/*0x143*/     UINT8        ResourceIndex;                                                       
/*0x144*/     ULONG32      KernelTime;                                                          
/*0x148*/     ULONG32      UserTime;                                                            
/*0x14C*/     struct _KAPC_STATE SavedApcState;            // 5 elements, 0x18 bytes (sizeof)   
/*0x164*/     UINT8        Alertable;                                                           
/*0x165*/     UINT8        ApcStateIndex;                                                       
/*0x166*/     UINT8        ApcQueueable;                                                        
/*0x167*/     UINT8        AutoAlignment;                                                       
/*0x168*/     VOID*        StackBase;                                                           
/*0x16C*/     struct _KAPC SuspendApc;                     // 14 elements, 0x30 bytes (sizeof)  
/*0x19C*/     struct _KSEMAPHORE SuspendSemaphore;         // 2 elements, 0x14 bytes (sizeof)   
/*0x1B0*/     struct _LIST_ENTRY ThreadListEntry;          // 2 elements, 0x8 bytes (sizeof)    
/*0x1B8*/     CHAR         FreezeCount;                                                         
/*0x1B9*/     CHAR         SuspendCount;                                                        
/*0x1BA*/     UINT8        IdealProcessor;                                                      
/*0x1BB*/     UINT8        DisableBoost;                                                        
/*0x1BC*/     UINT8        _PADDING1_[0x4];                                                     
          }KTHREAD, *PKTHREAD;                                                                  
                                                                                                
          typedef struct _ETHREAD                                      // 54 elements, 0x258 bytes (sizeof) 
          {                                                                                                 
/*0x000*/     struct _KTHREAD Tcb;                                     // 73 elements, 0x1C0 bytes (sizeof) 
              union                                                    // 2 elements, 0x8 bytes (sizeof)    
              {                                                                                             
/*0x1C0*/         union _LARGE_INTEGER CreateTime;                     // 4 elements, 0x8 bytes (sizeof)    
                  struct                                               // 2 elements, 0x4 bytes (sizeof)    
                  {                                                                                         
/*0x1C0*/             UINT32       NestedFaultCount : 2;               // 0 BitPosition                     
/*0x1C0*/             UINT32       ApcNeeded : 1;                      // 2 BitPosition                     
                  };                                                                                        
              };                                                                                            
              union                                                    // 3 elements, 0x8 bytes (sizeof)    
              {                                                                                             
/*0x1C8*/         union _LARGE_INTEGER ExitTime;                       // 4 elements, 0x8 bytes (sizeof)    
/*0x1C8*/         struct _LIST_ENTRY LpcReplyChain;                    // 2 elements, 0x8 bytes (sizeof)    
/*0x1C8*/         struct _LIST_ENTRY KeyedWaitChain;                   // 2 elements, 0x8 bytes (sizeof)    
              };                                                                                            
              union                                                    // 2 elements, 0x4 bytes (sizeof)    
              {                                                                                             
/*0x1D0*/         LONG32       ExitStatus;                                                                  
/*0x1D0*/         VOID*        OfsChain;                                                                    
              };                                                                                            
/*0x1D4*/     struct _LIST_ENTRY PostBlockList;                        // 2 elements, 0x8 bytes (sizeof)    
              union                                                    // 3 elements, 0x4 bytes (sizeof)    
              {                                                                                             
/*0x1DC*/         struct _TERMINATION_PORT* TerminationPort;                                                
/*0x1DC*/         struct _ETHREAD* ReaperLink;                                                              
/*0x1DC*/         VOID*        KeyedWaitValue;                                                              
              };                                                                                            
/*0x1E0*/     ULONG32      ActiveTimerListLock;                                                             
/*0x1E4*/     struct _LIST_ENTRY ActiveTimerListHead;                  // 2 elements, 0x8 bytes (sizeof)    
/*0x1EC*/     struct _CLIENT_ID Cid;                                   // 2 elements, 0x8 bytes (sizeof)    
              union                                                    // 2 elements, 0x14 bytes (sizeof)   
              {                                                                                             
/*0x1F4*/         struct _KSEMAPHORE LpcReplySemaphore;                // 2 elements, 0x14 bytes (sizeof)   
/*0x1F4*/         struct _KSEMAPHORE KeyedWaitSemaphore;               // 2 elements, 0x14 bytes (sizeof)   
              };                                                                                            
              union                                                    // 2 elements, 0x4 bytes (sizeof)    
              {                                                                                             
/*0x208*/         VOID*        LpcReplyMessage;                                                             
/*0x208*/         VOID*        LpcWaitingOnPort;                                                            
              };                                                                                            
/*0x20C*/     struct _PS_IMPERSONATION_INFORMATION* ImpersonationInfo;                                      
/*0x210*/     struct _LIST_ENTRY IrpList;                              // 2 elements, 0x8 bytes (sizeof)    
/*0x218*/     ULONG32      TopLevelIrp;                                                                     
/*0x21C*/     struct _DEVICE_OBJECT* DeviceToVerify;                                                        
/*0x220*/     struct _EPROCESS* ThreadsProcess;                                                             
/*0x224*/     VOID*        StartAddress;                                                                    
              union                                                    // 2 elements, 0x4 bytes (sizeof)    
              {                                                                                             
/*0x228*/         VOID*        Win32StartAddress;                                                           
/*0x228*/         ULONG32      LpcReceivedMessageId;                                                        
              };                                                                                            
/*0x22C*/     struct _LIST_ENTRY ThreadListEntry;                      // 2 elements, 0x8 bytes (sizeof)    
/*0x234*/     struct _EX_RUNDOWN_REF RundownProtect;                   // 2 elements, 0x4 bytes (sizeof)    
/*0x238*/     struct _EX_PUSH_LOCK ThreadLock;                         // 5 elements, 0x4 bytes (sizeof)    
/*0x23C*/     ULONG32      LpcReplyMessageId;                                                               
/*0x240*/     ULONG32      ReadClusterSize;                                                                 
/*0x244*/     ULONG32      GrantedAccess;                                                                   
              union                                                    // 2 elements, 0x4 bytes (sizeof)    
              {                                                                                             
/*0x248*/         ULONG32      CrossThreadFlags;                                                            
                  struct                                               // 9 elements, 0x4 bytes (sizeof)    
                  {                                                                                         
/*0x248*/             ULONG32      Terminated : 1;                     // 0 BitPosition                     
/*0x248*/             ULONG32      DeadThread : 1;                     // 1 BitPosition                     
/*0x248*/             ULONG32      HideFromDebugger : 1;               // 2 BitPosition                     
/*0x248*/             ULONG32      ActiveImpersonationInfo : 1;        // 3 BitPosition                     
/*0x248*/             ULONG32      SystemThread : 1;                   // 4 BitPosition                     
/*0x248*/             ULONG32      HardErrorsAreDisabled : 1;          // 5 BitPosition                     
/*0x248*/             ULONG32      BreakOnTermination : 1;             // 6 BitPosition                     
/*0x248*/             ULONG32      SkipCreationMsg : 1;                // 7 BitPosition                     
/*0x248*/             ULONG32      SkipTerminationMsg : 1;             // 8 BitPosition                     
                  };                                                                                        
              };                                                                                            
              union                                                    // 2 elements, 0x4 bytes (sizeof)    
              {                                                                                             
/*0x24C*/         ULONG32      SameThreadPassiveFlags;                                                      
                  struct                                               // 3 elements, 0x4 bytes (sizeof)    
                  {                                                                                         
/*0x24C*/             ULONG32      ActiveExWorker : 1;                 // 0 BitPosition                     
/*0x24C*/             ULONG32      ExWorkerCanWaitUser : 1;            // 1 BitPosition                     
/*0x24C*/             ULONG32      MemoryMaker : 1;                    // 2 BitPosition                     
                  };                                                                                        
              };                                                                                            
              union                                                    // 2 elements, 0x4 bytes (sizeof)    
              {                                                                                             
/*0x250*/         ULONG32      SameThreadApcFlags;                                                          
                  struct                                               // 3 elements, 0x1 bytes (sizeof)    
                  {                                                                                         
/*0x250*/             UINT8        LpcReceivedMsgIdValid : 1;          // 0 BitPosition                     
/*0x250*/             UINT8        LpcExitThreadCalled : 1;            // 1 BitPosition                     
/*0x250*/             UINT8        AddressSpaceOwner : 1;              // 2 BitPosition                     
                  };                                                                                        
              };                                                                                            
/*0x254*/     UINT8        ForwardClusterOnly;                                                              
/*0x255*/     UINT8        DisablePageFaultClustering;                                                      
/*0x256*/     UINT8        _PADDING0_[0x2];                                                                 
          }ETHREAD, *PETHREAD;                                                                              
                                                                                                            
          typedef struct _ETIMER                       // 9 elements, 0x98 bytes (sizeof)  
          {                                                                                
/*0x000*/     struct _KTIMER KeTimer;                  // 5 elements, 0x28 bytes (sizeof)  
/*0x028*/     struct _KAPC TimerApc;                   // 14 elements, 0x30 bytes (sizeof) 
/*0x058*/     struct _KDPC TimerDpc;                   // 9 elements, 0x20 bytes (sizeof)  
/*0x078*/     struct _LIST_ENTRY ActiveTimerListEntry; // 2 elements, 0x8 bytes (sizeof)   
/*0x080*/     ULONG32      Lock;                                                           
/*0x084*/     LONG32       Period;                                                         
/*0x088*/     UINT8        ApcAssociated;                                                  
/*0x089*/     UINT8        WakeTimer;                                                      
/*0x08A*/     UINT8        _PADDING0_[0x2];                                                
/*0x08C*/     struct _LIST_ENTRY WakeTimerListEntry;   // 2 elements, 0x8 bytes (sizeof)   
/*0x094*/     UINT8        _PADDING1_[0x4];                                                
          }ETIMER, *PETIMER;                                                               
                                                                                           
          typedef struct _EVENT_COUNTER            // 3 elements, 0x18 bytes (sizeof) 
          {                                                                           
/*0x000*/     struct _SINGLE_LIST_ENTRY ListEntry; // 1 elements, 0x4 bytes (sizeof)  
/*0x004*/     ULONG32      RefCount;                                                  
/*0x008*/     struct _KEVENT Event;                // 1 elements, 0x10 bytes (sizeof) 
          }EVENT_COUNTER, *PEVENT_COUNTER;                                            
                                                                                      
          typedef struct _EX_PUSH_LOCK_CACHE_AWARE // 1 elements, 0x80 bytes (sizeof) 
          {                                                                           
/*0x000*/     struct _EX_PUSH_LOCK* Locks[32];                                        
          }EX_PUSH_LOCK_CACHE_AWARE, *PEX_PUSH_LOCK_CACHE_AWARE;                                   
                                                                                      
          typedef struct _EX_PUSH_LOCK_WAIT_BLOCK    // 4 elements, 0x1C bytes (sizeof) 
          {                                                                             
/*0x000*/     struct _KEVENT WakeEvent;              // 1 elements, 0x10 bytes (sizeof) 
/*0x010*/     struct _EX_PUSH_LOCK_WAIT_BLOCK* Next;                                    
/*0x014*/     ULONG32      ShareCount;                                                  
/*0x018*/     UINT8        Exclusive;                                                   
/*0x019*/     UINT8        _PADDING0_[0x3];                                             
          }EX_PUSH_LOCK_WAIT_BLOCK, *PEX_PUSH_LOCK_WAIT_BLOCK;                                   
                                                                                        
          typedef union _EX_QUEUE_WORKER_INFO              // 5 elements, 0x4 bytes (sizeof) 
          {                                                                                  
              struct                                       // 4 elements, 0x4 bytes (sizeof) 
              {                                                                              
/*0x000*/         ULONG32      QueueDisabled : 1;          // 0 BitPosition                  
/*0x000*/         ULONG32      MakeThreadsAsNecessary : 1; // 1 BitPosition                  
/*0x000*/         ULONG32      WaitMode : 1;               // 2 BitPosition                  
/*0x000*/         ULONG32      WorkerCount : 29;           // 3 BitPosition                  
              };                                                                             
/*0x000*/     LONG32       QueueWorkerInfo;                                                  
          }EX_QUEUE_WORKER_INFO, *PEX_QUEUE_WORKER_INFO;                                     
                                                                                             
          typedef struct _KQUEUE                 // 5 elements, 0x28 bytes (sizeof) 
          {                                                                         
/*0x000*/     struct _DISPATCHER_HEADER Header;  // 6 elements, 0x10 bytes (sizeof) 
/*0x010*/     struct _LIST_ENTRY EntryListHead;  // 2 elements, 0x8 bytes (sizeof)  
/*0x018*/     ULONG32      CurrentCount;                                            
/*0x01C*/     ULONG32      MaximumCount;                                            
/*0x020*/     struct _LIST_ENTRY ThreadListHead; // 2 elements, 0x8 bytes (sizeof)  
          }KQUEUE, *PKQUEUE;                                                        
                                                                                    
          typedef struct _EX_WORK_QUEUE                // 6 elements, 0x3C bytes (sizeof) 
          {                                                                               
/*0x000*/     struct _KQUEUE WorkerQueue;              // 5 elements, 0x28 bytes (sizeof) 
/*0x028*/     ULONG32      DynamicThreadCount;                                            
/*0x02C*/     ULONG32      WorkItemsProcessed;                                            
/*0x030*/     ULONG32      WorkItemsProcessedLastPass;                                    
/*0x034*/     ULONG32      QueueDepthLastPass;                                            
/*0x038*/     union _EX_QUEUE_WORKER_INFO Info;        // 5 elements, 0x4 bytes (sizeof)  
          }EX_WORK_QUEUE, *PEX_WORK_QUEUE;                                                
                                                                                          
          typedef struct _EXCEPTION_POINTERS             // 2 elements, 0x8 bytes (sizeof) 
          {                                                                                
/*0x000*/     struct _EXCEPTION_RECORD* ExceptionRecord;                                   
/*0x004*/     struct _CONTEXT* ContextRecord;                                              
          }EXCEPTION_POINTERS, *PEXCEPTION_POINTERS;                                       
                                                                                           
          typedef struct _EXCEPTION_RECORD               // 6 elements, 0x50 bytes (sizeof) 
          {                                                                                 
/*0x000*/     LONG32       ExceptionCode;                                                   
/*0x004*/     ULONG32      ExceptionFlags;                                                  
/*0x008*/     struct _EXCEPTION_RECORD* ExceptionRecord;                                    
/*0x00C*/     VOID*        ExceptionAddress;                                                
/*0x010*/     ULONG32      NumberParameters;                                                
/*0x014*/     ULONG32      ExceptionInformation[15];                                        
          }EXCEPTION_RECORD, *PEXCEPTION_RECORD;                                            
                                                                                            
          typedef struct _EXCEPTION_REGISTRATION_RECORD    // 2 elements, 0x8 bytes (sizeof) 
          {                                                                                  
/*0x000*/     struct _EXCEPTION_REGISTRATION_RECORD* Next;                                   
/*0x004*/     FUNCT_0161_0160_Handler* Handler;                                              
          }EXCEPTION_REGISTRATION_RECORD, *PEXCEPTION_REGISTRATION_RECORD;                                  
                                                                                             
          typedef struct _FAST_IO_DISPATCH                                                                                // 28 elements, 0x70 bytes (sizeof) 
          {                                                                                                                                                   
/*0x000*/     ULONG32      SizeOfFastIoDispatch;                                                                                                              
/*0x004*/     FUNCT_003D_0469_FastIoCheckIfPossible* FastIoCheckIfPossible;                                                                                   
/*0x008*/     FUNCT_003D_0478_FastIoRead_FastIoWrite* FastIoRead;                                                                                             
/*0x00C*/     FUNCT_003D_0478_FastIoRead_FastIoWrite* FastIoWrite;                                                                                            
/*0x010*/     FUNCT_003D_0482_FastIoQueryBasicInfo* FastIoQueryBasicInfo;                                                                                     
/*0x014*/     FUNCT_003D_0490_FastIoQueryStandardInfo* FastIoQueryStandardInfo;                                                                               
/*0x018*/     FUNCT_003D_049E_FastIoLock* FastIoLock;                                                                                                         
/*0x01C*/     FUNCT_003D_067B_FastIoUnlockSingle* FastIoUnlockSingle;                                                                                         
/*0x020*/     FUNCT_003D_0684_FastIoUnlockAll* FastIoUnlockAll;                                                                                               
/*0x024*/     FUNCT_003D_068A_FastIoUnlockAllByKey* FastIoUnlockAllByKey;                                                                                     
/*0x028*/     FUNCT_003D_0691_FastIoDeviceControl* FastIoDeviceControl;                                                                                       
/*0x02C*/     FUNCT_00BC_069C_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection* AcquireFileForNtCreateSection;                                     
/*0x030*/     FUNCT_00BC_069C_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection* ReleaseFileForNtCreateSection;                                     
/*0x034*/     FUNCT_00BC_069F_FastIoDetachDevice* FastIoDetachDevice;                                                                                         
